#pragma once

/*
* SDK generated by Rei-SdkDumper
* Based on Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_GirlBase_Preview

#include "Basic.hpp"

#include "PhysicsControl_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_GirlBase_Preview.ABP_GirlBase_Preview_C
// 0x3EA0 (0x4AE0 - 0x0C40)
class UABP_GirlBase_Preview_C : public UPreviewCharacterAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0C40(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root_4;                              // 0x0C48(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_3;                   // 0x0C78(0x0118)()
	struct FAnimNode_RigidBodyWithControl         AnimGraphNode_RigidBodyWithControl;                // 0x0D90(0x0B20)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_3;             // 0x18B0(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_3;             // 0x18D0(0x0020)()
	struct FAnimNode_Root                         AnimGraphNode_Root_3;                              // 0x18F0(0x0030)()
	struct FAnimNode_RefPose                      AnimGraphNode_LocalRefPose_4;                      // 0x1920(0x0018)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_4;                  // 0x1938(0x00C0)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_2;                   // 0x19F8(0x0118)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_3;                  // 0x1B10(0x00C0)()
	struct FAnimNode_RefPose                      AnimGraphNode_LocalRefPose_3;                      // 0x1BD0(0x0018)()
	struct FAnimNode_Root                         AnimGraphNode_Root_2;                              // 0x1BE8(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_1;                   // 0x1C18(0x0118)()
	struct FAnimNode_RefPose                      AnimGraphNode_LocalRefPose_2;                      // 0x1D30(0x0018)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_2;                  // 0x1D48(0x00C0)()
	struct FAnimNode_Root                         AnimGraphNode_Root_1;                              // 0x1E08(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x1E38(0x0118)()
	struct FAnimNode_RefPose                      AnimGraphNode_LocalRefPose_1;                      // 0x1F50(0x0018)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_1;                  // 0x1F68(0x00C0)()
	struct FAnimNode_RefPose                      AnimGraphNode_LocalRefPose;                        // 0x2028(0x0018)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend;                    // 0x2040(0x00C0)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x2100(0x0030)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_3;                              // 0x2130(0x0048)()
	struct FAnimNode_Inertialization              AnimGraphNode_Inertialization;                     // 0x2178(0x0070)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_2;                    // 0x21E8(0x0080)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_2;                              // 0x2268(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_3;                   // 0x22B0(0x00A0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x2350(0x0080)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_2;                   // 0x23D0(0x00A0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x2470(0x0080)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_1;                              // 0x24F0(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult;                         // 0x2538(0x0030)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine;                        // 0x2568(0x00B0)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x2618(0x0048)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_2;                        // 0x2660(0x0108)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_2;             // 0x2768(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_2;             // 0x2788(0x0020)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_3;                   // 0x27A8(0x00B0)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_1;             // 0x2858(0x0020)()
	uint8                                         Pad_2878[0x8];                                     // 0x2878(0x0008)(Fixing Size After Last Property [ Rei-SdkDumper ])
	struct FAnimNode_RigidBody                    AnimGraphNode_RigidBody_3;                         // 0x2880(0x0650)()
	struct FAnimNode_RigidBody                    AnimGraphNode_RigidBody_2;                         // 0x2ED0(0x0650)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_1;                   // 0x3520(0x00A0)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_1;             // 0x35C0(0x0020)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x35E0(0x0020)()
	struct FAnimNode_RigidBody                    AnimGraphNode_RigidBody_1;                         // 0x3600(0x0650)()
	struct FAnimNode_RigidBody                    AnimGraphNode_RigidBody;                           // 0x3C50(0x0650)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x42A0(0x0020)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_1;                    // 0x42C0(0x0158)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_3;                     // 0x4418(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_2;                     // 0x4440(0x0028)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_2;                   // 0x4468(0x00B0)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_1;                   // 0x4518(0x00B0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0x45C8(0x0158)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_1;                     // 0x4720(0x0028)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer;                     // 0x4748(0x00B0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0x47F8(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x4820(0x00A0)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_1;                        // 0x48C0(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone;                          // 0x49C8(0x0108)()
	struct FVector                                HeadScale;                                         // 0x4AD0(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         WeaponHiddenCurveValue;                            // 0x4ADC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void PostPhys_Rig(const struct FPoseLink& BeforePostPhyAndRig, struct FPoseLink* PostPhys_Rig_0);
	void ForbiddenBreastAnimLayerOfNewSkeleton(const struct FPoseLink& BeforeForbiddenBreastAnim, struct FPoseLink* ForbiddenBreastAnimLayerOfNewSkeleton_0);
	void ForbiddenHipAnimLayerOfNewSkeleton(const struct FPoseLink& BeforeForbiddenHipAnim, struct FPoseLink* ForbiddenHipAnimLayerOfNewSkeleton_0);
	void ForbiddenBreastAnimLayer(const struct FPoseLink& InPose, struct FPoseLink* ForbiddenBreastAnimLayer_0);
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_GirlBase_Preview_AnimGraphNode_ModifyBone_508DE89646933665EBECC0A4AC884886();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_GirlBase_Preview_AnimGraphNode_ModifyBone_85ABBE04479F4A8061CD1D8E1AB9504F();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_GirlBase_Preview_AnimGraphNode_LayeredBoneBlend_35099E90437CA8931BFFB88066A6D32A();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_GirlBase_Preview_AnimGraphNode_LayeredBoneBlend_4A515A62484D0CA2027244A5BF500502();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_GirlBase_Preview_AnimGraphNode_LayeredBoneBlend_7793A23446862FCADBFAAC875B3700C3();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_GirlBase_Preview_AnimGraphNode_LayeredBoneBlend_0049CFDA4D2141C45DEEE7BE2D011255();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_GirlBase_Preview_AnimGraphNode_LayeredBoneBlend_C975215640D900BEFA4D43AD397CCA24();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_GirlBase_Preview_AnimGraphNode_RigidBodyWithControl_77C9D81E4E5D27ECB7B777B83B9099A1();
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void ExecuteUbergraph_ABP_GirlBase_Preview(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("ABP_GirlBase_Preview_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ABP_GirlBase_Preview_C")
	}
	static class UABP_GirlBase_Preview_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_GirlBase_Preview_C>();
	}
};
DUMPER7_ASSERTS_UABP_GirlBase_Preview_C;

}

