#pragma once

/*
* SDK generated by Rei-SdkDumper
* Based on Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_Character

#include "Basic.hpp"

#include "PhysicsControl_structs.hpp"
#include "Engine_structs.hpp"
#include "CharacterInteractionV3_structs.hpp"
#include "CharacterInteractionV3_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "SeasunAnimGraph_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_Character.ABP_Character_C
// 0x1C70 (0x2050 - 0x03E0)
class UABP_Character_C final : public UInteractionV3CharacterAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_1;                   // 0x03E8(0x0118)()
	struct FAnimNode_Root                         AnimGraphNode_Root_2;                              // 0x0500(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x0530(0x0118)()
	struct FAnimNode_Root                         AnimGraphNode_Root_1;                              // 0x0648(0x0030)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_4;                              // 0x0678(0x0048)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x06C0(0x0030)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_3;                              // 0x06F0(0x0048)()
	struct FAnimNode_InteractionV3BlendSpace      AnimGraphNode_InteractionV3BlendSpace;             // 0x0738(0x0028)()
	struct FAnimNode_ApplyMeshSpaceAdditive       AnimGraphNode_ApplyMeshSpaceAdditive;              // 0x0760(0x00D0)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_2;                              // 0x0830(0x0048)()
	struct FAnimNode_RotateSpine                  AnimGraphNode_RotateSpine;                         // 0x0878(0x00C0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_1;                    // 0x0938(0x0158)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_3;                     // 0x0A90(0x0028)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_5;             // 0x0AB8(0x0020)()
	struct FAnimNode_InteractionV3IK              AnimGraphNode_InteractionV3IK_1;                   // 0x0AD8(0x00E0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_2;                     // 0x0BB8(0x0028)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_4;             // 0x0BE0(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_3;             // 0x0C00(0x0020)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0x0C20(0x0158)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_3;             // 0x0D78(0x0020)()
	struct FAnimNode_InteractionV3IK              AnimGraphNode_InteractionV3IK;                     // 0x0D98(0x00E0)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_2;             // 0x0E78(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_2;             // 0x0E98(0x0020)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_1;                     // 0x0EB8(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0x0EE0(0x0028)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone;                          // 0x0F08(0x0108)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_1;                              // 0x1010(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x1058(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult;                         // 0x10D8(0x0030)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine;                        // 0x1108(0x00B0)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x11B8(0x0048)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_1;                   // 0x1200(0x00B0)()
	struct FAnimNode_SaveBoneTransform            AnimGraphNode_SaveBoneTransform;                   // 0x12B0(0x0150)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_1;             // 0x1400(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_1;             // 0x1420(0x0020)()
	struct FAnimNode_RigidBodyWithControl         AnimGraphNode_RigidBodyWithControl;                // 0x1440(0x0B20)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x1F60(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x1F80(0x0020)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer;                     // 0x1FA0(0x00B0)()

public:
	void PrePhysics(const struct FPoseLink& InPose_0, struct FPoseLink* PrePhysics_0);
	void PostProcess(const struct FPoseLink& InPose, struct FPoseLink* PostProcess_0);
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Character_AnimGraphNode_ModifyBone_BB644A70419B146DEC85BEA5E85644BA();
	void ExecuteUbergraph_ABP_Character(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("ABP_Character_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ABP_Character_C")
	}
	static class UABP_Character_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_Character_C>();
	}
};
DUMPER7_ASSERTS_UABP_Character_C;

}

