#pragma once

/*
* SDK generated by Rei-SdkDumper
* Based on Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AC_InteractionPhys

#include "Basic.hpp"

#include "PhysicsControl_structs.hpp"
#include "Engine_structs.hpp"
#include "CharacterInteraction_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass AC_InteractionPhys.AC_InteractionPhys_C
// 0x0120 (0x04F0 - 0x03D0)
class UAC_InteractionPhys_C final : public UInteractionPhysComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class FName                                   Profile_Name;                                      // 0x03D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           BoneNames;                                         // 0x03E0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<class FName, EPhysicsMovementType>       BodyModidiers;                                     // 0x03F0(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<class FName, bool>                       To_be_closed_Control;                              // 0x0440(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<class FName, struct FPhysicsControlData> In_Set_Control_Data;                               // 0x0490(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UCurveFloat*                            CurveFloat;                                        // 0x04E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Enable_Touch_Feet_Physics;                         // 0x04E8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4E9[0x3];                                      // 0x04E9(0x0003)(Fixing Size After Last Property [ Rei-SdkDumper ])
	float                                         ForceIntensity;                                    // 0x04EC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Debug_Sphere(const struct FVector& Center, float Radius, const struct FLinearColor& LineColor, float Duration, float Thickness);
	void ReceiveBeginPlay();
	void OnMouseOver(const struct FVector2D& OverDistance, const struct FVector2D& TargetPosition, const struct FVector2D& LastMousePos);
	void ExecuteUbergraph_AC_InteractionPhys(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("AC_InteractionPhys_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AC_InteractionPhys_C")
	}
	static class UAC_InteractionPhys_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAC_InteractionPhys_C>();
	}
};
DUMPER7_ASSERTS_UAC_InteractionPhys_C;

}

