#pragma once

/*
* SDK generated by Rei-SdkDumper
* Based on Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ApmSdk

#include "Basic.hpp"

#include "ApmSdk_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class ApmSdk.ApmSettings
// 0x0098 (0x00C0 - 0x0028)
class UApmSettings final : public UObject
{
public:
	class FString                                 AppID;                                             // 0x0028(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ReportURL;                                         // 0x0038(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ReportURLOversea;                                  // 0x0048(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ConfigURL;                                         // 0x0058(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ConfigURLOversea;                                  // 0x0068(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FApmPlatformSettings                   Windows;                                           // 0x0078(0x0018)(Edit, Config, NativeAccessSpecifierPublic)
	struct FApmPlatformSettings                   Android;                                           // 0x0090(0x0018)(Edit, Config, NativeAccessSpecifierPublic)
	struct FApmPlatformSettings                   IOS;                                               // 0x00A8(0x0018)(Edit, Config, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ApmSettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ApmSettings")
	}
	static class UApmSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UApmSettings>();
	}
};
DUMPER7_ASSERTS_UApmSettings;

// Class ApmSdk.ApmSubsystem
// 0x0398 (0x03C8 - 0x0030)
class UApmSubsystem final : public UEngineSubsystem
{
public:
	uint8                                         Pad_30[0x398];                                     // 0x0030(0x0398)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])

public:
	static void SetChannel(const class FString& InChannel);
	static void SetDeviceProfileLevel(int32 InLevel);
	static void SetGraphicsQuality(int32 InQuality);
	static void SetGraphicsQualityDetail(int32 InIndex, int32 InValue);
	static void SetGraphicsQualityDetails(const TArray<int32>& InQualityDetails);
	static void SetRoleName(const class FString& InRoleName);
	static void SetUserAccount(const class FString& InUserAccount);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ApmSubsystem")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ApmSubsystem")
	}
	static class UApmSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UApmSubsystem>();
	}
};
DUMPER7_ASSERTS_UApmSubsystem;

}

