#pragma once

/*
* SDK generated by Rei-SdkDumper
* Based on Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AutoStatCapture

#include "Basic.hpp"

#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// Class AutoStatCapture.AutoStatCaptureBP
// 0x0000 (0x0028 - 0x0028)
class UAutoStatCaptureBP final : public UBlueprintFunctionLibrary
{
public:
	static void DeleteAllMonsterAndAirbarrier();
	static struct FDictData GetPerfeyeExtData(class UWorld* World, int32 Type, const TMap<class FString, int32>& Params_0);
	static void Start(int32 Frame, int32 angleCount);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AutoStatCaptureBP")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AutoStatCaptureBP")
	}
	static class UAutoStatCaptureBP* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAutoStatCaptureBP>();
	}
};
DUMPER7_ASSERTS_UAutoStatCaptureBP;

// Class AutoStatCapture.AutoStatCapturePawn
// 0x0160 (0x03E8 - 0x0288)
class AAutoStatCapturePawn final : public APawn
{
public:
	class UCameraComponent*                       FollowCamera;                                      // 0x0288(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USceneCaptureComponent2D*               CaptureCamera;                                     // 0x0290(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USampleGenerator*                       SampleGenerator;                                   // 0x0298(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Frame;                                             // 0x02A0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         angleCount;                                        // 0x02A4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          OnlyGenerateSample;                                // 0x02A8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          GenerateGPUDatas;                                  // 0x02A9(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          CapturePerformance;                                // 0x02AA(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2AB[0x13D];                                    // 0x02AB(0x013D)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AutoStatCapturePawn")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AutoStatCapturePawn")
	}
	static class AAutoStatCapturePawn* GetDefaultObj()
	{
		return GetDefaultObjImpl<AAutoStatCapturePawn>();
	}
};
DUMPER7_ASSERTS_AAutoStatCapturePawn;

// Class AutoStatCapture.SampleGenerator
// 0x00F0 (0x01A0 - 0x00B0)
class USampleGenerator final : public UActorComponent
{
public:
	bool                                          ForceUpdate;                                       // 0x00B0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B1[0x3];                                       // 0x00B1(0x0003)(Fixing Size After Last Property [ Rei-SdkDumper ])
	int32                                         StepSize;                                          // 0x00B4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         LevelStepSize;                                     // 0x00B8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         LevelGoUpMax;                                      // 0x00BC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         LevelGoDownMax;                                    // 0x00C0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TestBlockTop;                                      // 0x00C4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TestBlockBottom;                                   // 0x00C8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_CC[0x4];                                       // 0x00CC(0x0004)(Fixing Size After Last Property [ Rei-SdkDumper ])
	TArray<struct FVector>                        SampleStart;                                       // 0x00D0(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_E0[0xC0];                                      // 0x00E0(0x00C0)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SampleGenerator")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SampleGenerator")
	}
	static class USampleGenerator* GetDefaultObj()
	{
		return GetDefaultObjImpl<USampleGenerator>();
	}
};
DUMPER7_ASSERTS_USampleGenerator;

}

