#pragma once

/*
* SDK generated by Rei-SdkDumper
* Based on Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AutoStatCapture

#include "Basic.hpp"


namespace SDK
{

// ScriptStruct AutoStatCapture.NiagaraSystemDataItem
// 0x0010 (0x0010 - 0x0000)
struct FNiagaraSystemDataItem final
{
public:
	TArray<float>                                 ParticleValues;                                    // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FNiagaraSystemDataItem;

// ScriptStruct AutoStatCapture.DataListItem
// 0x00A8 (0x00A8 - 0x0000)
struct FDataListItem final
{
public:
	int64                                         absTime;                                           // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<int32>                                 DrawTriangles;                                     // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<int32>                                 Drawcall;                                          // 0x0018(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<float>                                 NiagaraNumParticles;                               // 0x0028(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<float>                                 NiagaraNumSystems;                                 // 0x0038(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<int32>                                 ComponentsNum;                                     // 0x0048(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TMap<class FString, struct FNiagaraSystemDataItem> NiagaraSystemListData;                        // 0x0058(0x0050)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FDataListItem;

// ScriptStruct AutoStatCapture.DictData
// 0x0010 (0x0010 - 0x0000)
struct FDictData final
{
public:
	TArray<struct FDataListItem>                  datalist;                                          // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FDictData;

}

