#pragma once

/*
* SDK generated by Rei-SdkDumper
* Based on Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BaseMonster

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BaseMonster.BaseMonster_C
// 0x0100 (0x1440 - 0x1340)
class ABaseMonster_C final : public AGameAICharacter
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1340(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	float                                         ____0______0_F099B516489440C18E75FAA222800AA7;     // 0x1348(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            ____0__Direction_F099B516489440C18E75FAA222800AA7; // 0x134C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_134D[0x3];                                     // 0x134D(0x0003)(Fixing Size After Last Property [ Rei-SdkDumper ])
	class UTimelineComponent*                     时间轴_0;                                       // 0x1350(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      SpecializedParticle01;                             // 0x1358(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      SpecializedParticle02;                             // 0x1360(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      SpecializedParticle03;                             // 0x1368(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         HitBlendWeight;                                    // 0x1370(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Hit_Bone_Name;                                     // 0x1374(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Hit;                                               // 0x137C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_137D[0x3];                                     // 0x137D(0x0003)(Fixing Size After Last Property [ Rei-SdkDumper ])
	TMap<class FName, class FName>                HitBoneNameChose;                                  // 0x1380(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<class FName, float>                      HitBlendWeightChose;                               // 0x13D0(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          bParticle;                                         // 0x1420(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1421[0x7];                                     // 0x1421(0x0007)(Fixing Size After Last Property [ Rei-SdkDumper ])
	class UNiagaraComponent*                      BlockSpecializedParticle;                          // 0x1428(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UNiagaraComponent*>              SpecializedParticles;                              // 0x1430(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)

public:
	void TitanCheckTeammate(class UAbilityComponent* Ability_0);
	void SpecializedEffect(bool bSpecialized, TArray<int32>& SpecializedSkills, const struct FVector& BodyScale, class UCharacterRenderComponent* CharacterRender, float Effect1Scaler, const struct FLinearColor& Effect1LinearColor);
	void CheckIfSelfSpecialized(class UAbilityComponent* Ability_0, bool* bSpecialized, TArray<int32>* SpecializedSkillIDs);
	float Abnormal_LieDownAnimTime(int32 AnimType);
	float Abnormal_RepelAnimTime(int32 AnimType, bool bIsBack);
	float Abnormal_GetUpAnimTime(int32 AnimType);
	void 时间轴_0__FinishedFunc();
	void 时间轴_0__UpdateFunc();
	void Spwaned();
	void ReceiveBeginPlay();
	void BroadcastDeadlyDamage(const struct FApplyDamageResultData& DamageResult);
	void ReceiveTick(float DeltaSeconds);
	void ReceiveDeadlyDamage(const struct FApplyDamageResultData& DamageResultData);
	void ReceiveHitAction(const struct FHitResult& Hit_0);
	void ExecuteUbergraph_BaseMonster(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BaseMonster_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BaseMonster_C")
	}
	static class ABaseMonster_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABaseMonster_C>();
	}
};
DUMPER7_ASSERTS_ABaseMonster_C;

}

