#pragma once

/*
* SDK generated by Rei-SdkDumper
* Based on Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Blindage

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "Blindage_structs.hpp"


namespace SDK::Params
{

// Function Blindage.BlindageGenerateInterface.OnBlindageGenerated
// 0x0008 (0x0008 - 0x0000)
struct BlindageGenerateInterface_OnBlindageGenerated final
{
public:
	class ABlindage*                              Blindage;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BlindageGenerateInterface_OnBlindageGenerated;

// Function Blindage.BlindageInteract.GetLeftBufferTime
// 0x0004 (0x0004 - 0x0000)
struct BlindageInteract_GetLeftBufferTime final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BlindageInteract_GetLeftBufferTime;

// Function Blindage.BlindageInteract.GetPlayerLocationInBlindage
// 0x0018 (0x0018 - 0x0000)
struct BlindageInteract_GetPlayerLocationInBlindage final
{
public:
	class ABlindage*                              Blindage;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                ReturnValue;                                       // 0x0008(0x000C)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_BlindageInteract_GetPlayerLocationInBlindage;

// Function Blindage.BlindageInteract.GetRightBufferTime
// 0x0004 (0x0004 - 0x0000)
struct BlindageInteract_GetRightBufferTime final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BlindageInteract_GetRightBufferTime;

// Function Blindage.BlindageInteract.IsLeftMoveBuffering
// 0x0001 (0x0001 - 0x0000)
struct BlindageInteract_IsLeftMoveBuffering final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BlindageInteract_IsLeftMoveBuffering;

// Function Blindage.BlindageInteract.IsPlayerBlindageEdgeMove
// 0x0010 (0x0010 - 0x0000)
struct BlindageInteract_IsPlayerBlindageEdgeMove final
{
public:
	class ABlindage*                              Blindage;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_BlindageInteract_IsPlayerBlindageEdgeMove;

// Function Blindage.BlindageInteract.IsPlayerInBlindageState
// 0x0001 (0x0001 - 0x0000)
struct BlindageInteract_IsPlayerInBlindageState final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BlindageInteract_IsPlayerInBlindageState;

// Function Blindage.BlindageInteract.IsRightMoveBuffering
// 0x0001 (0x0001 - 0x0000)
struct BlindageInteract_IsRightMoveBuffering final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BlindageInteract_IsRightMoveBuffering;

// Function Blindage.BlindageInteract.LeftMoveBuffering
// 0x0001 (0x0001 - 0x0000)
struct BlindageInteract_LeftMoveBuffering final
{
public:
	bool                                          bValue;                                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BlindageInteract_LeftMoveBuffering;

// Function Blindage.BlindageInteract.OnBlindageDestroy
// 0x0008 (0x0008 - 0x0000)
struct BlindageInteract_OnBlindageDestroy final
{
public:
	class ABlindage*                              Blindage;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BlindageInteract_OnBlindageDestroy;

// Function Blindage.BlindageInteract.OnCatchedByBlindage
// 0x0008 (0x0008 - 0x0000)
struct BlindageInteract_OnCatchedByBlindage final
{
public:
	class ABlindage*                              Blindage;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BlindageInteract_OnCatchedByBlindage;

// Function Blindage.BlindageInteract.OnEnterBlindageCollision
// 0x0008 (0x0008 - 0x0000)
struct BlindageInteract_OnEnterBlindageCollision final
{
public:
	class ABlindage*                              Blindage;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BlindageInteract_OnEnterBlindageCollision;

// Function Blindage.BlindageInteract.OnLeaveBlindage
// 0x0008 (0x0008 - 0x0000)
struct BlindageInteract_OnLeaveBlindage final
{
public:
	class ABlindage*                              Blindage;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BlindageInteract_OnLeaveBlindage;

// Function Blindage.BlindageInteract.OnLeaveBlindageCollision
// 0x0008 (0x0008 - 0x0000)
struct BlindageInteract_OnLeaveBlindageCollision final
{
public:
	class ABlindage*                              Blindage;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BlindageInteract_OnLeaveBlindageCollision;

// Function Blindage.BlindageInteract.RightMoveBuffering
// 0x0001 (0x0001 - 0x0000)
struct BlindageInteract_RightMoveBuffering final
{
public:
	bool                                          bValue;                                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BlindageInteract_RightMoveBuffering;

// Function Blindage.BlindageInteract.SetLeftBufferTime
// 0x0004 (0x0004 - 0x0000)
struct BlindageInteract_SetLeftBufferTime final
{
public:
	float                                         FValue;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BlindageInteract_SetLeftBufferTime;

// Function Blindage.BlindageInteract.SetRightBufferTime
// 0x0004 (0x0004 - 0x0000)
struct BlindageInteract_SetRightBufferTime final
{
public:
	float                                         FValue;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BlindageInteract_SetRightBufferTime;

// Function Blindage.BlindageInteract.GetEnterPositionMaxAngle
// 0x0004 (0x0004 - 0x0000)
struct BlindageInteract_GetEnterPositionMaxAngle final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BlindageInteract_GetEnterPositionMaxAngle;

// Function Blindage.Blindage.ShowDebugArea
// 0x0010 (0x0010 - 0x0000)
struct Blindage_ShowDebugArea final
{
public:
	const class UObject*                          WorldContextObject;                                // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShow;                                             // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_Blindage_ShowDebugArea;

// Function Blindage.Blindage.GetBlindageLinks_Left
// 0x0010 (0x0010 - 0x0000)
struct Blindage_GetBlindageLinks_Left final
{
public:
	TArray<struct FBlindageLinkInfo>              ReturnValue;                                       // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Blindage_GetBlindageLinks_Left;

// Function Blindage.Blindage.GetBlindageLinks_Right
// 0x0010 (0x0010 - 0x0000)
struct Blindage_GetBlindageLinks_Right final
{
public:
	TArray<struct FBlindageLinkInfo>              ReturnValue;                                       // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Blindage_GetBlindageLinks_Right;

// Function Blindage.Blindage.GetEnterArea
// 0x0018 (0x0018 - 0x0000)
struct Blindage_GetEnterArea final
{
public:
	class ACharacter*                             GameCharacter;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                ProjectPos;                                        // 0x0008(0x000C)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EBlindageEnterType                            ReturnValue;                                       // 0x0014(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_Blindage_GetEnterArea;

// Function Blindage.Blindage.IsInForbidShootArea
// 0x0010 (0x0010 - 0x0000)
struct Blindage_IsInForbidShootArea final
{
public:
	struct FVector                                Pos;                                               // 0x0000(0x000C)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x000C(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_Blindage_IsInForbidShootArea;

// Function Blindage.Blindage.OnBeginOverLap
// 0x00B0 (0x00B0 - 0x0000)
struct Blindage_OnBeginOverLap final
{
public:
	class UPrimitiveComponent*                    OverlappedComp;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Rei-SdkDumper ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x008C)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	uint8                                         Pad_AC[0x4];                                       // 0x00AC(0x0004)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_Blindage_OnBeginOverLap;

// Function Blindage.Blindage.OnEndOverLap
// 0x0020 (0x0020 - 0x0000)
struct Blindage_OnEndOverLap final
{
public:
	class UPrimitiveComponent*                    OverlappedComp;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_Blindage_OnEndOverLap;

// Function Blindage.Blindage.SetBlindageTickEnable
// 0x0001 (0x0001 - 0x0000)
struct Blindage_SetBlindageTickEnable final
{
public:
	bool                                          bInEnabled;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Blindage_SetBlindageTickEnable;

// Function Blindage.Blindage.SetClimbMeshInfo
// 0x0040 (0x0040 - 0x0000)
struct Blindage_SetClimbMeshInfo final
{
public:
	struct FTransform                             Transform;                                         // 0x0000(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	float                                         Width;                                             // 0x0030(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Length;                                            // 0x0034(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Height;                                            // 0x0038(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_Blindage_SetClimbMeshInfo;

// Function Blindage.Blindage.CheckClimbInfo
// 0x0038 (0x0038 - 0x0000)
struct Blindage_CheckClimbInfo final
{
public:
	class ACharacter*                             Character;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                InClimbDir;                                        // 0x0008(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxCrossDistance;                                  // 0x0014(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ExtraEndOffset;                                    // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FClimbCheckInfo                        ReturnValue;                                       // 0x001C(0x001C)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Blindage_CheckClimbInfo;

// Function Blindage.Blindage.GetBackMoveDistance
// 0x0004 (0x0004 - 0x0000)
struct Blindage_GetBackMoveDistance final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Blindage_GetBackMoveDistance;

// Function Blindage.Blindage.GetBlindageForward
// 0x000C (0x000C - 0x0000)
struct Blindage_GetBlindageForward final
{
public:
	struct FVector                                ReturnValue;                                       // 0x0000(0x000C)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Blindage_GetBlindageForward;

// Function Blindage.Blindage.GetBlindageHorizontalForward
// 0x000C (0x000C - 0x0000)
struct Blindage_GetBlindageHorizontalForward final
{
public:
	struct FVector                                ReturnValue;                                       // 0x0000(0x000C)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Blindage_GetBlindageHorizontalForward;

// Function Blindage.Blindage.GetBlindageHorizontalRight
// 0x000C (0x000C - 0x0000)
struct Blindage_GetBlindageHorizontalRight final
{
public:
	struct FVector                                ReturnValue;                                       // 0x0000(0x000C)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Blindage_GetBlindageHorizontalRight;

// Function Blindage.Blindage.GetBlindageOrientation
// 0x000C (0x000C - 0x0000)
struct Blindage_GetBlindageOrientation final
{
public:
	struct FRotator                               ReturnValue;                                       // 0x0000(0x000C)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Blindage_GetBlindageOrientation;

// Function Blindage.Blindage.GetBlindageRight
// 0x000C (0x000C - 0x0000)
struct Blindage_GetBlindageRight final
{
public:
	struct FVector                                ReturnValue;                                       // 0x0000(0x000C)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Blindage_GetBlindageRight;

// Function Blindage.Blindage.GetBlindageType
// 0x0001 (0x0001 - 0x0000)
struct Blindage_GetBlindageType final
{
public:
	EBlindageType                                 ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Blindage_GetBlindageType;

// Function Blindage.Blindage.GetClimbOffsetEnd
// 0x0004 (0x0004 - 0x0000)
struct Blindage_GetClimbOffsetEnd final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Blindage_GetClimbOffsetEnd;

// Function Blindage.Blindage.GetClimbOffsetStart
// 0x0004 (0x0004 - 0x0000)
struct Blindage_GetClimbOffsetStart final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Blindage_GetClimbOffsetStart;

// Function Blindage.Blindage.GetEnterPosition
// 0x0018 (0x0018 - 0x0000)
struct Blindage_GetEnterPosition final
{
public:
	const class ACharacter*                       GameCharacter;                                     // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                ReturnValue;                                       // 0x0008(0x000C)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_Blindage_GetEnterPosition;

// Function Blindage.Blindage.GetEnterPosition_WithPos
// 0x0020 (0x0020 - 0x0000)
struct Blindage_GetEnterPosition_WithPos final
{
public:
	const class ACharacter*                       GameCharacter;                                     // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                PredictPos;                                        // 0x0008(0x000C)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                ReturnValue;                                       // 0x0014(0x000C)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Blindage_GetEnterPosition_WithPos;

// Function Blindage.Blindage.GetFrontEdge
// 0x000C (0x000C - 0x0000)
struct Blindage_GetFrontEdge final
{
public:
	struct FVector                                ReturnValue;                                       // 0x0000(0x000C)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Blindage_GetFrontEdge;

// Function Blindage.Blindage.GetFullBlindageForbidShootAngle
// 0x0004 (0x0004 - 0x0000)
struct Blindage_GetFullBlindageForbidShootAngle final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Blindage_GetFullBlindageForbidShootAngle;

// Function Blindage.Blindage.GetFullBunkerBackMoveDistance
// 0x0004 (0x0004 - 0x0000)
struct Blindage_GetFullBunkerBackMoveDistance final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Blindage_GetFullBunkerBackMoveDistance;

// Function Blindage.Blindage.GetHalfBunkerBackMoveDistance
// 0x0004 (0x0004 - 0x0000)
struct Blindage_GetHalfBunkerBackMoveDistance final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Blindage_GetHalfBunkerBackMoveDistance;

// Function Blindage.Blindage.GetLeftEdge
// 0x000C (0x000C - 0x0000)
struct Blindage_GetLeftEdge final
{
public:
	struct FVector                                ReturnValue;                                       // 0x0000(0x000C)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Blindage_GetLeftEdge;

// Function Blindage.Blindage.GetLeftEdge_WithOutStandOffset
// 0x000C (0x000C - 0x0000)
struct Blindage_GetLeftEdge_WithOutStandOffset final
{
public:
	struct FVector                                ReturnValue;                                       // 0x0000(0x000C)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Blindage_GetLeftEdge_WithOutStandOffset;

// Function Blindage.Blindage.GetLeftEnterPoint
// 0x000C (0x000C - 0x0000)
struct Blindage_GetLeftEnterPoint final
{
public:
	struct FVector                                ReturnValue;                                       // 0x0000(0x000C)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Blindage_GetLeftEnterPoint;

// Function Blindage.Blindage.GetLeftShootPoint
// 0x000C (0x000C - 0x0000)
struct Blindage_GetLeftShootPoint final
{
public:
	struct FVector                                ReturnValue;                                       // 0x0000(0x000C)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Blindage_GetLeftShootPoint;

// Function Blindage.Blindage.GetMeshClimbActualLength
// 0x0004 (0x0004 - 0x0000)
struct Blindage_GetMeshClimbActualLength final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Blindage_GetMeshClimbActualLength;

// Function Blindage.Blindage.GetMeshClimbHeight
// 0x0004 (0x0004 - 0x0000)
struct Blindage_GetMeshClimbHeight final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Blindage_GetMeshClimbHeight;

// Function Blindage.Blindage.GetMeshClimbLength
// 0x0004 (0x0004 - 0x0000)
struct Blindage_GetMeshClimbLength final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Blindage_GetMeshClimbLength;

// Function Blindage.Blindage.GetMeshClimbWidth
// 0x0004 (0x0004 - 0x0000)
struct Blindage_GetMeshClimbWidth final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Blindage_GetMeshClimbWidth;

// Function Blindage.Blindage.GetMoveQuitLeftPos
// 0x000C (0x000C - 0x0000)
struct Blindage_GetMoveQuitLeftPos final
{
public:
	struct FVector                                ReturnValue;                                       // 0x0000(0x000C)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Blindage_GetMoveQuitLeftPos;

// Function Blindage.Blindage.GetMoveQuitRightPos
// 0x000C (0x000C - 0x0000)
struct Blindage_GetMoveQuitRightPos final
{
public:
	struct FVector                                ReturnValue;                                       // 0x0000(0x000C)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Blindage_GetMoveQuitRightPos;

// Function Blindage.Blindage.GetRightEdge
// 0x000C (0x000C - 0x0000)
struct Blindage_GetRightEdge final
{
public:
	struct FVector                                ReturnValue;                                       // 0x0000(0x000C)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Blindage_GetRightEdge;

// Function Blindage.Blindage.GetRightEdge_WithOutStandOffset
// 0x000C (0x000C - 0x0000)
struct Blindage_GetRightEdge_WithOutStandOffset final
{
public:
	struct FVector                                ReturnValue;                                       // 0x0000(0x000C)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Blindage_GetRightEdge_WithOutStandOffset;

// Function Blindage.Blindage.GetRightEnterPoint
// 0x000C (0x000C - 0x0000)
struct Blindage_GetRightEnterPoint final
{
public:
	struct FVector                                ReturnValue;                                       // 0x0000(0x000C)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Blindage_GetRightEnterPoint;

// Function Blindage.Blindage.GetRightShootPoint
// 0x000C (0x000C - 0x0000)
struct Blindage_GetRightShootPoint final
{
public:
	struct FVector                                ReturnValue;                                       // 0x0000(0x000C)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Blindage_GetRightShootPoint;

// Function Blindage.Blindage.GetSpecificDirTouchPosition
// 0x0018 (0x0018 - 0x0000)
struct Blindage_GetSpecificDirTouchPosition final
{
public:
	const class ACharacter*                       GameCharacter;                                     // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                ReturnValue;                                       // 0x0008(0x000C)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_Blindage_GetSpecificDirTouchPosition;

// Function Blindage.Blindage.GetTouchPosition
// 0x0018 (0x0018 - 0x0000)
struct Blindage_GetTouchPosition final
{
public:
	const class ACharacter*                       GameCharacter;                                     // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                ReturnValue;                                       // 0x0008(0x000C)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_Blindage_GetTouchPosition;

// Function Blindage.Blindage.IsClimbable
// 0x0001 (0x0001 - 0x0000)
struct Blindage_IsClimbable final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Blindage_IsClimbable;

// Function Blindage.Blindage.IsInAutoCatchArea
// 0x0010 (0x0010 - 0x0000)
struct Blindage_IsInAutoCatchArea final
{
public:
	const class ACharacter*                       Actor;                                             // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_Blindage_IsInAutoCatchArea;

// Function Blindage.Blindage.IsInBackEnterArea
// 0x0010 (0x0010 - 0x0000)
struct Blindage_IsInBackEnterArea final
{
public:
	const class ACharacter*                       Actor;                                             // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_Blindage_IsInBackEnterArea;

// Function Blindage.Blindage.IsInClimbArea
// 0x0010 (0x0010 - 0x0000)
struct Blindage_IsInClimbArea final
{
public:
	const class ACharacter*                       Actor;                                             // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_Blindage_IsInClimbArea;

// Function Blindage.Blindage.IsLeftShootable
// 0x0001 (0x0001 - 0x0000)
struct Blindage_IsLeftShootable final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Blindage_IsLeftShootable;

// Function Blindage.Blindage.IsRightShootable
// 0x0001 (0x0001 - 0x0000)
struct Blindage_IsRightShootable final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Blindage_IsRightShootable;

// Function Blindage.BlindageFunctionLibrary.GetBlindageMeshesInRadius
// 0x0028 (0x0028 - 0x0000)
struct BlindageFunctionLibrary_GetBlindageMeshesInRadius final
{
public:
	const class UObject*                          WorldContextObject;                                // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class AActor*>                         OutActors;                                         // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	struct FVector                                Center;                                            // 0x0018(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Radius;                                            // 0x0024(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BlindageFunctionLibrary_GetBlindageMeshesInRadius;

// Function Blindage.BlindageFunctionLibrary.GetLevelTransform
// 0x0040 (0x0040 - 0x0000)
struct BlindageFunctionLibrary_GetLevelTransform final
{
public:
	const class AActor*                           InActor;                                           // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Size After Last Property [ Rei-SdkDumper ])
	struct FTransform                             ReturnValue;                                       // 0x0010(0x0030)(Parm, OutParm, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BlindageFunctionLibrary_GetLevelTransform;

// Function Blindage.BlindageFunctionLibrary.IsBlindageMesh
// 0x0010 (0x0010 - 0x0000)
struct BlindageFunctionLibrary_IsBlindageMesh final
{
public:
	class UStaticMesh*                            Mesh;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_BlindageFunctionLibrary_IsBlindageMesh;

}

