#pragma once

/*
* SDK generated by Rei-SdkDumper
* Based on Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Blindage

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "Blindage_structs.hpp"
#include "DeveloperSettings_classes.hpp"


namespace SDK
{

// Class Blindage.BlindageAssetUserData
// 0x0000 (0x0028 - 0x0028)
class UBlindageAssetUserData final : public UAssetUserData
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BlindageAssetUserData")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BlindageAssetUserData")
	}
	static class UBlindageAssetUserData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBlindageAssetUserData>();
	}
};
DUMPER7_ASSERTS_UBlindageAssetUserData;

// Class Blindage.BlindageGenerateInterface
// 0x0000 (0x0000 - 0x0000)
class IBlindageGenerateInterface final
{
public:
	void BeforeBlindageGenerated();
	void OnBlindageGenerated(class ABlindage* Blindage);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BlindageGenerateInterface")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BlindageGenerateInterface")
	}
	static class IBlindageGenerateInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IBlindageGenerateInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IBlindageGenerateInterface;

// Class Blindage.BlindageInteract
// 0x0000 (0x0000 - 0x0000)
class IBlindageInteract final
{
public:
	float GetLeftBufferTime();
	struct FVector GetPlayerLocationInBlindage(class ABlindage* Blindage);
	float GetRightBufferTime();
	bool IsLeftMoveBuffering();
	bool IsPlayerBlindageEdgeMove(class ABlindage* Blindage);
	bool IsPlayerInBlindageState();
	bool IsRightMoveBuffering();
	void LeftMoveBuffering(bool bValue);
	void OnBlindageDestroy(class ABlindage* Blindage);
	void OnCatchedByBlindage(class ABlindage* Blindage);
	void OnEnterBlindageCollision(class ABlindage* Blindage);
	void OnLeaveBlindage(class ABlindage* Blindage);
	void OnLeaveBlindageCollision(class ABlindage* Blindage);
	void ResetBlindageData();
	void RightMoveBuffering(bool bValue);
	void SetLeftBufferTime(float FValue);
	void SetRightBufferTime(float FValue);

	float GetEnterPositionMaxAngle() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BlindageInteract")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BlindageInteract")
	}
	static class IBlindageInteract* GetDefaultObj()
	{
		return GetDefaultObjImpl<IBlindageInteract>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IBlindageInteract;

// Class Blindage.Blindage
// 0x01B8 (0x03E0 - 0x0228)
class ABlindage final : public AActor
{
public:
	uint8                                         Pad_228[0xA8];                                     // 0x0228(0x00A8)(Fixing Size After Last Property [ Rei-SdkDumper ])
	struct FTransform                             MeshTransform;                                     // 0x02D0(0x0030)(IsPlainOldData, NoDestructor, NativeAccessSpecifierPrivate)
	class FString                                 DebugName;                                         // 0x0300(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	EBlindageType                                 Type;                                              // 0x0310(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_311[0x3];                                      // 0x0311(0x0003)(Fixing Size After Last Property [ Rei-SdkDumper ])
	float                                         TouchableAngle;                                    // 0x0314(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         UIOffset;                                          // 0x0318(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         BlindageLength;                                    // 0x031C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         BlindageWidth;                                     // 0x0320(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         BlindageHeight;                                    // 0x0324(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         CharacterStandOffset;                              // 0x0328(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bIsLeftShootable;                                  // 0x032C(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bIsRightShootable;                                 // 0x032D(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_32E[0x2];                                      // 0x032E(0x0002)(Fixing Size After Last Property [ Rei-SdkDumper ])
	float                                         EdgeEnterSnapRange;                                // 0x0330(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         FullBlindageForbidShootAngle;                      // 0x0334(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<struct FBlindageForbidShootArea>       ForbidShootAreas;                                  // 0x0338(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPrivate)
	float                                         LeftEnterRange;                                    // 0x0348(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         RightEnterRange;                                   // 0x034C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         BackEnterPercentage;                               // 0x0350(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         AutoCatchLengthPercentage;                         // 0x0354(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         AutoCatchAngle;                                    // 0x0358(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         LeftQuitLimitLength;                               // 0x035C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         RightQuitLimitLength;                              // 0x0360(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         ForceMovementQuitLimitLength;                      // 0x0364(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         HalfBunkerBackMoveDistance;                        // 0x0368(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         FullBunkerBackMoveDistance;                        // 0x036C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_370[0x4];                                      // 0x0370(0x0004)(Fixing Size After Last Property [ Rei-SdkDumper ])
	bool                                          bClimbable;                                        // 0x0374(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_375[0x3];                                      // 0x0375(0x0003)(Fixing Size After Last Property [ Rei-SdkDumper ])
	float                                         ClimbMaxDistance;                                  // 0x0378(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         ClimbOffsetStart;                                  // 0x037C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         ClimbOffsetEnd;                                    // 0x0380(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         ClimbCheckPercentagy;                              // 0x0384(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         MeshClimbWidth;                                    // 0x0388(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         MeshClimbLength;                                   // 0x038C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         MeshClimbHeight;                                   // 0x0390(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bUseMannulClimbParameters;                         // 0x0394(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_395[0x3];                                      // 0x0395(0x0003)(Fixing Size After Last Property [ Rei-SdkDumper ])
	TArray<struct FBlindageLinkInfo>              BlindageLinks_Left;                                // 0x0398(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPrivate)
	TArray<struct FBlindageLinkInfo>              BlindageLinks_Right;                               // 0x03A8(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPrivate)
	class UProceduralMeshComponent*               CubeMesh;                                          // 0x03B8(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class USplineComponent*                       SplineComponent;                                   // 0x03C0(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<class USplineMeshComponent*>           SplineMesh;                                        // 0x03C8(0x0010)(ExportObject, ZeroConstructor, Transient, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	bool                                          bDrawBlindageLinkDebugInfo;                        // 0x03D8(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_3D9[0x7];                                      // 0x03D9(0x0007)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])

public:
	static void ShowDebugArea(const class UObject* WorldContextObject, bool bShow);

	const TArray<struct FBlindageLinkInfo> GetBlindageLinks_Left();
	const TArray<struct FBlindageLinkInfo> GetBlindageLinks_Right();
	EBlindageEnterType GetEnterArea(class ACharacter* GameCharacter, const struct FVector& ProjectPos);
	bool IsInForbidShootArea(const struct FVector& Pos);
	void K2_DisableBlindage();
	void K2_EnableBlindage();
	void OnBeginOverLap(class UPrimitiveComponent* OverlappedComp, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void OnEndOverLap(class UPrimitiveComponent* OverlappedComp, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex);
	void SetBlindageTickEnable(bool bInEnabled);
	void SetClimbMeshInfo(const struct FTransform& Transform, float Width, float Length, float Height);

	struct FClimbCheckInfo CheckClimbInfo(class ACharacter* Character, const struct FVector& InClimbDir, float MaxCrossDistance, float ExtraEndOffset) const;
	float GetBackMoveDistance() const;
	struct FVector GetBlindageForward() const;
	struct FVector GetBlindageHorizontalForward() const;
	struct FVector GetBlindageHorizontalRight() const;
	struct FRotator GetBlindageOrientation() const;
	struct FVector GetBlindageRight() const;
	EBlindageType GetBlindageType() const;
	float GetClimbOffsetEnd() const;
	float GetClimbOffsetStart() const;
	struct FVector GetEnterPosition(const class ACharacter* GameCharacter) const;
	struct FVector GetEnterPosition_WithPos(const class ACharacter* GameCharacter, const struct FVector& PredictPos) const;
	struct FVector GetFrontEdge() const;
	float GetFullBlindageForbidShootAngle() const;
	float GetFullBunkerBackMoveDistance() const;
	float GetHalfBunkerBackMoveDistance() const;
	struct FVector GetLeftEdge() const;
	struct FVector GetLeftEdge_WithOutStandOffset() const;
	struct FVector GetLeftEnterPoint() const;
	struct FVector GetLeftShootPoint() const;
	float GetMeshClimbActualLength() const;
	float GetMeshClimbHeight() const;
	float GetMeshClimbLength() const;
	float GetMeshClimbWidth() const;
	struct FVector GetMoveQuitLeftPos() const;
	struct FVector GetMoveQuitRightPos() const;
	struct FVector GetRightEdge() const;
	struct FVector GetRightEdge_WithOutStandOffset() const;
	struct FVector GetRightEnterPoint() const;
	struct FVector GetRightShootPoint() const;
	struct FVector GetSpecificDirTouchPosition(const class ACharacter* GameCharacter) const;
	struct FVector GetTouchPosition(const class ACharacter* GameCharacter) const;
	bool IsClimbable() const;
	bool IsInAutoCatchArea(const class ACharacter* Actor) const;
	bool IsInBackEnterArea(const class ACharacter* Actor) const;
	bool IsInClimbArea(const class ACharacter* Actor) const;
	bool IsLeftShootable() const;
	bool IsRightShootable() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("Blindage")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"Blindage")
	}
	static class ABlindage* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABlindage>();
	}
};
DUMPER7_ASSERTS_ABlindage;

// Class Blindage.BlindageFunctionLibrary
// 0x0000 (0x0028 - 0x0028)
class UBlindageFunctionLibrary final : public UBlueprintFunctionLibrary
{
public:
	static void GetBlindageMeshesInRadius(const class UObject* WorldContextObject, TArray<class AActor*>* OutActors, const struct FVector& Center, float Radius);
	static struct FTransform GetLevelTransform(const class AActor* InActor);
	static bool IsBlindageMesh(class UStaticMesh* Mesh);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BlindageFunctionLibrary")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BlindageFunctionLibrary")
	}
	static class UBlindageFunctionLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBlindageFunctionLibrary>();
	}
};
DUMPER7_ASSERTS_UBlindageFunctionLibrary;

// Class Blindage.BlindageSettings
// 0x0068 (0x00A0 - 0x0038)
class UBlindageSettings final : public UDeveloperSettings
{
public:
	bool                                          bShowArea;                                         // 0x0038(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShowDebugInfo;                                    // 0x0039(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3A[0x6];                                       // 0x003A(0x0006)(Fixing Size After Last Property [ Rei-SdkDumper ])
	TArray<EObjectTypeQuery>                      BlindageMeshObjectTypes;                           // 0x0040(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, NativeAccessSpecifierPublic)
	TSet<struct FSoftObjectPath>                  BlindageMeshes;                                    // 0x0050(0x0050)(Edit, BlueprintVisible, BlueprintReadOnly, Config, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BlindageSettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BlindageSettings")
	}
	static class UBlindageSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBlindageSettings>();
	}
};
DUMPER7_ASSERTS_UBlindageSettings;

}

