#pragma once

/*
* SDK generated by Rei-SdkDumper
* Based on Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BlueprintFileUtils

#include "Basic.hpp"


namespace SDK::Params
{

// Function BlueprintFileUtils.BlueprintFileUtilsBPLibrary.CopyFile
// 0x0028 (0x0028 - 0x0000)
struct BlueprintFileUtilsBPLibrary_CopyFile final
{
public:
	class FString                                 DestFilename;                                      // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 SrcFilename;                                       // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bReplace;                                          // 0x0020(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEvenIfReadOnly;                                   // 0x0021(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0022(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_23[0x5];                                       // 0x0023(0x0005)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_BlueprintFileUtilsBPLibrary_CopyFile;

// Function BlueprintFileUtils.BlueprintFileUtilsBPLibrary.DeleteDirectory
// 0x0018 (0x0018 - 0x0000)
struct BlueprintFileUtilsBPLibrary_DeleteDirectory final
{
public:
	class FString                                 Directory;                                         // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bMustExist;                                        // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDeleteRecursively;                                // 0x0011(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0012(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_13[0x5];                                       // 0x0013(0x0005)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_BlueprintFileUtilsBPLibrary_DeleteDirectory;

// Function BlueprintFileUtils.BlueprintFileUtilsBPLibrary.DeleteFile
// 0x0018 (0x0018 - 0x0000)
struct BlueprintFileUtilsBPLibrary_DeleteFile final
{
public:
	class FString                                 Filename;                                          // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bMustExist;                                        // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEvenIfReadOnly;                                   // 0x0011(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0012(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_13[0x5];                                       // 0x0013(0x0005)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_BlueprintFileUtilsBPLibrary_DeleteFile;

// Function BlueprintFileUtils.BlueprintFileUtilsBPLibrary.DirectoryExists
// 0x0018 (0x0018 - 0x0000)
struct BlueprintFileUtilsBPLibrary_DirectoryExists final
{
public:
	class FString                                 Directory;                                         // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_BlueprintFileUtilsBPLibrary_DirectoryExists;

// Function BlueprintFileUtils.BlueprintFileUtilsBPLibrary.FileExists
// 0x0018 (0x0018 - 0x0000)
struct BlueprintFileUtilsBPLibrary_FileExists final
{
public:
	class FString                                 Filename;                                          // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_BlueprintFileUtilsBPLibrary_FileExists;

// Function BlueprintFileUtils.BlueprintFileUtilsBPLibrary.FindFiles
// 0x0038 (0x0038 - 0x0000)
struct BlueprintFileUtilsBPLibrary_FindFiles final
{
public:
	class FString                                 Directory;                                         // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FString>                         FoundFiles;                                        // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	class FString                                 FileExtension;                                     // 0x0020(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0030(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_BlueprintFileUtilsBPLibrary_FindFiles;

// Function BlueprintFileUtils.BlueprintFileUtilsBPLibrary.FindRecursive
// 0x0038 (0x0038 - 0x0000)
struct BlueprintFileUtilsBPLibrary_FindRecursive final
{
public:
	class FString                                 StartDirectory;                                    // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FString>                         FoundPaths;                                        // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	class FString                                 Wildcard;                                          // 0x0020(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bFindFiles;                                        // 0x0030(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bFindDirectories;                                  // 0x0031(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0032(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_33[0x5];                                       // 0x0033(0x0005)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_BlueprintFileUtilsBPLibrary_FindRecursive;

// Function BlueprintFileUtils.BlueprintFileUtilsBPLibrary.GetUserDirectory
// 0x0010 (0x0010 - 0x0000)
struct BlueprintFileUtilsBPLibrary_GetUserDirectory final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BlueprintFileUtilsBPLibrary_GetUserDirectory;

// Function BlueprintFileUtils.BlueprintFileUtilsBPLibrary.MakeDirectory
// 0x0018 (0x0018 - 0x0000)
struct BlueprintFileUtilsBPLibrary_MakeDirectory final
{
public:
	class FString                                 Path;                                              // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCreateTree;                                       // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0011(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_BlueprintFileUtilsBPLibrary_MakeDirectory;

// Function BlueprintFileUtils.BlueprintFileUtilsBPLibrary.MoveFile
// 0x0028 (0x0028 - 0x0000)
struct BlueprintFileUtilsBPLibrary_MoveFile final
{
public:
	class FString                                 DestFilename;                                      // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 SrcFilename;                                       // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bReplace;                                          // 0x0020(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEvenIfReadOnly;                                   // 0x0021(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0022(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_23[0x5];                                       // 0x0023(0x0005)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_BlueprintFileUtilsBPLibrary_MoveFile;

}

