#pragma once

/*
* SDK generated by Rei-SdkDumper
* Based on Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BeachGameHouseAIChar

#include "Basic.hpp"

#include "NamesToCoatParts_structs.hpp"
#include "Engine_structs.hpp"
#include "BallResults_structs.hpp"
#include "BP_HouseAICharacter_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_BeachGameHouseAIChar.BP_BeachGameHouseAIChar_C
// 0x0130 (0x0800 - 0x06D0)
class ABP_BeachGameHouseAIChar_C final : public ABP_HouseAICharacter_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_BeachGameHouseAIChar_C;          // 0x06C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USkeletalMeshComponent*                 SkeletalMeshSlot;                                  // 0x06D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 Part06;                                            // 0x06D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 Part05;                                            // 0x06E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 Part04;                                            // 0x06E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 Part03;                                            // 0x06F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 Part02;                                            // 0x06F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 Part01;                                            // 0x0700(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NiagaraSlot;                                       // 0x0708(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAC_IceAttach_C*                        AC_IceAttach;                                      // 0x0710(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 EffectTargetMesh;                                  // 0x0718(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FBallResults                           TempBallResultsConfig;                             // 0x0720(0x0030)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FNamesToCoatParts                      NamesToCoatParts;                                  // 0x0750(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 FaceMesh;                                          // 0x07A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AIceCreamGameMgr_C*                     IceMgr;                                            // 0x07A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMesh*                          P1Mesh;                                            // 0x07B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMesh*                          P2Mesh;                                            // 0x07B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMesh*                          P3Mesh;                                            // 0x07C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMesh*                          P4Mesh;                                            // 0x07C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMesh*                          P5Mesh;                                            // 0x07D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMesh*                          P6Mesh;                                            // 0x07D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         AppliedCount;                                      // 0x07E0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7E4[0x4];                                      // 0x07E4(0x0004)(Fixing Size After Last Property [ Rei-SdkDumper ])
	TArray<class UActorComponent*>                NiagaraComps;                                      // 0x07E8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	bool                                          IsSecondIceBall;                                   // 0x07F8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void Set_Other_Mesh_Param(const class FString& GlobalName);
	void Set_Face_Param(bool SkinPartModifyAllAges, const struct FViewGirlMain& FaceStruct, const struct FViewGirlMain& FaceStructAllAges, const class FString& GlobalName);
	void Set_Body_Param(bool SkinPartModifyAllAges, const struct FViewGirlMain& BodyStruct, const struct FViewGirlMain& BodyStructAllAges, const class FString& GlobalName);
	void EndRenderStat(const class FString& GlobalName);
	void InitGame();
	void GetCorrespondingMesh(class FName PosName, class USkeletalMeshComponent** NewParam);
	void ReceiveBeginPlay();
	void ExecuteUbergraph_BP_BeachGameHouseAIChar(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_BeachGameHouseAIChar_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_BeachGameHouseAIChar_C")
	}
	static class ABP_BeachGameHouseAIChar_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_BeachGameHouseAIChar_C>();
	}
};
DUMPER7_ASSERTS_ABP_BeachGameHouseAIChar_C;

}

