#pragma once

/*
* SDK generated by Rei-SdkDumper
* Based on Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BeachGameHouseAIChar

#include "Basic.hpp"

#include "Game_structs.hpp"
#include "BallResults_structs.hpp"


namespace SDK::Params
{

// Function BP_BeachGameHouseAIChar.BP_BeachGameHouseAIChar_C.Set Other Mesh Param
// 0x0020 (0x0020 - 0x0000)
struct BP_BeachGameHouseAIChar_C_Set_Other_Mesh_Param final
{
public:
	class FString                                 GlobalName;                                        // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_BeachGameHouseAIChar_C_Set_Other_Mesh_Param;

// Function BP_BeachGameHouseAIChar.BP_BeachGameHouseAIChar_C.Set Face Param
// 0x0170 (0x0170 - 0x0000)
struct BP_BeachGameHouseAIChar_C_Set_Face_Param final
{
public:
	bool                                          SkinPartModifyAllAges;                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Rei-SdkDumper ])
	struct FViewGirlMain                          FaceStruct;                                        // 0x0008(0x00A8)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FViewGirlMain                          FaceStructAllAges;                                 // 0x00B0(0x00A8)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FString                                 GlobalName;                                        // 0x0158(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 CallFunc_GetFaceMeshComponent_ReturnValue;         // 0x0168(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_BeachGameHouseAIChar_C_Set_Face_Param;

// Function BP_BeachGameHouseAIChar.BP_BeachGameHouseAIChar_C.Set Body Param
// 0x0168 (0x0168 - 0x0000)
struct BP_BeachGameHouseAIChar_C_Set_Body_Param final
{
public:
	bool                                          SkinPartModifyAllAges;                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Rei-SdkDumper ])
	struct FViewGirlMain                          BodyStruct;                                        // 0x0008(0x00A8)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FViewGirlMain                          BodyStructAllAges;                                 // 0x00B0(0x00A8)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FString                                 GlobalName;                                        // 0x0158(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_BeachGameHouseAIChar_C_Set_Body_Param;

// Function BP_BeachGameHouseAIChar.BP_BeachGameHouseAIChar_C.EndRenderStat
// 0x0010 (0x0010 - 0x0000)
struct BP_BeachGameHouseAIChar_C_EndRenderStat final
{
public:
	class FString                                 GlobalName;                                        // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_BeachGameHouseAIChar_C_EndRenderStat;

// Function BP_BeachGameHouseAIChar.BP_BeachGameHouseAIChar_C.InitGame
// 0x0070 (0x0070 - 0x0000)
struct BP_BeachGameHouseAIChar_C_InitGame final
{
public:
	int32                                         ___int_Array_Index_Variable;                       // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Loop_Counter_Variable;                      // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Rei-SdkDumper ])
	class UActorComponent*                        CallFunc_Array_Get_Item;                           // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Rei-SdkDumper ])
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FBallResults                           CallFunc_GetDataTableRowFromName_OutRow;           // 0x0038(0x0030)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_BP_BeachGameHouseAIChar_C_InitGame;

// Function BP_BeachGameHouseAIChar.BP_BeachGameHouseAIChar_C.GetCorrespondingMesh
// 0x0018 (0x0018 - 0x0000)
struct BP_BeachGameHouseAIChar_C_GetCorrespondingMesh final
{
public:
	class FName                                   PosName;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 NewParam;                                          // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_BP_BeachGameHouseAIChar_C_GetCorrespondingMesh;

// Function BP_BeachGameHouseAIChar.BP_BeachGameHouseAIChar_C.ExecuteUbergraph_BP_BeachGameHouseAIChar
// 0x0028 (0x0028 - 0x0000)
struct BP_BeachGameHouseAIChar_C_ExecuteUbergraph_BP_BeachGameHouseAIChar final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Rei-SdkDumper ])
	class USkeletalMeshComponent*                 CallFunc_GetFaceMeshComponent_ReturnValue;         // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UABP_GirlBase_PreviewHeadBase_C*        K2Node_DynamicCast_AsABP_Girl_Base_Preview_Head_Base; // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_BP_BeachGameHouseAIChar_C_ExecuteUbergraph_BP_BeachGameHouseAIChar;

}

