#pragma once

/*
* SDK generated by Rei-SdkDumper
* Based on Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CupIceCream

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_HouseThrowCupBase_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_CupIceCream.BP_CupIceCream_C
// 0x0058 (0x02F0 - 0x0298)
class ABP_CupIceCream_C final : public ABP_HouseThrowCupBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_CupIceCream_C;                   // 0x0298(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UGameNiagaraComponent*                  suixie_chocolate;                                  // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   house_throw_ice;                                   // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      Middle;                                            // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      Top;                                               // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UGameNiagaraComponent*                  suixie_debris;                                     // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Pos;                                               // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      Bottom;                                            // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         NiagaraOffset;                                     // 0x02D8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Radius;                                            // 0x02DC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         BtmRadius;                                         // 0x02E0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E4[0x4];                                      // 0x02E4(0x0004)(Fixing Size After Last Property [ Rei-SdkDumper ])
	class UMaterialInstanceDynamic*               MI_Liquid;                                         // 0x02E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ReceiveBeginPlay();
	void ReceiveTick(float DeltaSeconds);
	void ExecuteUbergraph_BP_CupIceCream(int32 EntryPoint);
	void SetStrawberryLiquid();
	void SetDebrisOnIceBall();
	void SetChocolateOnIceBall();
	void SetCupBtmChocolate();
	void SetCupBtmDebris();
	void SetCupTopChocolate();
	void SetCupTopDebris();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_CupIceCream_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_CupIceCream_C")
	}
	static class ABP_CupIceCream_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_CupIceCream_C>();
	}
};
DUMPER7_ASSERTS_ABP_CupIceCream_C;

}

