#pragma once

/*
* SDK generated by Rei-SdkDumper
* Based on Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: bp_e_common_ground

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function bp_e_common_ground.bp_e_common_ground_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct bp_e_common_ground_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_bp_e_common_ground_C_ReceiveEndPlay;

// Function bp_e_common_ground.bp_e_common_ground_C.ExecuteUbergraph_bp_e_common_ground
// 0x0014 (0x0014 - 0x0000)
struct bp_e_common_ground_C_ExecuteUbergraph_bp_e_common_ground final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_CallLuaFunction_Int_RetValue;             // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Rei-SdkDumper ])
	int32                                         CallFunc_GetDeviceProfileLevel_ReturnValue;        // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_bp_e_common_ground_C_ExecuteUbergraph_bp_e_common_ground;

}

