#pragma once

/*
* SDK generated by Rei-SdkDumper
* Based on Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_HouseFurnitureBase

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_HouseFurnitureBase.BP_HouseFurnitureBase_C
// 0x0038 (0x0968 - 0x0930)
class ABP_HouseFurnitureBase_C : public AHouseFurnitureBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0930(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UHouseShadowMapMask*                    HouseShadowMapMask;                                // 0x0938(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_0_NewTrack_0_633092DD4558D1B01036F3B55B49D8EA; // 0x0940(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_0__Direction_633092DD4558D1B01036F3B55B49D8EA; // 0x0944(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_945[0x3];                                      // 0x0945(0x0003)(Fixing Size After Last Property [ Rei-SdkDumper ])
	class UTimelineComponent*                     Timeline_0;                                        // 0x0948(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 InteractWidgetClass;                               // 0x0950(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         反射渲染精度;                                // 0x0958(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          关闭动态阴影反射; // 0x095C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_95D[0x3];                                      // 0x095D(0x0003)(Fixing Size After Last Property [ Rei-SdkDumper ])
	float                                         FurMeshCullDistance;                               // 0x0960(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ShowOrHideTagMesh(class FName InTag, bool Hide);
	void SubSkmStopMontageAndHide(class USkeletalMeshComponent* TargetSkm);
	void SubSkmPlayMontage(class USkeletalMeshComponent* TargetSkm, class UAnimMontage* TargetMontage);
	void OnGraphicsQualityChanged(class UPlanarReflectionComponent* PlanarReflection);
	void OptimizePlanarReflection(class UPlanarReflectionComponent* PlanarReflection);
	void ShowCG__Overridden(const class FString& Path, const class FString& BGMStateGroup);
	class UFXSystemComponent* SpawnEffectAutoDestroyed(class UNiagaraSystem* InEffect);
	class UFXSystemComponent* SpawnEffect(class UNiagaraSystem* InEffect);
	void UserConstructionScript();
	void Timeline_0__FinishedFunc();
	void Timeline_0__UpdateFunc();
	void ReceiveActorBeginOverlap(class AActor* OtherActor);
	void SetEffectParamInTimeLine(class UFXSystemComponent* InEffect, float Speed, bool IsReverse, class FName ValueName);
	void OnQualityChanged_Event_0();
	void ReceiveBeginPlay();
	void ExecuteUbergraph_BP_HouseFurnitureBase(int32 EntryPoint);
	void ShowCG(const class FString& Path, const class FString& BGMStateGroup);

	class FString GetModuleName() const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_HouseFurnitureBase_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_HouseFurnitureBase_C")
	}
	static class ABP_HouseFurnitureBase_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_HouseFurnitureBase_C>();
	}
};
DUMPER7_ASSERTS_ABP_HouseFurnitureBase_C;

}

