#pragma once

/*
* SDK generated by Rei-SdkDumper
* Based on Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_HouseAICharacter

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_HouseAICharacter.BP_HouseAICharacter_C
// 0x0040 (0x06D0 - 0x0690)
#pragma pack(push, 0x1)
class alignas(0x10) ABP_HouseAICharacter_C : public AHouseBaseCharacter
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0690(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USkeletalMeshComponent*                 Ring;                                              // 0x0698(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      e_house_bubble01_p;                                // 0x06A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 Shoes;                                             // 0x06A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          Box;                                               // 0x06B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<class UMaterialInterface*>             Secondary_Materials;                               // 0x06B8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void DealShoesAnim();
	void ReceiveBeginPlay();
	void ShowOrHideShoes(bool InShow);
	void ShowOrHideRing(bool InShow);
	void ExecuteUbergraph_BP_HouseAICharacter(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_HouseAICharacter_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_HouseAICharacter_C")
	}
	static class ABP_HouseAICharacter_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_HouseAICharacter_C>();
	}
};
#pragma pack(pop)
DUMPER7_ASSERTS_ABP_HouseAICharacter_C;

}

