#pragma once

/*
* SDK generated by Rei-SdkDumper
* Based on Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_InteractionActorBase

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_InteractionActorBase.BP_InteractionActorBase_C
// 0x00D0 (0x03B8 - 0x02E8)
class ABP_InteractionActorBase_C final : public AGameInteractionCharacter
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAC_InteractionPhys_C*                  AC_InteractionPhys;                                // 0x02F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         BlushStop_Blush_0072070D4A25BD7775DF42B2A529ACE6;  // 0x02F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            BlushStop__Direction_0072070D4A25BD7775DF42B2A529ACE6; // 0x02FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2FD[0x3];                                      // 0x02FD(0x0003)(Fixing Size After Last Property [ Rei-SdkDumper ])
	class UTimelineComponent*                     BlushStop;                                         // 0x0300(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         BlushStart_Blush_68D71FE4447287164165AD80E2660631; // 0x0308(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            BlushStart__Direction_68D71FE4447287164165AD80E2660631; // 0x030C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_30D[0x3];                                      // 0x030D(0x0003)(Fixing Size After Last Property [ Rei-SdkDumper ])
	class UTimelineComponent*                     BlushStart;                                        // 0x0310(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_0_NewTrack_0_CB2AFE1C40E8B8236080958E53A02323; // 0x0318(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_0__Direction_CB2AFE1C40E8B8236080958E53A02323; // 0x031C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31D[0x3];                                      // 0x031D(0x0003)(Fixing Size After Last Property [ Rei-SdkDumper ])
	class UTimelineComponent*                     Timeline_0;                                        // 0x0320(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFaceChanging;                                     // 0x0328(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_329[0x7];                                      // 0x0329(0x0007)(Fixing Size After Last Property [ Rei-SdkDumper ])
	class UMaterialInstanceDynamic*               MIDFaceChanging;                                   // 0x0330(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     MeshOriginMat;                                     // 0x0338(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture*                               NTexture;                                          // 0x0340(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture*                               ChangeTexture;                                     // 0x0348(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMesh*                          MeshReplacement;                                   // 0x0350(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsNewBlush;                                       // 0x0358(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_359[0x3];                                      // 0x0359(0x0003)(Fixing Size After Last Property [ Rei-SdkDumper ])
	int32                                         MaterialSlot;                                      // 0x035C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         BlushID;                                           // 0x0360(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_364[0x4];                                      // 0x0364(0x0004)(Fixing Size After Last Property [ Rei-SdkDumper ])
	TMap<int32, int32>                            MatStateID;                                        // 0x0368(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void HideMat(bool Hide, int32 MatSlot);
	void End_Render_Stat(const class FString& GlobalName);
	void Set_Other_Mesh_Param(const class FString& GlobalName);
	void Set_Head_Param(bool SkinPartModifyAllAges, const struct FViewGirlMain& HeadStruct, const struct FViewGirlMain& HeadStructAllAges, const class FString& GlobalName);
	void Set_Body_Param(bool SkinPartModifyAllAges, const struct FViewGirlMain& BodyStruct, const struct FViewGirlMain& BodyStructAllAges, const class FString& GlobalName);
	void UserConstructionScript();
	void Timeline_0__FinishedFunc();
	void Timeline_0__UpdateFunc();
	void BlushStart__FinishedFunc();
	void BlushStart__UpdateFunc();
	void BlushStop__FinishedFunc();
	void BlushStop__UpdateFunc();
	void ReceiveBeginPlay();
	void StartBlush();
	void StopBlush();
	void InteractionStartBlush();
	void InteractionStopBlush();
	void OnEnterScene(int32 SceneType);
	void PhysicsBlendBegin();
	void PhysicsBlendEnd();
	void PlayMontageStartPhysicsState();
	void NewStartBlush();
	void NewStopBlush();
	void ExecuteUbergraph_BP_InteractionActorBase(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_InteractionActorBase_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_InteractionActorBase_C")
	}
	static class ABP_InteractionActorBase_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_InteractionActorBase_C>();
	}
};
DUMPER7_ASSERTS_ABP_InteractionActorBase_C;

}

