#pragma once

/*
* SDK generated by Rei-SdkDumper
* Based on Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PreviewModel

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "st_previewLgiht_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_PreviewModel.BP_PreviewModel_C
// 0x0058 (0x0778 - 0x0720)
class ABP_PreviewModel_C : public APreviewModel
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0720(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0728(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FVector>                        LightPos;                                          // 0x0730(0x0010)(Edit, BlueprintVisible)
	TArray<struct Fst_previewLgiht>               LightData;                                         // 0x0740(0x0010)(Edit, BlueprintVisible)
	TArray<struct FVector>                        CatchLights;                                       // 0x0750(0x0010)(Edit, BlueprintVisible)
	TArray<class UMaterialInstanceDynamic*>       mat;                                               // 0x0760(0x0010)(Edit, BlueprintVisible)
	bool                                          Editor;                                            // 0x0770(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void UpdateVectorParameter(const struct FMaterialParameterInfo& Info, const struct FLinearColor& Value);
	void Update_Rendering_depth();
	void CreateDynamicMat();
	void BuildLight();
	void UserConstructionScript();
	void OnPreviewModelMeshChange();
	void ReceiveBeginPlay();
	void ExecuteUbergraph_BP_PreviewModel(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_PreviewModel_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_PreviewModel_C")
	}
	static class ABP_PreviewModel_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_PreviewModel_C>();
	}
};
DUMPER7_ASSERTS_ABP_PreviewModel_C;

}

