#pragma once

/*
* SDK generated by Rei-SdkDumper
* Based on Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PreloadMaterials

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_PreloadMaterials.BP_PreloadMaterials_C
// 0x00E0 (0x0108 - 0x0028)
class UBP_PreloadMaterials_C final : public UObject
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0028(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	TArray<class UMaterialInterface*>             SceneMats;                                         // 0x0030(0x0010)(Edit, BlueprintVisible)
	TArray<class UMaterialInstance*>              character_emoji_mat;                               // 0x0040(0x0010)(Edit, BlueprintVisible)
	TArray<class UMaterialInstance*>              character_girl002b_mat;                            // 0x0050(0x0010)(Edit, BlueprintVisible)
	TArray<class UMaterialInstance*>              Character_hair_mat;                                // 0x0060(0x0010)(Edit, BlueprintVisible)
	TArray<class UMaterialInstance*>              character_main_girl004b_mat;                       // 0x0070(0x0010)(Edit, BlueprintVisible)
	TArray<class UMaterialInstance*>              character_main_mat;                                // 0x0080(0x0010)(Edit, BlueprintVisible)
	TArray<class UMaterialInstance*>              character_main_waterStains_mat;                    // 0x0090(0x0010)(Edit, BlueprintVisible)
	TArray<class UMaterialInstance*>              character_skin_mat;                                // 0x00A0(0x0010)(Edit, BlueprintVisible)
	TArray<class UMaterialInstance*>              character_skin_waterStains_mat;                    // 0x00B0(0x0010)(Edit, BlueprintVisible)
	TArray<class UMaterialInstance*>              character_weapon_effect_mat;                       // 0x00C0(0x0010)(Edit, BlueprintVisible)
	TArray<class UMaterialInstance*>              character_weapon_liquid_mat;                       // 0x00D0(0x0010)(Edit, BlueprintVisible)
	TArray<class UMaterialInstance*>              character_weapon_mat;                              // 0x00E0(0x0010)(Edit, BlueprintVisible)
	struct FSoftObjectPath                        MaterialTemplates;                                 // 0x00F0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_PreloadMaterials(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_PreloadMaterials_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_PreloadMaterials_C")
	}
	static class UBP_PreloadMaterials_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_PreloadMaterials_C>();
	}
};
DUMPER7_ASSERTS_UBP_PreloadMaterials_C;

}

