#pragma once

/*
* SDK generated by Rei-SdkDumper
* Based on Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PSCharacterBase

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_PSCharacterBase.BP_PSCharacterBase_C
// 0x0030 (0x0308 - 0x02D8)
class ABP_PSCharacterBase_C final : public APSCharacter
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02D8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USkeletalMeshComponent*                 Ring;                                              // 0x02E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 MeshShoes;                                         // 0x02E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCapsuleComponent*                      Capsule;                                           // 0x02F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCharacterRenderComponent*              CharacterRender;                                   // 0x02F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 FaceMesh;                                          // 0x0300(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ReceiveBeginPlay();
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void UserConstructionScript();
	void UpdateRenderingdepth();
	void Set_Other_Mesh_Param(const class FString& GlobalName);
	void Set_Face_Param(bool SkinPartModifyAllAges, const struct FViewGirlMain& FaceStruct, const struct FViewGirlMain& FaceStructAllAges, const class FString& GlobalName);
	void Set_Body_Param(bool SkinPartModifyAllAges, const struct FViewGirlMain& BodyStruct, const struct FViewGirlMain& BodyStructAllAges, const class FString& GlobalName);
	void EndRenderStat(const class FString& GlobalName);
	void ReceiveBeginPlay__Overridden();
	void ExecuteUbergraph_BP_PSCharacterBase(int32 EntryPoint);

	class FString GetModuleName() const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_PSCharacterBase_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_PSCharacterBase_C")
	}
	static class ABP_PSCharacterBase_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_PSCharacterBase_C>();
	}
};
DUMPER7_ASSERTS_ABP_PSCharacterBase_C;

}

