#pragma once

/*
* SDK generated by Rei-SdkDumper
* Based on Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PaperCupIceCream

#include "Basic.hpp"

#include "BP_HouseThrowCupBase_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_PaperCupIceCream.BP_PaperCupIceCream_C
// 0x0028 (0x02C0 - 0x0298)
class ABP_PaperCupIceCream_C final : public ABP_HouseThrowCupBase_C
{
public:
	class UStaticMeshComponent*                   house_throw_ice;                                   // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      Btm;                                               // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      Top;                                               // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UGameNiagaraComponent*                  suixie_debris;                                     // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UGameNiagaraComponent*                  suixie_chocolate;                                  // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void EmptyLiquidCup();
	void SetStrawberryLiquid();
	void SetDebrisOnIceBall();
	void SetChocolateOnIceBall();
	void SetCupBtmChocolate();
	void SetCupBtmDebris();
	void SetCupTopChocolate();
	void SetCupTopDebris();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_PaperCupIceCream_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_PaperCupIceCream_C")
	}
	static class ABP_PaperCupIceCream_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_PaperCupIceCream_C>();
	}
};
DUMPER7_ASSERTS_ABP_PaperCupIceCream_C;

}

