#pragma once

/*
* SDK generated by Rei-SdkDumper
* Based on Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BulletDefine

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct BulletDefine.BulletDefine
// 0x0030 (0x0030 - 0x0000)
struct FBulletDefine final
{
public:
	int32                                         UID_2_379FFDBF4BB2E27526FCFBAFF86421C7;            // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsProjectile_5_509E7A624B10143CA8AEA0B3337D10B4;  // 0x0004(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Rei-SdkDumper ])
	class UNiagaraSystem*                         BulletEffect_9_E19261EC49109ED3FC1315B7469B7B94;   // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraSystem*                         HitEffect_11_F42C10FC493A17EFB66AD49B7208D4E2;     // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         EffectType_20_E7317DCB4B4E02ADC3E39CBBD9B728BB;    // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Rei-SdkDumper ])
	class FString                                 Desc_14_D3CDC71543586D7EB63E44AAE4371281;          // 0x0020(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_FBulletDefine;

}

