#pragma once

/*
* SDK generated by Rei-SdkDumper
* Based on Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CameraBlueprint

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CameraBlueprint_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function CameraBlueprint.CameraInstance.ActivateDynamicCameraNode
// 0x0020 (0x0020 - 0x0000)
struct CameraInstance_ActivateDynamicCameraNode final
{
public:
	TSubclassOf<class UCameraDynamicNode>         NodeClass;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   ActivateOnSlot;                                    // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AutoDeactivateTime;                                // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Rei-SdkDumper ])
	class UCameraDynamicNode*                     ReturnValue;                                       // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CameraInstance_ActivateDynamicCameraNode;

// Function CameraBlueprint.CameraInstance.BlueprintPostUpdateCamera
// 0x0004 (0x0004 - 0x0000)
struct CameraInstance_BlueprintPostUpdateCamera final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CameraInstance_BlueprintPostUpdateCamera;

// Function CameraBlueprint.CameraInstance.BlueprintUpdateCamera
// 0x0004 (0x0004 - 0x0000)
struct CameraInstance_BlueprintUpdateCamera final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CameraInstance_BlueprintUpdateCamera;

// Function CameraBlueprint.CameraInstance.GetInstanceCurrentStateElapsedTime
// 0x0008 (0x0008 - 0x0000)
struct CameraInstance_GetInstanceCurrentStateElapsedTime final
{
public:
	int32                                         MachineIndex;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CameraInstance_GetInstanceCurrentStateElapsedTime;

// Function CameraBlueprint.CameraInstance.GetInstanceMachineWeight
// 0x0008 (0x0008 - 0x0000)
struct CameraInstance_GetInstanceMachineWeight final
{
public:
	int32                                         MachineIndex;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CameraInstance_GetInstanceMachineWeight;

// Function CameraBlueprint.CameraInstance.GetInstanceStateWeight
// 0x000C (0x000C - 0x0000)
struct CameraInstance_GetInstanceStateWeight final
{
public:
	int32                                         MachineIndex;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         StateIndex;                                        // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CameraInstance_GetInstanceStateWeight;

// Function CameraBlueprint.CameraInstance.GetInstanceTransitionCrossfadeDuration
// 0x000C (0x000C - 0x0000)
struct CameraInstance_GetInstanceTransitionCrossfadeDuration final
{
public:
	int32                                         MachineIndex;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         TransitionIndex;                                   // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CameraInstance_GetInstanceTransitionCrossfadeDuration;

// Function CameraBlueprint.CameraInstance.GetInstanceTransitionTimeElapsed
// 0x000C (0x000C - 0x0000)
struct CameraInstance_GetInstanceTransitionTimeElapsed final
{
public:
	int32                                         MachineIndex;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         TransitionIndex;                                   // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CameraInstance_GetInstanceTransitionTimeElapsed;

// Function CameraBlueprint.CameraInstance.GetInstanceTransitionTimeElapsedFraction
// 0x000C (0x000C - 0x0000)
struct CameraInstance_GetInstanceTransitionTimeElapsedFraction final
{
public:
	int32                                         MachineIndex;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         TransitionIndex;                                   // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CameraInstance_GetInstanceTransitionTimeElapsedFraction;

// Function CameraBlueprint.CameraInstance.OnViewTargetChanged
// 0x0010 (0x0010 - 0x0000)
struct CameraInstance_OnViewTargetChanged final
{
public:
	class AActor*                                 OldTarget;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 NewTarget;                                         // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CameraInstance_OnViewTargetChanged;

// Function CameraBlueprint.CameraInstance.RemoveDynamicCameraNode
// 0x0010 (0x0010 - 0x0000)
struct CameraInstance_RemoveDynamicCameraNode final
{
public:
	TSubclassOf<class UCameraDynamicNode>         NodeClass;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InBlendOutTime;                                    // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_CameraInstance_RemoveDynamicCameraNode;

// Function CameraBlueprint.CameraInstance.RemoveDynamicCameraNodeOnSlot
// 0x000C (0x000C - 0x0000)
struct CameraInstance_RemoveDynamicCameraNodeOnSlot final
{
public:
	class FName                                   SlotName;                                          // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InBlendOutTime;                                    // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CameraInstance_RemoveDynamicCameraNodeOnSlot;

// Function CameraBlueprint.CameraInstance.RemoveInterestPoint
// 0x0008 (0x0008 - 0x0000)
struct CameraInstance_RemoveInterestPoint final
{
public:
	class FName                                   PointName;                                         // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CameraInstance_RemoveInterestPoint;

// Function CameraBlueprint.CameraInstance.SetFOVOverride
// 0x0004 (0x0004 - 0x0000)
struct CameraInstance_SetFOVOverride final
{
public:
	float                                         InFOV;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CameraInstance_SetFOVOverride;

// Function CameraBlueprint.CameraInstance.SetInterestPoint
// 0x0014 (0x0014 - 0x0000)
struct CameraInstance_SetInterestPoint final
{
public:
	class FName                                   PointName;                                         // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Location;                                          // 0x0008(0x000C)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CameraInstance_SetInterestPoint;

// Function CameraBlueprint.CameraInstance.StartCameraShake
// 0x0030 (0x0030 - 0x0000)
struct CameraInstance_StartCameraShake final
{
public:
	TSubclassOf<class UCameraShakeBase>           ShakeClass;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Scale;                                             // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   CameraShakeName;                                   // 0x000C(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ECameraShakePlaySpace                         PlaySpace;                                         // 0x0014(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Rei-SdkDumper ])
	struct FRotator                               UserPlaySpaceRot;                                  // 0x0018(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bRestart;                                          // 0x0024(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Rei-SdkDumper ])
	class UCameraShakeBase*                       ReturnValue;                                       // 0x0028(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CameraInstance_StartCameraShake;

// Function CameraBlueprint.CameraInstance.StopCameraShake
// 0x0010 (0x0010 - 0x0000)
struct CameraInstance_StopCameraShake final
{
public:
	class UCameraShakeBase*                       ShakeInstance;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bImmediately;                                      // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_CameraInstance_StopCameraShake;

// Function CameraBlueprint.CameraInstance.StopCameraShakeByName
// 0x000C (0x000C - 0x0000)
struct CameraInstance_StopCameraShakeByName final
{
public:
	class FName                                   ShakeName;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bImmediately;                                      // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_CameraInstance_StopCameraShakeByName;

// Function CameraBlueprint.CameraInstance.GetInterestPoint
// 0x0018 (0x0018 - 0x0000)
struct CameraInstance_GetInterestPoint final
{
public:
	class FName                                   PointName;                                         // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                OutPointLocation;                                  // 0x0008(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0014(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_CameraInstance_GetInterestPoint;

// Function CameraBlueprint.CameraInstance.GetPlayerCameraManager
// 0x0008 (0x0008 - 0x0000)
struct CameraInstance_GetPlayerCameraManager final
{
public:
	class ACBPlayerCameraManager*                 ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CameraInstance_GetPlayerCameraManager;

// Function CameraBlueprint.CameraInstance.GetUpdateResult
// 0x0068 (0x0068 - 0x0000)
struct CameraInstance_GetUpdateResult final
{
public:
	struct FCameraParameter                       ReturnValue;                                       // 0x0000(0x0068)(ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CameraInstance_GetUpdateResult;

// Function CameraBlueprint.CameraInstance.GetViewRotation
// 0x000C (0x000C - 0x0000)
struct CameraInstance_GetViewRotation final
{
public:
	struct FRotator                               ReturnValue;                                       // 0x0000(0x000C)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CameraInstance_GetViewRotation;

// Function CameraBlueprint.CameraInstance.GetViewTarget
// 0x0008 (0x0008 - 0x0000)
struct CameraInstance_GetViewTarget final
{
public:
	class AActor*                                 ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CameraInstance_GetViewTarget;

// Function CameraBlueprint.CameraInstance.GetViewTargetBaseTransform
// 0x0030 (0x0030 - 0x0000)
struct CameraInstance_GetViewTargetBaseTransform final
{
public:
	struct FTransform                             ReturnValue;                                       // 0x0000(0x0030)(Parm, OutParm, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CameraInstance_GetViewTargetBaseTransform;

// Function CameraBlueprint.CameraInstance.IsSlotActive
// 0x000C (0x000C - 0x0000)
struct CameraInstance_IsSlotActive final
{
public:
	class FName                                   SlotNodeName;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_CameraInstance_IsSlotActive;

// Function CameraBlueprint.CameraBlueprintFunctions.ActivateDynamicCameraNode
// 0x0028 (0x0028 - 0x0000)
struct CameraBlueprintFunctions_ActivateDynamicCameraNode final
{
public:
	const class ACBPlayerCameraManager*           CameraManager;                                     // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UCameraDynamicNode>         NodeClass;                                         // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   ActivateOnSlot;                                    // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AutoDeactivateTime;                                // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Rei-SdkDumper ])
	class UCameraDynamicNode*                     ReturnValue;                                       // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CameraBlueprintFunctions_ActivateDynamicCameraNode;

// Function CameraBlueprint.CameraBlueprintFunctions.GetCameraLocation
// 0x0074 (0x0074 - 0x0000)
struct CameraBlueprintFunctions_GetCameraLocation final
{
public:
	struct FCameraParameter                       InCameraParameter;                                 // 0x0000(0x0068)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector                                ReturnValue;                                       // 0x0068(0x000C)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CameraBlueprintFunctions_GetCameraLocation;

// Function CameraBlueprint.CameraBlueprintFunctions.GetViewportLocation
// 0x0074 (0x0074 - 0x0000)
struct CameraBlueprintFunctions_GetViewportLocation final
{
public:
	struct FCameraParameter                       InCameraParameter;                                 // 0x0000(0x0068)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector                                ReturnValue;                                       // 0x0068(0x000C)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CameraBlueprintFunctions_GetViewportLocation;

// Function CameraBlueprint.CameraBlueprintInterface.GetCameraInstanceClass
// 0x0008 (0x0008 - 0x0000)
struct CameraBlueprintInterface_GetCameraInstanceClass final
{
public:
	TSubclassOf<class UCameraInstance>            ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CameraBlueprintInterface_GetCameraInstanceClass;

// Function CameraBlueprint.CameraDynamicNode.Exit
// 0x0004 (0x0004 - 0x0000)
struct CameraDynamicNode_Exit final
{
public:
	float                                         BlendOutTime;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CameraDynamicNode_Exit;

// Function CameraBlueprint.CameraDynamicNode.K2_Evaluate
// 0x00D0 (0x00D0 - 0x0000)
struct CameraDynamicNode_K2_Evaluate final
{
public:
	struct FCameraParameter                       Source;                                            // 0x0000(0x0068)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FCameraParameter                       Output;                                            // 0x0068(0x0068)(Parm, OutParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CameraDynamicNode_K2_Evaluate;

// Function CameraBlueprint.CameraDynamicNode.K2_Update
// 0x000C (0x000C - 0x0000)
struct CameraDynamicNode_K2_Update final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PreviousWeight;                                    // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CurrentWeight;                                     // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CameraDynamicNode_K2_Update;

// Function CameraBlueprint.CameraDynamicNode.SetCameraLagInterpSpeed
// 0x000C (0x000C - 0x0000)
struct CameraDynamicNode_SetCameraLagInterpSpeed final
{
public:
	struct FVector                                InterpSpeed;                                       // 0x0000(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CameraDynamicNode_SetCameraLagInterpSpeed;

// Function CameraBlueprint.CameraDynamicNode.GetActiveTime
// 0x0004 (0x0004 - 0x0000)
struct CameraDynamicNode_GetActiveTime final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CameraDynamicNode_GetActiveTime;

// Function CameraBlueprint.CameraDynamicNode.GetBlendOutTime
// 0x0010 (0x0010 - 0x0000)
struct CameraDynamicNode_GetBlendOutTime final
{
public:
	class AActor*                                 ViewTargetActor;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_CameraDynamicNode_GetBlendOutTime;

// Function CameraBlueprint.CameraDynamicNode.GetCameraInstance
// 0x0008 (0x0008 - 0x0000)
struct CameraDynamicNode_GetCameraInstance final
{
public:
	class UCameraInstance*                        ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CameraDynamicNode_GetCameraInstance;

// Function CameraBlueprint.CameraDynamicNode.GetPlayerController
// 0x0008 (0x0008 - 0x0000)
struct CameraDynamicNode_GetPlayerController final
{
public:
	class APlayerController*                      ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CameraDynamicNode_GetPlayerController;

// Function CameraBlueprint.CameraDynamicNode.GetViewRotation
// 0x000C (0x000C - 0x0000)
struct CameraDynamicNode_GetViewRotation final
{
public:
	struct FRotator                               ReturnValue;                                       // 0x0000(0x000C)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CameraDynamicNode_GetViewRotation;

// Function CameraBlueprint.CameraDynamicNode.GetViewTarget
// 0x0008 (0x0008 - 0x0000)
struct CameraDynamicNode_GetViewTarget final
{
public:
	class AActor*                                 ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CameraDynamicNode_GetViewTarget;

// Function CameraBlueprint.CameraDynamicNode.GetViewTargetBaseTransform
// 0x0030 (0x0030 - 0x0000)
struct CameraDynamicNode_GetViewTargetBaseTransform final
{
public:
	struct FTransform                             ReturnValue;                                       // 0x0000(0x0030)(Parm, OutParm, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CameraDynamicNode_GetViewTargetBaseTransform;

// Function CameraBlueprint.CameraDynamicNode.IsBlendingOut
// 0x0001 (0x0001 - 0x0000)
struct CameraDynamicNode_IsBlendingOut final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CameraDynamicNode_IsBlendingOut;

// Function CameraBlueprint.CBPlayerCameraManager.SetCameraInstanceClass
// 0x0018 (0x0018 - 0x0000)
struct CBPlayerCameraManager_SetCameraInstanceClass final
{
public:
	class UClass*                                 NewCameraClass;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FCameraInstanceTransitionParams        TransitionParams;                                  // 0x0008(0x0010)(Parm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CBPlayerCameraManager_SetCameraInstanceClass;

// Function CameraBlueprint.CBPlayerCameraManager.GetCameraInstance
// 0x0008 (0x0008 - 0x0000)
struct CBPlayerCameraManager_GetCameraInstance final
{
public:
	class UCameraInstance*                        ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CBPlayerCameraManager_GetCameraInstance;

}

