#pragma once

/*
* SDK generated by Rei-SdkDumper
* Based on Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Cartoon

#include "Basic.hpp"

#include "Cartoon_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function Cartoon.CartoonActionWidget.GetParam
// 0x0030 (0x0030 - 0x0000)
struct CartoonActionWidget_GetParam final
{
public:
	class FString                                 InKey;                                             // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 InDefault;                                         // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0020(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CartoonActionWidget_GetParam;

// Function Cartoon.CartoonActionWidget.LuaImpl_IsComplete
// 0x0001 (0x0001 - 0x0000)
struct CartoonActionWidget_LuaImpl_IsComplete final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CartoonActionWidget_LuaImpl_IsComplete;

// Function Cartoon.CartoonActionWidget.LuaImpl_OnBegin
// 0x0010 (0x0010 - 0x0000)
struct CartoonActionWidget_LuaImpl_OnBegin final
{
public:
	class FString                                 ActionName;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CartoonActionWidget_LuaImpl_OnBegin;

// Function Cartoon.CartoonActionWidget.LuaImpl_OnTick
// 0x0004 (0x0004 - 0x0000)
struct CartoonActionWidget_LuaImpl_OnTick final
{
public:
	float                                         InTime;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CartoonActionWidget_LuaImpl_OnTick;

// Function Cartoon.CameraShakeActionWidget.BeginShake
// 0x0010 (0x0010 - 0x0000)
struct CameraShakeActionWidget_BeginShake final
{
public:
	class UMaterialInstanceDynamic*               InMaterial;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   InKey;                                             // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CameraShakeActionWidget_BeginShake;

// Function Cartoon.CartoonBGImage.SetPath
// 0x0010 (0x0010 - 0x0000)
struct CartoonBGImage_SetPath final
{
public:
	class FString                                 InPath;                                            // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CartoonBGImage_SetPath;

// Function Cartoon.CartoonCameraAnimSystem.GoToAnimStartPos
// 0x0008 (0x0008 - 0x0000)
struct CartoonCameraAnimSystem_GoToAnimStartPos final
{
public:
	int32                                         InAnimId;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InSmoothTime;                                      // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CartoonCameraAnimSystem_GoToAnimStartPos;

// Function Cartoon.CartoonCameraAnimSystem.Play
// 0x000C (0x000C - 0x0000)
struct CartoonCameraAnimSystem_Play final
{
public:
	int32                                         InAnimId;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InSmoothTime;                                      // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_CartoonCameraAnimSystem_Play;

// Function Cartoon.CartoonCameraAnimSystem.Reset
// 0x0004 (0x0004 - 0x0000)
struct CartoonCameraAnimSystem_Reset final
{
public:
	float                                         InSmoothTime;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CartoonCameraAnimSystem_Reset;

// Function Cartoon.CartoonCameraAnimSystem.IsPlaying
// 0x0001 (0x0001 - 0x0000)
struct CartoonCameraAnimSystem_IsPlaying final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CartoonCameraAnimSystem_IsPlaying;

// Function Cartoon.CartoonRuntime.CheckGyroInput
// 0x0001 (0x0001 - 0x0000)
struct CartoonRuntime_CheckGyroInput final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CartoonRuntime_CheckGyroInput;

// Function Cartoon.CartoonRuntime.HasTag
// 0x000C (0x000C - 0x0000)
struct CartoonRuntime_HasTag final
{
public:
	class FName                                   InName;                                            // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_CartoonRuntime_HasTag;

// Function Cartoon.CartoonRuntime.IsFix
// 0x0001 (0x0001 - 0x0000)
struct CartoonRuntime_IsFix final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CartoonRuntime_IsFix;

// Function Cartoon.CartoonSettingSystem.GetImagePath
// 0x0028 (0x0028 - 0x0000)
struct CartoonSettingSystem_GetImagePath final
{
public:
	class FString                                 InName;                                            // 0x0000(0x0010)(ConstParm, Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsFix;                                             // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Rei-SdkDumper ])
	class FString                                 ReturnValue;                                       // 0x0018(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CartoonSettingSystem_GetImagePath;

// Function Cartoon.CartoonSpineWidget.LuaImpl_CheckResourceAmend
// 0x0020 (0x0020 - 0x0000)
struct CartoonSpineWidget_LuaImpl_CheckResourceAmend final
{
public:
	class FString                                 InPath;                                            // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CartoonSpineWidget_LuaImpl_CheckResourceAmend;

// Function Cartoon.CartoonSpineWidget.LuaImpl_GetEffecMaterialPathByType
// 0x0018 (0x0018 - 0x0000)
struct CartoonSpineWidget_LuaImpl_GetEffecMaterialPathByType final
{
public:
	int32                                         InType;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Rei-SdkDumper ])
	class FString                                 ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CartoonSpineWidget_LuaImpl_GetEffecMaterialPathByType;

// Function Cartoon.CartoonSpineWidget.OnEffectAnimationCompleteHandler
// 0x0010 (0x0010 - 0x0000)
struct CartoonSpineWidget_OnEffectAnimationCompleteHandler final
{
public:
	class UObject*                                InDispatcher;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTrackEntry*                            InEntry;                                           // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CartoonSpineWidget_OnEffectAnimationCompleteHandler;

// Function Cartoon.CartoonSpineWidget.SetSpineImageAlpha
// 0x0004 (0x0004 - 0x0000)
struct CartoonSpineWidget_SetSpineImageAlpha final
{
public:
	float                                         Alpha;                                             // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CartoonSpineWidget_SetSpineImageAlpha;

// Function Cartoon.CartoonWidget.AllocActionWidget
// 0x0018 (0x0018 - 0x0000)
struct CartoonWidget_AllocActionWidget final
{
public:
	class FString                                 InActionName;                                      // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCartoonActionWidget*                   ReturnValue;                                       // 0x0010(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CartoonWidget_AllocActionWidget;

// Function Cartoon.CartoonWidget.AllocRichmanSpine
// 0x0010 (0x0010 - 0x0000)
struct CartoonWidget_AllocRichmanSpine final
{
public:
	int32                                         InPosType;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Rei-SdkDumper ])
	class UCartoonSpineWidget*                    ReturnValue;                                       // 0x0008(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CartoonWidget_AllocRichmanSpine;

// Function Cartoon.CartoonWidget.AllocSpineWidget
// 0x0008 (0x0008 - 0x0000)
struct CartoonWidget_AllocSpineWidget final
{
public:
	class UCartoonSpineWidget*                    ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CartoonWidget_AllocSpineWidget;

// Function Cartoon.CartoonWidget.CheckCondition
// 0x0018 (0x0018 - 0x0000)
struct CartoonWidget_CheckCondition final
{
public:
	class FString                                 InContent;                                         // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_CartoonWidget_CheckCondition;

// Function Cartoon.CartoonWidget.CheckIsAutoPlay
// 0x0001 (0x0001 - 0x0000)
struct CartoonWidget_CheckIsAutoPlay final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CartoonWidget_CheckIsAutoPlay;

// Function Cartoon.CartoonWidget.FreeActionWidget
// 0x0008 (0x0008 - 0x0000)
struct CartoonWidget_FreeActionWidget final
{
public:
	class UCartoonActionWidget*                   InWidget;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CartoonWidget_FreeActionWidget;

// Function Cartoon.CartoonWidget.FreeSpineWidget
// 0x0008 (0x0008 - 0x0000)
struct CartoonWidget_FreeSpineWidget final
{
public:
	class UCartoonSpineWidget*                    InWidget;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CartoonWidget_FreeSpineWidget;

// Function Cartoon.CartoonWidget.GetBackgroundImageSize
// 0x0008 (0x0008 - 0x0000)
struct CartoonWidget_GetBackgroundImageSize final
{
public:
	struct FVector2D                              ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CartoonWidget_GetBackgroundImageSize;

// Function Cartoon.CartoonWidget.LuaCloseCameraEffect
// 0x0008 (0x0008 - 0x0000)
struct CartoonWidget_LuaCloseCameraEffect final
{
public:
	int32                                         InType;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InTime;                                            // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CartoonWidget_LuaCloseCameraEffect;

// Function Cartoon.CartoonWidget.LuaImpl_NotifyChoiceEnd
// 0x0004 (0x0004 - 0x0000)
struct CartoonWidget_LuaImpl_NotifyChoiceEnd final
{
public:
	int32                                         ChoiceIndex_0;                                     // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CartoonWidget_LuaImpl_NotifyChoiceEnd;

// Function Cartoon.CartoonWidget.LuaImpl_NotifySkipEnabeld
// 0x0001 (0x0001 - 0x0000)
struct CartoonWidget_LuaImpl_NotifySkipEnabeld final
{
public:
	bool                                          InValue;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CartoonWidget_LuaImpl_NotifySkipEnabeld;

// Function Cartoon.CartoonWidget.LuaImpl_UpdateBGSize
// 0x0018 (0x0018 - 0x0000)
struct CartoonWidget_LuaImpl_UpdateBGSize final
{
public:
	class UImage*                                 InImage;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTexture2D*                             InTexture;                                         // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_CartoonWidget_LuaImpl_UpdateBGSize;

// Function Cartoon.CartoonWidget.LuaOpenCameraEffect
// 0x0010 (0x0010 - 0x0000)
struct CartoonWidget_LuaOpenCameraEffect final
{
public:
	int32                                         InType;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         InLayer;                                           // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         InOffset;                                          // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InTime;                                            // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CartoonWidget_LuaOpenCameraEffect;

// Function Cartoon.CartoonWidget.NotifyTextAnimBegin
// 0x0008 (0x0008 - 0x0000)
struct CartoonWidget_NotifyTextAnimBegin final
{
public:
	class UWidget*                                InWidget;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CartoonWidget_NotifyTextAnimBegin;

// Function Cartoon.CartoonWidget.NotifyTextAnimEnd
// 0x0010 (0x0010 - 0x0000)
struct CartoonWidget_NotifyTextAnimEnd final
{
public:
	class UWidget*                                InWidget;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          InForce;                                           // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_CartoonWidget_NotifyTextAnimEnd;

// Function Cartoon.CartoonWidget.OnChoices
// 0x0010 (0x0010 - 0x0000)
struct CartoonWidget_OnChoices final
{
public:
	TArray<struct FCartoonChoiceData>             InOptions;                                         // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CartoonWidget_OnChoices;

// Function Cartoon.CartoonWidget.OnTextInfoChange
// 0x0020 (0x0020 - 0x0000)
struct CartoonWidget_OnTextInfoChange final
{
public:
	class UWidget*                                InWidget;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                   InText;                                            // 0x0008(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CartoonWidget_OnTextInfoChange;

// Function Cartoon.CartoonWidget.RegisterWrapWidget
// 0x0010 (0x0010 - 0x0000)
struct CartoonWidget_RegisterWrapWidget final
{
public:
	class UWidget*                                InSrc;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UWidget*                                InWrap;                                            // 0x0008(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CartoonWidget_RegisterWrapWidget;

// Function Cartoon.CartoonWidget.SetParallaxBlur
// 0x0004 (0x0004 - 0x0000)
struct CartoonWidget_SetParallaxBlur final
{
public:
	float                                         InDistance;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CartoonWidget_SetParallaxBlur;

// Function Cartoon.CartoonWidget.GetBackgroundSize
// 0x0008 (0x0008 - 0x0000)
struct CartoonWidget_GetBackgroundSize final
{
public:
	struct FVector2D                              ReturnValue;                                       // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CartoonWidget_GetBackgroundSize;

}

