#pragma once

/*
* SDK generated by Rei-SdkDumper
* Based on Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Cartoon

#include "Basic.hpp"


namespace SDK
{

// Enum Cartoon.ECartoonCompleteType
// NumValues: 0x0004
enum class ECartoonCompleteType : uint8
{
	Normal                                   = 0,
	Skip                                     = 1,
	Close                                    = 2,
	ECartoonCompleteType_MAX                 = 3,
};

// ScriptStruct Cartoon.CartoonEndData
// 0x0018 (0x0018 - 0x0000)
struct FCartoonEndData final
{
public:
	bool                                          IsSuccess;                                         // 0x0000(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Rei-SdkDumper ])
	class FString                                 ChoiceKeys;                                        // 0x0008(0x0010)(ZeroConstructor, Transient, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FCartoonEndData;

// ScriptStruct Cartoon.CartoonObject
// 0x0018 (0x0018 - 0x0000)
struct FCartoonObject final
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Size After Last Property [ Rei-SdkDumper ])
	TArray<class UObject*>                        List;                                              // 0x0008(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FCartoonObject;

// ScriptStruct Cartoon.ObjectManager
// 0x0170 (0x0170 - 0x0000)
struct FObjectManager final
{
public:
	class ACartoonRuntime*                        Runtime;                                           // 0x0000(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<class FName, struct FCartoonObject>      Objects;                                           // 0x0008(0x0050)(Transient, NativeAccessSpecifierPublic)
	TArray<class ACharacter*>                     AllCharacters;                                     // 0x0058(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPublic)
	TMap<int32, class USceneComponent*>           Components;                                        // 0x0068(0x0050)(ExportObject, Transient, ContainsInstancedReference, NativeAccessSpecifierPublic)
	TMap<int32, class AActor*>                    AllActors;                                         // 0x00B8(0x0050)(Transient, NativeAccessSpecifierPublic)
	uint8                                         Pad_108[0x68];                                     // 0x0108(0x0068)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_FObjectManager;

// ScriptStruct Cartoon.CartoonChoiceData
// 0x0018 (0x0018 - 0x0000)
struct FCartoonChoiceData final
{
public:
	class FString                                 Option;                                            // 0x0000(0x0010)(ZeroConstructor, Transient, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Style;                                             // 0x0010(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsHidden;                                          // 0x0014(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_FCartoonChoiceData;

}

