#pragma once

/*
* SDK generated by Rei-SdkDumper
* Based on Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CBP_Character

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass CBP_Character.CBP_Character_C
// 0x0088 (0x0598 - 0x0510)
class ACBP_Character_C final : public AGameInteractionCharacterV3
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0510(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	float                                         BlushStart_Blush_4FB49FFD4508F781CE9237AF15C753B8; // 0x0518(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            BlushStart__Direction_4FB49FFD4508F781CE9237AF15C753B8; // 0x051C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51D[0x3];                                      // 0x051D(0x0003)(Fixing Size After Last Property [ Rei-SdkDumper ])
	class UTimelineComponent*                     BlushStart;                                        // 0x0520(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         BlushStop_Blush_A91CD03843D3D945C76A41BE535D4D8E;  // 0x0528(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            BlushStop__Direction_A91CD03843D3D945C76A41BE535D4D8E; // 0x052C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_52D[0x3];                                      // 0x052D(0x0003)(Fixing Size After Last Property [ Rei-SdkDumper ])
	class UTimelineComponent*                     BlushStop;                                         // 0x0530(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         BlushID;                                           // 0x0538(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MaterialSlot;                                      // 0x053C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMesh*                          MeshReplacement;                                   // 0x0540(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMap<int32, int32>                            MatStateID;                                        // 0x0548(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void OnBodyMontageBlendingOut(class UAnimMontage* Montage, bool bInterrupted);
	void OnFaceMontageBlendingOut(class UAnimMontage* Montage, bool bInterrupted);
	void SetMatParam(bool SetValue, int32 MatSlot, const class FString& MatParam, float Value, int32* MatStateID_0);
	void End_Render_Stat(const class FString& GlobalName);
	void Set_Other_Mesh_Param(const class FString& GlobalName);
	void Set_Head_Param(bool SkinPartModifyAllAges, const struct FViewGirlMain& HeadStruct, const struct FViewGirlMain& HeadStructAllAges, const class FString& GlobalName);
	void Set_Body_Param(bool SkinPartModifyAllAges, const struct FViewGirlMain& BodyStruct, const struct FViewGirlMain& BodyStructAllAges, const class FString& GlobalName);
	void BlushStart__FinishedFunc();
	void BlushStart__UpdateFunc();
	void BlushStop__FinishedFunc();
	void BlushStop__UpdateFunc();
	void ReceiveBeginPlay();
	void NewStartBlush();
	void NewStopBlush();
	void InteractionStartBlush();
	void InteractionStopBlush();
	void OnBodyMontageBlendingOut__Overridden(class UAnimMontage* Montage, bool bInterrupted);
	void OnFaceMontageBlendingOut__Overridden(class UAnimMontage* Montage, bool bInterrupted);
	void BindConfessionMontageBlendingOut();
	void UnbindConfessionMontageBlendingOut();
	void ExecuteUbergraph_CBP_Character(int32 EntryPoint);

	class FString GetModuleName() const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("CBP_Character_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CBP_Character_C")
	}
	static class ACBP_Character_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ACBP_Character_C>();
	}
};
DUMPER7_ASSERTS_ACBP_Character_C;

}

