#pragma once

/*
* SDK generated by Rei-SdkDumper
* Based on Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CGSpine

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "CGSpine_structs.hpp"


namespace SDK::Params
{

// Function CGSpine.CGSpineLibrary.ClearCGSpine
// 0x0008 (0x0008 - 0x0000)
struct CGSpineLibrary_ClearCGSpine final
{
public:
	class ACameraActor*                           InCameraActor;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CGSpineLibrary_ClearCGSpine;

// Function CGSpine.CGSpineLibrary.CreateSpine
// 0x0110 (0x0110 - 0x0000)
struct CGSpineLibrary_CreateSpine final
{
public:
	class UWorld*                                 InWorld;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Size After Last Property [ Rei-SdkDumper ])
	struct FCGSpineObjectData                     InData;                                            // 0x0010(0x00C0)(Parm, OutParm, NativeAccessSpecifierPublic)
	struct FTransform                             InTransform;                                       // 0x00D0(0x0030)(Parm, OutParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	class ACGSpineObjectActor*                    ReturnValue;                                       // 0x0100(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_108[0x8];                                      // 0x0108(0x0008)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_CGSpineLibrary_CreateSpine;

// Function CGSpine.CGSpineLibrary.FindSpineActorFromPlotName
// 0x0010 (0x0010 - 0x0000)
struct CGSpineLibrary_FindSpineActorFromPlotName final
{
public:
	class FName                                   InPlotName;                                        // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ACGSpineObjectActor*                    ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CGSpineLibrary_FindSpineActorFromPlotName;

// Function CGSpine.CGSpineLibrary.PlayCameraAnimation
// 0x001C (0x001C - 0x0000)
struct CGSpineLibrary_PlayCameraAnimation final
{
public:
	float                                         InTime;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              InStartLocation;                                   // 0x0004(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              InTargetLocation;                                  // 0x000C(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              InScale;                                           // 0x0014(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CGSpineLibrary_PlayCameraAnimation;

// Function CGSpine.CGSpineLibrary.PlayCGSpine
// 0x0020 (0x0020 - 0x0000)
struct CGSpineLibrary_PlayCGSpine final
{
public:
	class UCGSpineData*                           InData;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ACameraActor*                           InCameraActor;                                     // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                InOffsetLocation;                                  // 0x0010(0x000C)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseRealColor;                                     // 0x001C(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCameraForceZero;                                  // 0x001D(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseResourceAmend;                                 // 0x001E(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1F[0x1];                                       // 0x001F(0x0001)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_CGSpineLibrary_PlayCGSpine;

// Function CGSpine.CGSpineLibrary.SetAutoAdapteToScreen
// 0x0018 (0x0018 - 0x0000)
struct CGSpineLibrary_SetAutoAdapteToScreen final
{
public:
	class ACameraActor*                           InCameraActor;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                InCameraAnimationEndLocation;                      // 0x0008(0x000C)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InFOV;                                             // 0x0014(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CGSpineLibrary_SetAutoAdapteToScreen;

// Function CGSpine.CGSpineObjectActor.ActivateBone
// 0x0018 (0x0018 - 0x0000)
struct CGSpineObjectActor_ActivateBone final
{
public:
	class FString                                 BoneName;                                          // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bActivate;                                         // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_CGSpineObjectActor_ActivateBone;

// Function CGSpine.CGSpineObjectActor.OnAnimationCompleteHandler
// 0x0010 (0x0010 - 0x0000)
struct CGSpineObjectActor_OnAnimationCompleteHandler final
{
public:
	class UObject*                                InDispatcher;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTrackEntry*                            InEntry;                                           // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CGSpineObjectActor_OnAnimationCompleteHandler;

// Function CGSpine.CGSpineObjectActor.PlayAnimationSequence
// 0x0018 (0x0018 - 0x0000)
struct CGSpineObjectActor_PlayAnimationSequence final
{
public:
	TArray<class FString>                         InAnimations;                                      // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          bLoop;                                             // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_CGSpineObjectActor_PlayAnimationSequence;

// Function CGSpine.CGSpineObjectActor.PlayNewAnimation
// 0x0018 (0x0018 - 0x0000)
struct CGSpineObjectActor_PlayNewAnimation final
{
public:
	class FString                                 InAnimationName;                                   // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bLoop;                                             // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_CGSpineObjectActor_PlayNewAnimation;

// Function CGSpine.SpineMeshComponent.SetRedrawTime
// 0x0004 (0x0004 - 0x0000)
struct SpineMeshComponent_SetRedrawTime final
{
public:
	float                                         InRedrawTime;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SpineMeshComponent_SetRedrawTime;

// Function CGSpine.SpineMeshComponent.SetTickMode
// 0x0001 (0x0001 - 0x0000)
struct SpineMeshComponent_SetTickMode final
{
public:
	ESpineWidgetTickMode                          InTickMode;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SpineMeshComponent_SetTickMode;

// Function CGSpine.SpineMeshComponent.SetWidget
// 0x0008 (0x0008 - 0x0000)
struct SpineMeshComponent_SetWidget final
{
public:
	class UUserWidget*                            Widget_0;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SpineMeshComponent_SetWidget;

// Function CGSpine.SpineMeshComponent.GetRedrawTime
// 0x0004 (0x0004 - 0x0000)
struct SpineMeshComponent_GetRedrawTime final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SpineMeshComponent_GetRedrawTime;

// Function CGSpine.SpineMeshComponent.GetRenderTarget
// 0x0008 (0x0008 - 0x0000)
struct SpineMeshComponent_GetRenderTarget final
{
public:
	class UTextureRenderTarget2D*                 ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SpineMeshComponent_GetRenderTarget;

// Function CGSpine.SpineMeshComponent.GetUserWidgetObject
// 0x0008 (0x0008 - 0x0000)
struct SpineMeshComponent_GetUserWidgetObject final
{
public:
	class UUserWidget*                            ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SpineMeshComponent_GetUserWidgetObject;

// Function CGSpine.SpineMeshComponent.GetWidget
// 0x0008 (0x0008 - 0x0000)
struct SpineMeshComponent_GetWidget final
{
public:
	class UUserWidget*                            ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SpineMeshComponent_GetWidget;

// Function CGSpine.SpineMeshComponent.IsWidgetVisible
// 0x0001 (0x0001 - 0x0000)
struct SpineMeshComponent_IsWidgetVisible final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SpineMeshComponent_IsWidgetVisible;

// Function CGSpine.UMGSpineController.ChangeCGSpine
// 0x0008 (0x0008 - 0x0000)
struct UMGSpineController_ChangeCGSpine final
{
public:
	class UCGSpineData*                           InCGSpineData;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UMGSpineController_ChangeCGSpine;

// Function CGSpine.UMGSpineController.PlayCGSpine
// 0x0008 (0x0008 - 0x0000)
struct UMGSpineController_PlayCGSpine final
{
public:
	class ACameraActor*                           InCameraActor;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UMGSpineController_PlayCGSpine;

// Function CGSpine.UMGSpineController.SetCameraFov
// 0x0004 (0x0004 - 0x0000)
struct UMGSpineController_SetCameraFov final
{
public:
	float                                         InValue;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UMGSpineController_SetCameraFov;

// Function CGSpine.UMGSpineController.SetCameraLocation
// 0x000C (0x000C - 0x0000)
struct UMGSpineController_SetCameraLocation final
{
public:
	struct FVector                                InValue;                                           // 0x0000(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UMGSpineController_SetCameraLocation;

// Function CGSpine.UMGSpineController.SetCameraRotation
// 0x000C (0x000C - 0x0000)
struct UMGSpineController_SetCameraRotation final
{
public:
	struct FVector                                InValue;                                           // 0x0000(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UMGSpineController_SetCameraRotation;

// Function CGSpine.UMGSpineController.SetCameraZoomScale
// 0x0004 (0x0004 - 0x0000)
struct UMGSpineController_SetCameraZoomScale final
{
public:
	float                                         InValue;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UMGSpineController_SetCameraZoomScale;

// Function CGSpine.UMGSpineSection.AddScalarParameterKey
// 0x0010 (0x0010 - 0x0000)
struct UMGSpineSection_AddScalarParameterKey final
{
public:
	class FName                                   InParameterName;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FFrameNumber                           InTime;                                            // 0x0008(0x0004)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InValue;                                           // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UMGSpineSection_AddScalarParameterKey;

// Function CGSpine.UMGSpineSection.AddStringParameterKey
// 0x0020 (0x0020 - 0x0000)
struct UMGSpineSection_AddStringParameterKey final
{
public:
	class FName                                   InParameterName;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FFrameNumber                           InTime;                                            // 0x0008(0x0004)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Rei-SdkDumper ])
	class FString                                 InValue;                                           // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UMGSpineSection_AddStringParameterKey;

// Function CGSpine.UMGSpineSection.AddTransformParameterKey
// 0x0040 (0x0040 - 0x0000)
struct UMGSpineSection_AddTransformParameterKey final
{
public:
	class FName                                   InParameterName;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FFrameNumber                           InTime;                                            // 0x0008(0x0004)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Rei-SdkDumper ])
	struct FTransform                             InValue;                                           // 0x0010(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UMGSpineSection_AddTransformParameterKey;

// Function CGSpine.UMGSpineSection.RemoveScalarParameter
// 0x000C (0x000C - 0x0000)
struct UMGSpineSection_RemoveScalarParameter final
{
public:
	class FName                                   InParameterName;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_UMGSpineSection_RemoveScalarParameter;

// Function CGSpine.UMGSpineSection.RemoveStringParameter
// 0x000C (0x000C - 0x0000)
struct UMGSpineSection_RemoveStringParameter final
{
public:
	class FName                                   InParameterName;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_UMGSpineSection_RemoveStringParameter;

// Function CGSpine.UMGSpineSection.RemoveTransformParameter
// 0x000C (0x000C - 0x0000)
struct UMGSpineSection_RemoveTransformParameter final
{
public:
	class FName                                   InParameterName;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_UMGSpineSection_RemoveTransformParameter;

}

