#pragma once

/*
* SDK generated by Rei-SdkDumper
* Based on Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CGSpine

#include "Basic.hpp"

#include "CGSpine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "MovieScene_classes.hpp"
#include "Engine_classes.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// Class CGSpine.CGSpineData
// 0x00D0 (0x0100 - 0x0030)
class UCGSpineData final : public UDataAsset
{
public:
	TArray<struct FCGSpineParticleData>           SceneParticles;                                    // 0x0030(0x0010)(Edit, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
	TArray<struct FCGSpineLayerPlaneData>         SceneLayerPlanes;                                  // 0x0040(0x0010)(Edit, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
	TArray<struct FCGSpineObjectData>             SpineObjects;                                      // 0x0050(0x0010)(Edit, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
	struct FCGSpineLayerPlaneData                 BackgroundLayer;                                   // 0x0060(0x0060)(Edit, EditConst, NativeAccessSpecifierPublic)
	struct FSoftObjectPath                        PostProcessMaterial;                               // 0x00C0(0x0018)(Edit, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         GlobalTime;                                        // 0x00D8(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_DC[0x4];                                       // 0x00DC(0x0004)(Fixing Size After Last Property [ Rei-SdkDumper ])
	TArray<struct FKeyframeInfo_PlayParticleEffect> ParticleTriggers;                                // 0x00E0(0x0010)(Edit, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
	TArray<struct FKeyframeInfo_PlaySpineAnimation> SpineAnimationTriggers;                          // 0x00F0(0x0010)(Edit, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CGSpineData")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CGSpineData")
	}
	static class UCGSpineData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCGSpineData>();
	}
};
DUMPER7_ASSERTS_UCGSpineData;

// Class CGSpine.CGSpineLibrary
// 0x0000 (0x0028 - 0x0028)
class UCGSpineLibrary final : public UBlueprintFunctionLibrary
{
public:
	static void ClearAllCameraAnimations();
	static void ClearCGSpine(class ACameraActor* InCameraActor);
	static class ACGSpineObjectActor* CreateSpine(class UWorld* InWorld, struct FCGSpineObjectData* InData, struct FTransform* InTransform);
	static class ACGSpineObjectActor* FindSpineActorFromPlotName(const class FName& InPlotName);
	static void PlayCameraAnimation(float InTime, const struct FVector2D& InStartLocation, const struct FVector2D& InTargetLocation, const struct FVector2D& InScale);
	static void PlayCGSpine(class UCGSpineData* InData, class ACameraActor* InCameraActor, const struct FVector& InOffsetLocation, const bool bUseRealColor, const bool bCameraForceZero, bool bUseResourceAmend);
	static void SetAutoAdapteToScreen(class ACameraActor* InCameraActor, const struct FVector& InCameraAnimationEndLocation, float InFOV);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CGSpineLibrary")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CGSpineLibrary")
	}
	static class UCGSpineLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCGSpineLibrary>();
	}
};
DUMPER7_ASSERTS_UCGSpineLibrary;

// Class CGSpine.CGSpineObjectActor
// 0x0058 (0x0280 - 0x0228)
class ACGSpineObjectActor final : public AActor
{
public:
	class USpineSkeletonAnimationComponent*       SpineAnimationComponent;                           // 0x0228(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USpineSkeletonRendererComponent*        SpineRenderComponent;                              // 0x0230(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_238[0x48];                                     // 0x0238(0x0048)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])

public:
	void ActivateBone(const class FString& BoneName, bool bActivate);
	void OnAnimationCompleteHandler(class UObject* InDispatcher, class UTrackEntry* InEntry);
	void PlayAnimationSequence(const TArray<class FString>& InAnimations, bool bLoop);
	void PlayNewAnimation(const class FString& InAnimationName, bool bLoop);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CGSpineObjectActor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CGSpineObjectActor")
	}
	static class ACGSpineObjectActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<ACGSpineObjectActor>();
	}
};
DUMPER7_ASSERTS_ACGSpineObjectActor;

// Class CGSpine.CGSpineSubsystem
// 0x0040 (0x0070 - 0x0030)
class UCGSpineSubsystem final : public UWorldSubsystem
{
public:
	class AActor*                                 MainActor;                                         // 0x0030(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ACameraActor*                           NewCameraActor;                                    // 0x0038(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 LastViewTargetActor;                               // 0x0040(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UPrimitiveComponent*>            CGSceneComponents;                                 // 0x0048(0x0010)(ExportObject, ZeroConstructor, Transient, ContainsInstancedReference, NativeAccessSpecifierPublic)
	TArray<class ACGSpineObjectActor*>            CGSpineActors;                                     // 0x0058(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPublic)
	class UPrimitiveComponent*                    BackgroundComponent;                               // 0x0068(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CGSpineSubsystem")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CGSpineSubsystem")
	}
	static class UCGSpineSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCGSpineSubsystem>();
	}
};
DUMPER7_ASSERTS_UCGSpineSubsystem;

// Class CGSpine.SpineMeshComponent
// 0x0090 (0x05A0 - 0x0510)
class USpineMeshComponent final : public UStaticMeshComponent
{
public:
	ESpineWidgetTimingPolicy                      TimingPolicy;                                      // 0x0508(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_509[0x7];                                      // 0x0509(0x0007)(Fixing Size After Last Property [ Rei-SdkDumper ])
	TSubclassOf<class UUserWidget>                WidgetClass;                                       // 0x0510(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         BaseDrawWidth;                                     // 0x0518(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         RedrawTime;                                        // 0x051C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_520[0x8];                                      // 0x0520(0x0008)(Fixing Size After Last Property [ Rei-SdkDumper ])
	bool                                          bDrawAtDesiredSize;                                // 0x0528(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_529[0x7];                                      // 0x0529(0x0007)(Fixing Size After Last Property [ Rei-SdkDumper ])
	class UTextureRenderTarget2D*                 RenderTarget;                                      // 0x0530(0x0008)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UMaterialInstanceDynamic*               MaterialInstance;                                  // 0x0538(0x0008)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	ESpineWidgetTickMode                          TickMode;                                          // 0x0540(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_541[0x1F];                                     // 0x0541(0x001F)(Fixing Size After Last Property [ Rei-SdkDumper ])
	class UUserWidget*                            Widget;                                            // 0x0560(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_568[0x38];                                     // 0x0568(0x0038)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])

public:
	void SetRedrawTime(float InRedrawTime);
	void SetTickMode(ESpineWidgetTickMode InTickMode);
	void SetWidget(class UUserWidget* Widget_0);

	float GetRedrawTime() const;
	class UTextureRenderTarget2D* GetRenderTarget() const;
	class UUserWidget* GetUserWidgetObject() const;
	class UUserWidget* GetWidget() const;
	bool IsWidgetVisible() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SpineMeshComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SpineMeshComponent")
	}
	static class USpineMeshComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<USpineMeshComponent>();
	}
};
DUMPER7_ASSERTS_USpineMeshComponent;

// Class CGSpine.UMGSpineController
// 0x0080 (0x01A8 - 0x0128)
class UUMGSpineController final : public UWidget
{
public:
	TSoftObjectPtr<class UCGSpineData>            CGSpineData;                                       // 0x0128(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bPerspective : 1;                                  // 0x0150(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_151[0x3];                                      // 0x0151(0x0003)(Fixing Size After Last Property [ Rei-SdkDumper ])
	float                                         CameraFOV;                                         // 0x0154(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CameraZoomScale;                                   // 0x0158(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                CameraLocation;                                    // 0x015C(0x000C)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                CameraRotation;                                    // 0x0168(0x000C)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                CameraOffsetLocation;                              // 0x0174(0x000C)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseCustomWorld;                                   // 0x0180(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_181[0x27];                                     // 0x0181(0x0027)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])

public:
	void ChangeCGSpine(class UCGSpineData* InCGSpineData);
	void PlayCGSpine(class ACameraActor* InCameraActor);
	void SetCameraFov(float InValue);
	void SetCameraLocation(const struct FVector& InValue);
	void SetCameraRotation(const struct FVector& InValue);
	void SetCameraZoomScale(float InValue);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("UMGSpineController")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"UMGSpineController")
	}
	static class UUMGSpineController* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUMGSpineController>();
	}
};
DUMPER7_ASSERTS_UUMGSpineController;

// Class CGSpine.UMGSpineSection
// 0x0030 (0x0118 - 0x00E8)
class UUMGSpineSection final : public UMovieSceneSection
{
public:
	TArray<struct FCGSpineScalarParameterNameAndCurve> ScalarParameterNamesAndCurves;                // 0x00E8(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TArray<struct FCGSpineTransformParameterNameAndCurves> TransformParameterNamesAndCurves;         // 0x00F8(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TArray<struct FCGSpineStringParameterNameAndCurve> StringParameterNamesAndCurves;                // 0x0108(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)

public:
	void AddScalarParameterKey(class FName InParameterName, const struct FFrameNumber& InTime, float InValue);
	void AddStringParameterKey(class FName InParameterName, const struct FFrameNumber& InTime, const class FString& InValue);
	void AddTransformParameterKey(class FName InParameterName, const struct FFrameNumber& InTime, const struct FTransform& InValue);
	bool RemoveScalarParameter(class FName InParameterName);
	bool RemoveStringParameter(class FName InParameterName);
	bool RemoveTransformParameter(class FName InParameterName);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("UMGSpineSection")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"UMGSpineSection")
	}
	static class UUMGSpineSection* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUMGSpineSection>();
	}
};
DUMPER7_ASSERTS_UUMGSpineSection;

// Class CGSpine.UMGSpineTrack
// 0x0030 (0x00A8 - 0x0078)
class UUMGSpineTrack final : public UMovieSceneTrack
{
public:
	uint8                                         Pad_78[0x8];                                       // 0x0078(0x0008)(Fixing Size After Last Property [ Rei-SdkDumper ])
	class FString                                 ObjectName;                                        // 0x0080(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ECGSpineObjectType                            ObjectType;                                        // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Rei-SdkDumper ])
	TArray<class UMovieSceneSection*>             Sections;                                          // 0x0098(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("UMGSpineTrack")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"UMGSpineTrack")
	}
	static class UUMGSpineTrack* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUMGSpineTrack>();
	}
};
DUMPER7_ASSERTS_UUMGSpineTrack;

// Class CGSpine.UMGSpineUserWidget
// 0x0000 (0x0280 - 0x0280)
class UUMGSpineUserWidget final : public UUserWidget
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("UMGSpineUserWidget")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"UMGSpineUserWidget")
	}
	static class UUMGSpineUserWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUMGSpineUserWidget>();
	}
};
DUMPER7_ASSERTS_UUMGSpineUserWidget;

}

