#pragma once

/*
* SDK generated by Rei-SdkDumper
* Based on Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CharacterInteraction

#include "Basic.hpp"

#include "PhysicsControl_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "CharacterInteraction_structs.hpp"
#include "SeasunAnimGraph_structs.hpp"


namespace SDK
{

// Class CharacterInteraction.InteractionArchivementComponent
// 0x0038 (0x00E8 - 0x00B0)
class UInteractionArchivementComponent final : public UActorComponent
{
public:
	TArray<int32>                                 CompleteConditions;                                // 0x00B0(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TArray<int32>                                 CompleteArchivements;                              // 0x00C0(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TArray<int32>                                 PlayedArchivements;                                // 0x00D0(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	class UDataTable*                             ArchivementDataTable;                              // 0x00E0(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void GetEggLevelSeqs(TArray<class ULevelSequence*>* OutLevelSeqs);
	void SetArchievementPlayed(int32 ID);
	void SetArchivementComplete(int32 ID);
	void SetConditionComplete(int32 ID);
	void SetConditionCompleteAdnRefresh(int32 ID);

	bool IsArchivementComplete(int32 ID) const;
	bool IsArchivementPlayed(int32 ID) const;
	bool IsConditionComplete(int32 ID) const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("InteractionArchivementComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"InteractionArchivementComponent")
	}
	static class UInteractionArchivementComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInteractionArchivementComponent>();
	}
};
DUMPER7_ASSERTS_UInteractionArchivementComponent;

// Class CharacterInteraction.CharacterInteractionComponent
// 0x01D0 (0x0280 - 0x00B0)
class UCharacterInteractionComponent final : public UActorComponent
{
public:
	uint8                                         Pad_B0[0x8];                                       // 0x00B0(0x0008)(Fixing Size After Last Property [ Rei-SdkDumper ])
	TArray<class UInteractionOperate*>            InstancedResistentOperates;                        // 0x00B8(0x0010)(Edit, ExportObject, ZeroConstructor, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	ECharacterInteractionState                    InteractionState;                                  // 0x00C8(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_C9[0x13];                                      // 0x00C9(0x0013)(Fixing Size After Last Property [ Rei-SdkDumper ])
	int32                                         LastStandByID;                                     // 0x00DC(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class UInteractionStandByEvent*>       StandByEvents;                                     // 0x00E0(0x0010)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
	class UInteractionStandByEventContext*        StandByEventContext;                               // 0x00F0(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_F8[0x20];                                      // 0x00F8(0x0020)(Fixing Size After Last Property [ Rei-SdkDumper ])
	TArray<class UInteractionShowEvent*>          ShowEvents;                                        // 0x0118(0x0010)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
	class UInteractionShowEventContext*           ShowEventContext;                                  // 0x0128(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_130[0x10];                                     // 0x0130(0x0010)(Fixing Size After Last Property [ Rei-SdkDumper ])
	class UAnimMontage*                           ShowElementMontage;                                // 0x0140(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UAnimMontage*                           ShowElementFacialMontage;                          // 0x0148(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCustomShowElement*                     CurCustomShowElement;                              // 0x0150(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_158[0x8];                                      // 0x0158(0x0008)(Fixing Size After Last Property [ Rei-SdkDumper ])
	class UInteractionOperate*                    CurrentOperate;                                    // 0x0160(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_168[0x10];                                     // 0x0168(0x0010)(Fixing Size After Last Property [ Rei-SdkDumper ])
	TArray<class UInteractionOperate*>            ResidentOperates;                                  // 0x0178(0x0010)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
	TArray<class UInteractionOperate*>            ActiveOperates;                                    // 0x0188(0x0010)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_198[0x10];                                     // 0x0198(0x0010)(Fixing Size After Last Property [ Rei-SdkDumper ])
	TArray<class UInteractionExtraSequenceProcessor*> ExtraSequenceProcesses;                        // 0x01A8(0x0010)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
	TArray<class UInteractionExtraStandByProcessor*> ExtraStandByProcesses;                          // 0x01B8(0x0010)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_1C8[0x1];                                      // 0x01C8(0x0001)(Fixing Size After Last Property [ Rei-SdkDumper ])
	bool                                          bHasFinishedInteractionTutorial;                   // 0x01C9(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1CA[0x2];                                      // 0x01CA(0x0002)(Fixing Size After Last Property [ Rei-SdkDumper ])
	struct FPendingInteractionState               PendingState;                                      // 0x01CC(0x0008)(Transient, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_1D4[0x4];                                      // 0x01D4(0x0004)(Fixing Size After Last Property [ Rei-SdkDumper ])
	struct FLastFrameAnimData                     LastFrameAnimData;                                 // 0x01D8(0x0030)(Transient, NoDestructor, Protected, NativeAccessSpecifierProtected)
	bool                                          bExplicitFobirdEyeFollow;                          // 0x0208(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bMouseFollowLookAtCamera;                          // 0x0209(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_20A[0x2];                                      // 0x020A(0x0002)(Fixing Size After Last Property [ Rei-SdkDumper ])
	struct FVector2D                              EyesLookAtPosition;                                // 0x020C(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bOperateEyeFollow;                                 // 0x0214(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bShutDownKawaii;                                   // 0x0215(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_216[0x2];                                      // 0x0216(0x0002)(Fixing Size After Last Property [ Rei-SdkDumper ])
	float                                         KawaiiAlpha;                                       // 0x0218(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         KawaiiBlendDuration;                               // 0x021C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         KawaiiShutdownSpeed;                               // 0x0220(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bIsEnableKawaiiBlendCurve;                         // 0x0224(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_225[0x3];                                      // 0x0225(0x0003)(Fixing Size After Last Property [ Rei-SdkDumper ])
	class UCurveFloat*                            EnableKawaiiBlendCurve;                            // 0x0228(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCurveFloat*                            DisableKawaiiBlendCurve;                           // 0x0230(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_238[0x4];                                      // 0x0238(0x0004)(Fixing Size After Last Property [ Rei-SdkDumper ])
	float                                         KawaiBlendSpeedScale;                              // 0x023C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bIsPlayingAnim;                                    // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUpdateKawaii;                                     // 0x0241(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bStopMontages;                                     // 0x0242(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_243[0x5];                                      // 0x0243(0x0005)(Fixing Size After Last Property [ Rei-SdkDumper ])
	TMulticastInlineDelegate<void()>              PropsInteractionDelegate;                          // 0x0248(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_258[0x8];                                      // 0x0258(0x0008)(Fixing Size After Last Property [ Rei-SdkDumper ])
	bool                                          bIsHideBone;                                       // 0x0260(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_261[0x7];                                      // 0x0261(0x0007)(Fixing Size After Last Property [ Rei-SdkDumper ])
	TArray<class FName>                           BoneNames;                                         // 0x0268(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          bIsInteractionInterface;                           // 0x0278(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_279[0x7];                                      // 0x0279(0x0007)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])

public:
	class UInteractionAnimInstance* GetInteractionAnimInstance();
	class UInteractionHeadAnimInstance* GetInteractionHeadAnimInstance();
	void OnPropsInteractionEnd();
	void PlayShowSequence(int32 ShowSequenceID);
	void PlayWeightedVoice(const TArray<struct FWeightedVoice>& VoiceIDs);
	void ResetInteraction();
	void SetbIsPlayingAnim(bool bIsPlaying);
	void SetExplicitForbitEyeFollow(bool bInExplicitForbit);
	void SetFinishedInteractionTutorial(bool IsFinished);
	void SetIsInteractionInterface(bool NewBool);
	void SetOperateEyeFollow(bool bEyeFollow);
	void StartStandby(int32 StandByID);
	void UpdateKawaii(float NewBlendCounter, bool NewShutDownKawaii);

	bool GetIsInteractionInterface() const;
	float GetKawaiiAlphaValue() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CharacterInteractionComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CharacterInteractionComponent")
	}
	static class UCharacterInteractionComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCharacterInteractionComponent>();
	}
};
DUMPER7_ASSERTS_UCharacterInteractionComponent;

// Class CharacterInteraction.FlowerMouseOverInterface
// 0x0000 (0x0000 - 0x0000)
class IFlowerMouseOverInterface final
{
public:
	void OnMouseOver(const struct FVector2D& OverDistance, const struct FVector2D& TargetPosition, const struct FVector2D& LastMousePos);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FlowerMouseOverInterface")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FlowerMouseOverInterface")
	}
	static class IFlowerMouseOverInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IFlowerMouseOverInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IFlowerMouseOverInterface;

// Class CharacterInteraction.InteractionOperate
// 0x00A8 (0x00D0 - 0x0028)
class UInteractionOperate : public UObject
{
public:
	TArray<TSoftObjectPtr<class UInteractionOperateEventAsset>> InteractionEvents;                   // 0x0028(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	TSoftObjectPtr<class UAnimSequence>           FacialAnim;                                        // 0x0038(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<struct FSyncOperate>                   SyncOperates;                                      // 0x0060(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TArray<struct FInteractionHolyLightData>      HolyLights;                                        // 0x0070(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TArray<struct FWeightedVoice>                 VoiceIDs;                                          // 0x0080(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TArray<class FName>                           PhysOperates;                                      // 0x0090(0x0010)(Edit, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TArray<class UInteractionOperateEvent*>       Events;                                            // 0x00A0(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	class UInteractionOperateEventContext*        EventContext;                                      // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bIsDraging;                                        // 0x00B8(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bIsStop;                                           // 0x00B9(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_BA[0x6];                                       // 0x00BA(0x0006)(Fixing Size After Last Property [ Rei-SdkDumper ])
	class UAnimMontage*                           FacialAnimMontage;                                 // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_C8[0x8];                                       // 0x00C8(0x0008)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])

public:
	void OnInteractionEnd(class AInteractionCharacter* Actor);
	void OnInteractionRemove(class AInteractionCharacter* Actor);
	void OnInteractionReuse(class AInteractionCharacter* Actor);
	void OnInteractionStart(class AInteractionCharacter* Actor);
	void OnInteractionUpdate(class AInteractionCharacter* Actor, float DeltaTime);
	void OnScenarioChange(int32 ScenarioID);
	void OnStandByChange(int32 ScenarioID);
	void SetIsStop(bool bInStop);
	bool ShouldRemove(class AInteractionCharacter* Actor);

	bool GetIsStop() const;
	bool IsBlockOperate() const;
	void OnInteractionResume(class AInteractionCharacter* Actor) const;
	void OnInteractionStop(class AInteractionCharacter* Actor) const;
	bool ShouldStopOnRelease() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("InteractionOperate")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"InteractionOperate")
	}
	static class UInteractionOperate* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInteractionOperate>();
	}
};
DUMPER7_ASSERTS_UInteractionOperate;

// Class CharacterInteraction.DragInteraction
// 0x0090 (0x0160 - 0x00D0)
class UDragInteraction : public UInteractionOperate
{
public:
	struct FDragControlData                       DragControl;                                       // 0x00D0(0x0048)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	TArray<struct FIKFixData>                     FixBones;                                          // 0x0118(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FExtraFixData>                  ExtraFixDatas;                                     // 0x0128(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          bBlockStandby;                                     // 0x0138(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsBlush;                                          // 0x0139(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bForceEyeLookAtCamera;                             // 0x013A(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_13B[0x1];                                      // 0x013B(0x0001)(Fixing Size After Last Property [ Rei-SdkDumper ])
	struct FVector2D                              LookAtPosition;                                    // 0x013C(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_144[0x1C];                                     // 0x0144(0x001C)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])

public:
	void UpdateDrag(class AInteractionCharacter* Actor, float DeltaSecond);
	void UpdateRecover(class AInteractionCharacter* Actor, float DeltaSeconds);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DragInteraction")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DragInteraction")
	}
	static class UDragInteraction* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDragInteraction>();
	}
};
DUMPER7_ASSERTS_UDragInteraction;

// Class CharacterInteraction.MouseOverFlowerInteraction
// 0x0010 (0x0170 - 0x0160)
class UMouseOverFlowerInteraction final : public UDragInteraction
{
public:
	float                                         SampleInterval;                                    // 0x0160(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_164[0xC];                                      // 0x0164(0x000C)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MouseOverFlowerInteraction")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MouseOverFlowerInteraction")
	}
	static class UMouseOverFlowerInteraction* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMouseOverFlowerInteraction>();
	}
};
DUMPER7_ASSERTS_UMouseOverFlowerInteraction;

// Class CharacterInteraction.PropsUpdateInterface
// 0x0000 (0x0000 - 0x0000)
class IPropsUpdateInterface final
{
public:
	void PropsUpdate(const struct FTransform& NewTransform);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PropsUpdateInterface")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PropsUpdateInterface")
	}
	static class IPropsUpdateInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IPropsUpdateInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IPropsUpdateInterface;

// Class CharacterInteraction.PropsClickedInterface
// 0x0000 (0x0000 - 0x0000)
class IPropsClickedInterface final
{
public:
	void PropsClicked();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PropsClickedInterface")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PropsClickedInterface")
	}
	static class IPropsClickedInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IPropsClickedInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IPropsClickedInterface;

// Class CharacterInteraction.FBAnimationDefinition
// 0x0280 (0x02B0 - 0x0030)
class UFBAnimationDefinition final : public UDataAsset
{
public:
	int32                                         InteractionName;                                   // 0x0030(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DragSpeedMultiplying;                              // 0x0034(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SampleInterval;                                    // 0x0038(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AttenuationEnergyPerSecond;                        // 0x003C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TimeAttenuationThreshold;                          // 0x0040(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MinClickEnergy;                                    // 0x0044(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxClickEnergy;                                    // 0x0048(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxEnergy;                                         // 0x004C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         NormalInversion;                                   // 0x0050(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               RotatorOffer;                                      // 0x0054(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	float                                         MaxShortAnimTriggerTime;                           // 0x0060(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableSubtract;                                   // 0x0064(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_65[0x3];                                       // 0x0065(0x0003)(Fixing Size After Last Property [ Rei-SdkDumper ])
	TArray<class FName>                           SubtractBoneNames;                                 // 0x0068(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          bEnableAdditive;                                   // 0x0078(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Rei-SdkDumper ])
	TArray<class FName>                           AdditiveBoneNames;                                 // 0x0080(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	float                                         AnimA_BlendInTime;                                 // 0x0090(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AnimA_BlendOutTime;                                // 0x0094(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<TSoftObjectPtr<class UAnimSequence>>   AnimA;                                             // 0x0098(0x0010)(Edit, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UAnimSequence>           FaceAnimA;                                         // 0x00A8(0x0028)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimMontage*                           FaceAnimAMontage;                                  // 0x00D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UAnimMontage>            AnimB;                                             // 0x00D8(0x0028)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UAnimMontage>            FaceAnimB;                                         // 0x0100(0x0028)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AnimB1_BlendInTime;                                // 0x0128(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AnimB1_BlendOutTime;                               // 0x012C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UAnimSequence>           AnimB1;                                            // 0x0130(0x0028)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UAnimSequence>           FaceAnimB1;                                        // 0x0158(0x0028)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UAnimMontage>            AnimC;                                             // 0x0180(0x0028)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UAnimMontage>            FaceAnimC;                                         // 0x01A8(0x0028)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AnimPropA_BlendInTime;                             // 0x01D0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AnimPropA_BlendOutTime;                            // 0x01D4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UAnimSequence>           AnimPropA;                                         // 0x01D8(0x0028)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UAnimMontage>            AnimPropB;                                         // 0x0200(0x0028)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AnimPropB1_BlendInTime;                            // 0x0228(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AnimPropB1_BlendOutTime;                           // 0x022C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UAnimSequence>           AnimPropB1;                                        // 0x0230(0x0028)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UAnimMontage>            AnimPropC;                                         // 0x0258(0x0028)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FWeightedVoice>                 AnimAVoiceIDs;                                     // 0x0280(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FWeightedVoice>                 AnimBVoiceIDs;                                     // 0x0290(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FWeightedVoice>                 AnimCVoiceIDs;                                     // 0x02A0(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FBAnimationDefinition")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FBAnimationDefinition")
	}
	static class UFBAnimationDefinition* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFBAnimationDefinition>();
	}
};
DUMPER7_ASSERTS_UFBAnimationDefinition;

// Class CharacterInteraction.InteractionPropsDrag
// 0x01B0 (0x0310 - 0x0160)
class UInteractionPropsDrag final : public UDragInteraction
{
public:
	bool                                          EnableInteractionUpdate;                           // 0x0160(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_161[0x3];                                      // 0x0161(0x0003)(Fixing Size After Last Property [ Rei-SdkDumper ])
	int32                                         CurrentTickOperateIndex;                           // 0x0164(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TiltAngle;                                         // 0x0168(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         YawAngle;                                          // 0x016C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<class FName, class UFBAnimationDefinition*> PropsAnimDefinition;                            // 0x0170(0x0050)(Edit, NativeAccessSpecifierPublic)
	float                                         ShortAnimTriggerTime;                              // 0x01C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C4[0x4];                                      // 0x01C4(0x0004)(Fixing Size After Last Property [ Rei-SdkDumper ])
	class AInteractionCharacter*                  InteractionCharacter;                              // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCharacterInteractionComponent*         InteractionComponent;                              // 0x01D0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFBAnimationDefinition*                 CurrentFBAnimationDefinition;                      // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         CurrentEnergy;                                     // 0x01E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         TimeCounter;                                       // 0x01E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         CurrentTimeAttenuationThreshold;                   // 0x01E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1EC[0x4];                                      // 0x01EC(0x0004)(Fixing Size After Last Property [ Rei-SdkDumper ])
	class UInteractionPropsDrag*                  CurrentTickOperate;                                // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class AInteractionCharacter*                  CurrentProp;                                       // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAnimMontage*                           AnimAMontage;                                      // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAnimMontage*                           AnimBMontage;                                      // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAnimMontage*                           AnimBEndMontage;                                   // 0x0210(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAnimMontage*                           AnimCMontage;                                      // 0x0218(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_220[0x98];                                     // 0x0220(0x0098)(Fixing Size After Last Property [ Rei-SdkDumper ])
	float                                         DeltaSeconds;                                      // 0x02B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2BC[0x4];                                      // 0x02BC(0x0004)(Fixing Size After Last Property [ Rei-SdkDumper ])
	struct FTransform                             HitTransform;                                      // 0x02C0(0x0030)(IsPlainOldData, NoDestructor, NativeAccessSpecifierPrivate)
	bool                                          bShowMouseCursor;                                  // 0x02F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bPlayAnimC;                                        // 0x02F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bPlayAnimB;                                        // 0x02F2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2F3[0x5];                                      // 0x02F3(0x0005)(Fixing Size After Last Property [ Rei-SdkDumper ])
	class UAnimInstance*                          AnimInstance;                                      // 0x02F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FTimerHandle                           TimerHandle;                                       // 0x0300(0x0008)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_308[0x8];                                      // 0x0308(0x0008)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])

public:
	void ReSetCurrentEnergy();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("InteractionPropsDrag")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"InteractionPropsDrag")
	}
	static class UInteractionPropsDrag* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInteractionPropsDrag>();
	}
};
DUMPER7_ASSERTS_UInteractionPropsDrag;

// Class CharacterInteraction.PropUpdateDefinition
// 0x0050 (0x0080 - 0x0030)
class UPropUpdateDefinition final : public UDataAsset
{
public:
	float                                         DragSpeedMultiplying;                              // 0x0030(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         NormalInversion;                                   // 0x0034(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               RotatorOffer;                                      // 0x0038(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	float                                         ErrorTolerance;                                    // 0x0044(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableSubtract;                                   // 0x0048(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Rei-SdkDumper ])
	TArray<class FName>                           SubtractBoneNames;                                 // 0x0050(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          bEnableAdditive;                                   // 0x0060(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Rei-SdkDumper ])
	TArray<class FName>                           AdditiveBoneNames;                                 // 0x0068(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	class UInteractionOperateEventAsset*          EventAsset;                                        // 0x0078(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PropUpdateDefinition")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PropUpdateDefinition")
	}
	static class UPropUpdateDefinition* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPropUpdateDefinition>();
	}
};
DUMPER7_ASSERTS_UPropUpdateDefinition;

// Class CharacterInteraction.InteractionPropsUpdate
// 0x0108 (0x0268 - 0x0160)
class UInteractionPropsUpdate final : public UDragInteraction
{
public:
	float                                         TiltAngle;                                         // 0x0160(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         YawAngle;                                          // 0x0164(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<class FName, class UPropUpdateDefinition*> PropsDefinition;                                 // 0x0168(0x0050)(Edit, NativeAccessSpecifierPublic)
	class UPropUpdateDefinition*                  CurrentDefinition;                                 // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class AInteractionCharacter*                  CurrentProp;                                       // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FHitResult                             OutHit;                                            // 0x01C8(0x008C)(IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	struct FVector                                DeltaLocation;                                     // 0x0254(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         DeltaSeconds;                                      // 0x0260(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_264[0x4];                                      // 0x0264(0x0004)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("InteractionPropsUpdate")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"InteractionPropsUpdate")
	}
	static class UInteractionPropsUpdate* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInteractionPropsUpdate>();
	}
};
DUMPER7_ASSERTS_UInteractionPropsUpdate;

// Class CharacterInteraction.HolyLightComponent
// 0x0058 (0x0108 - 0x00B0)
class UHolyLightComponent final : public UActorComponent
{
public:
	TMap<class FName, struct FInteractionHolyLightRuntimeDataArray> HolyLightRuntimeData;            // 0x00B0(0x0050)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	uint8                                         Pad_100[0x8];                                      // 0x0100(0x0008)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("HolyLightComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"HolyLightComponent")
	}
	static class UHolyLightComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHolyLightComponent>();
	}
};
DUMPER7_ASSERTS_UHolyLightComponent;

// Class CharacterInteraction.InteractionAnimInstance
// 0x0230 (0x04F0 - 0x02C0)
class UInteractionAnimInstance final : public UAnimInstance
{
public:
	bool                                          bHeadModifyUseYawMove;                             // 0x02B8(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2B9[0x7];                                      // 0x02B9(0x0007)(Fixing Size After Last Property [ Rei-SdkDumper ])
	class UAnimSequence*                          AnimStandBy;                                       // 0x02C0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UAnimSequence*                          StandByBlendTarget;                                // 0x02C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         StandByAnimBlendRatio;                             // 0x02D0(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector2D                              HeadModifyOffset;                                  // 0x02D4(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector2D                              MouseFollowHeadOffset;                             // 0x02DC(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FRotator                               HeadRotator;                                       // 0x02E4(0x000C)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FRuntimeSpineWeight                    RuntimeSpineDatas;                                 // 0x02F0(0x0050)(BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	TArray<struct FInteractionBlendSpaceData>     BlendSpaceDatas;                                   // 0x0340(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	int32                                         BlendSpaceCount;                                   // 0x0350(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_354[0x19C];                                    // 0x0354(0x019C)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])

public:
	void ScenarioInitializeAnimation();
	void SetIsDebugDraw(bool bInDebugDraw);

	bool GetIsDebugDraw() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("InteractionAnimInstance")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"InteractionAnimInstance")
	}
	static class UInteractionAnimInstance* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInteractionAnimInstance>();
	}
};
DUMPER7_ASSERTS_UInteractionAnimInstance;

// Class CharacterInteraction.InteractionCableComponent
// 0x00D0 (0x0570 - 0x04A0)
class UInteractionCableComponent final : public UMeshComponent
{
public:
	bool                                          bAttachStart;                                      // 0x04A0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAttachEnd;                                        // 0x04A1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4A2[0x6];                                      // 0x04A2(0x0006)(Fixing Size After Last Property [ Rei-SdkDumper ])
	struct FComponentReference                    AttachEndTo;                                       // 0x04A8(0x0028)(Edit, NativeAccessSpecifierPublic)
	class FName                                   AttachEndToSocketName;                             // 0x04D0(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                EndLocation;                                       // 0x04D8(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InteractionCableLength;                            // 0x04E4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         NumSegments;                                       // 0x04E8(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SubstepTime;                                       // 0x04EC(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SolverIterations;                                  // 0x04F0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableStiffness;                                  // 0x04F4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseSubstepping;                                   // 0x04F5(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSkipInteractionCableUpdateWhenNotVisible;         // 0x04F6(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSkipInteractionCableUpdateWhenNotOwnerRecentlyRendered; // 0x04F7(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableCollision;                                  // 0x04F8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4F9[0x3];                                      // 0x04F9(0x0003)(Fixing Size After Last Property [ Rei-SdkDumper ])
	float                                         CollisionFriction;                                 // 0x04FC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                InteractionCableForce;                             // 0x0500(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InteractionCableGravityScale;                      // 0x050C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InteractionCableWidth;                             // 0x0510(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         NumSides;                                          // 0x0514(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TileMaterial;                                      // 0x0518(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseVertexColor;                                   // 0x051C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_51D[0x1B];                                     // 0x051D(0x001B)(Fixing Size After Last Property [ Rei-SdkDumper ])
	struct FVector                                GrabForce;                                         // 0x0538(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         GrabIndex;                                         // 0x0544(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_548[0x10];                                     // 0x0548(0x0010)(Fixing Size After Last Property [ Rei-SdkDumper ])
	bool                                          bIsXPBD;                                           // 0x0558(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_559[0x3];                                      // 0x0559(0x0003)(Fixing Size After Last Property [ Rei-SdkDumper ])
	int32                                         SolverIterationsXPBD;                              // 0x055C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AlphaMultiply;                                     // 0x0560(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableDebug;                                      // 0x0564(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_565[0xB];                                      // 0x0565(0x000B)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])

public:
	void AddConstraint(int32 IndexA, int32 IndexB);
	void GrabParticles(const int32 ParticleIndex, const struct FVector& DragForce);
	void IntegrateParticles(float DeltaTime);
	void SetAttachEndTo(class AActor* Actor, class FName ComponentProperty, class FName SocketName);
	void SetAttachEndToComponent(class USceneComponent* Component, class FName SocketName);
	void SolveDistanceConstraints(float DeltaTime);
	void UpdateVelocities(float DeltaTime);

	void DebugDraw() const;
	class AActor* GetAttachedActor() const;
	class USceneComponent* GetAttachedComponent() const;
	void GetInteractionCableParticleLocations(TArray<struct FVector>* Locations) const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("InteractionCableComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"InteractionCableComponent")
	}
	static class UInteractionCableComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInteractionCableComponent>();
	}
};
DUMPER7_ASSERTS_UInteractionCableComponent;

// Class CharacterInteraction.InteractionCharacter
// 0x0098 (0x02C0 - 0x0228)
class AInteractionCharacter : public AActor
{
public:
	class USkeletalMeshComponent*                 SkeletalMeshComponent;                             // 0x0228(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class USkeletalMeshComponent*                 HeadMeshComponent;                                 // 0x0230(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCharacterInteractionComponent*         InteractionComponent;                              // 0x0238(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
