#pragma once

/*
* SDK generated by Rei-SdkDumper
* Based on Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CharacterInteractionV3

#include "Basic.hpp"

#include "CameraBlueprint_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "Slate_structs.hpp"
#include "InputCore_structs.hpp"


namespace SDK
{

// Enum CharacterInteractionV3.EInteractionV3OperateEventType
// NumValues: 0x0004
enum class EInteractionV3OperateEventType : uint8
{
	Start                                    = 0,
	Update                                   = 1,
	End                                      = 2,
	EInteractionV3OperateEventType_MAX       = 3,
};

// Enum CharacterInteractionV3.EInteractionConditionTypeV3
// NumValues: 0x0004
enum class EInteractionConditionTypeV3 : uint8
{
	Any                                      = 0,
	All                                      = 1,
	Order                                    = 2,
	EInteractionConditionTypeV3_MAX          = 3,
};

// Enum CharacterInteractionV3.EInteractionV3CameraMoveType
// NumValues: 0x0003
enum class EInteractionV3CameraMoveType : uint8
{
	Translate                                = 0,
	Rotate                                   = 1,
	EInteractionV3CameraMoveType_MAX         = 2,
};

// Enum CharacterInteractionV3.EInteractionV3StandbyCameraType
// NumValues: 0x0003
enum class EInteractionV3StandbyCameraType : uint8
{
	Self                                     = 0,
	Character                                = 1,
	EInteractionV3StandbyCameraType_MAX      = 2,
};

// Enum CharacterInteractionV3.EInteractionV3IKSlot
// NumValues: 0x0003
enum class EInteractionV3IKSlot : uint8
{
	Default                                  = 0,
	AfterBreathAdditive                      = 1,
	EInteractionV3IKSlot_MAX                 = 2,
};

// Enum CharacterInteractionV3.EInteractionV3BlendSpaceSlot
// NumValues: 0x0002
enum class EInteractionV3BlendSpaceSlot : uint8
{
	Default                                  = 0,
	EInteractionV3BlendSpaceSlot_MAX         = 1,
};

// Enum CharacterInteractionV3.EInteractionVoiceType
// NumValues: 0x0003
enum class EInteractionVoiceType : uint8
{
	ShowElement                              = 0,
	Operate                                  = 1,
	EInteractionVoiceType_MAX                = 2,
};

// Enum CharacterInteractionV3.EInteractionDragValueCompareType
// NumValues: 0x0004
enum class EInteractionDragValueCompareType : uint8
{
	Larger                                   = 0,
	Less                                     = 1,
	NotCompare                               = 2,
	EInteractionDragValueCompareType_MAX     = 3,
};

// Enum CharacterInteractionV3.EInteractionCharacterShoeType
// NumValues: 0x0003
enum class EInteractionCharacterShoeType : uint8
{
	LeftShoe                                 = 0,
	RightShoe                                = 1,
	EInteractionCharacterShoeType_MAX        = 2,
};

// Enum CharacterInteractionV3.EScenarioNodeInnerState
// NumValues: 0x0007
enum class EScenarioNodeInnerState : uint8
{
	None                                     = 0,
	Prepare                                  = 1,
	Standby                                  = 2,
	Operate                                  = 3,
	ShowElement                              = 4,
	Exit                                     = 5,
	EScenarioNodeInnerState_MAX              = 6,
};

// Enum CharacterInteractionV3.EInteractionV3DragInterpolationType
// NumValues: 0x0003
enum class EInteractionV3DragInterpolationType : uint8
{
	DecelerateInterpolation                  = 0,
	SpringInterpolation                      = 1,
	EInteractionV3DragInterpolationType_MAX  = 2,
};

// Enum CharacterInteractionV3.EInteractionV3InputType
// NumValues: 0x0006
enum class EInteractionV3InputType : uint8
{
	Press                                    = 0,
	Release                                  = 1,
	Click                                    = 2,
	Move                                     = 3,
	Confirm                                  = 4,
	EInteractionV3InputType_MAX              = 5,
};

// Enum CharacterInteractionV3.EScenarioOperateState
// NumValues: 0x0004
enum class EScenarioOperateState : uint8
{
	None                                     = 0,
	Operating                                = 1,
	BlendOut                                 = 2,
	EScenarioOperateState_MAX                = 3,
};

// Enum CharacterInteractionV3.EScenarioLittleGameUIState
// NumValues: 0x0004
enum class EScenarioLittleGameUIState : uint8
{
	NoCreate                                 = 0,
	Show                                     = 1,
	Hide                                     = 2,
	EScenarioLittleGameUIState_MAX           = 3,
};

// Enum CharacterInteractionV3.EConfessionInnerState
// NumValues: 0x0005
enum class EConfessionInnerState : uint8
{
	None                                     = 0,
	Idle                                     = 1,
	Playing                                  = 2,
	End                                      = 3,
	EConfessionInnerState_MAX                = 4,
};

// Enum CharacterInteractionV3.EConfessionNodeEndType
// NumValues: 0x0003
enum class EConfessionNodeEndType : uint8
{
	SelfAnim                                 = 0,
	LastFrame                                = 1,
	EConfessionNodeEndType_MAX               = 2,
};

// Enum CharacterInteractionV3.EScenarioNodeStage
// NumValues: 0x0005
enum class EScenarioNodeStage : uint8
{
	Inactive                                 = 0,
	Initialize                               = 1,
	Entering                                 = 2,
	Activate                                 = 3,
	EScenarioNodeStage_MAX                   = 4,
};

// ScriptStruct CharacterInteractionV3.InteractionCaptionsConfig
// 0x0018 (0x0020 - 0x0008)
struct FInteractionCaptionsConfig final : public FTableRowBase
{
public:
	float                                         DelayTime;                                         // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DurationTime;                                      // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Caption;                                           // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FInteractionCaptionsConfig;

// ScriptStruct CharacterInteractionV3.MusicQTEBtnData
// 0x0024 (0x0024 - 0x0000)
struct FMusicQTEBtnData final
{
public:
	float                                         ShowTime;                                          // 0x0000(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         PosID;                                             // 0x0004(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         BtnType;                                           // 0x0008(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Duration;                                          // 0x000C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              GoodRange;                                         // 0x0010(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              PerfectRange;                                      // 0x0018(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LongPressTime;                                     // 0x0020(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FMusicQTEBtnData;

// ScriptStruct CharacterInteractionV3.AnimNode_InteractionV3BlendSpace
// 0x0018 (0x0028 - 0x0010)
struct FAnimNode_InteractionV3BlendSpace final : public FAnimNode_Base
{
public:
	EInteractionV3BlendSpaceSlot                  SlotType;                                          // 0x0010(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x17];                                      // 0x0011(0x0017)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_FAnimNode_InteractionV3BlendSpace;

// ScriptStruct CharacterInteractionV3.AnimNode_InteractionV3IK
// 0x0018 (0x00E0 - 0x00C8)
struct FAnimNode_InteractionV3IK final : public FAnimNode_SkeletalControlBase
{
public:
	struct FComponentSpacePoseLink                RefComponentPose;                                  // 0x00C8(0x0010)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	EInteractionV3IKSlot                          SlotType;                                          // 0x00D8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_FAnimNode_InteractionV3IK;

// ScriptStruct CharacterInteractionV3.InteractionCameraModifierInfo
// 0x0028 (0x0028 - 0x0000)
struct FInteractionCameraModifierInfo final
{
public:
	struct FRotator                               AdditiveRotation;                                  // 0x0000(0x000C)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector                                ViewPointLocationOffset;                           // 0x000C(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AdditiveArmLength;                                 // 0x0018(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                CameraLocation;                                    // 0x001C(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FInteractionCameraModifierInfo;

// ScriptStruct CharacterInteractionV3.CameraNode_InteractionStandby
// 0x0038 (0x0048 - 0x0010)
struct FCameraNode_InteractionStandby final : public FCameraNode_Base
{
public:
	struct FCameraParameterLink                   Source;                                            // 0x0010(0x0010)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	struct FInteractionCameraModifierInfo         StandbyModifierInfo;                               // 0x0020(0x0028)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FCameraNode_InteractionStandby;

// ScriptStruct CharacterInteractionV3.InteractionV3WeightedVoice
// 0x0028 (0x0028 - 0x0000)
struct FInteractionV3WeightedVoice final
{
public:
	float                                         Weight;                                            // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Rei-SdkDumper ])
	class FString                                 VoiceID;                                           // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 SpeakingContent;                                   // 0x0018(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FInteractionV3WeightedVoice;

// ScriptStruct CharacterInteractionV3.InteractionVoiceConfig
// 0x0040 (0x0048 - 0x0008)
struct FInteractionVoiceConfig final : public FTableRowBase
{
public:
	EInteractionVoiceType                         VoiceType;                                         // 0x0008(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Rei-SdkDumper ])
	class FName                                   Name;                                              // 0x000C(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Rei-SdkDumper ])
	TArray<struct FInteractionV3WeightedVoice>    WeightedVoice;                                     // 0x0018(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	class FName                                   CharacterID;                                       // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FInteractionCaptionsConfig>     CaptionConfigs;                                    // 0x0030(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          bPlayUntilFinished;                                // 0x0040(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_FInteractionVoiceConfig;

// ScriptStruct CharacterInteractionV3.FennyVoiceTipCfg
// 0x0058 (0x0058 - 0x0000)
struct FFennyVoiceTipCfg final
{
public:
	int32                                         ID;                                                // 0x0000(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Weight;                                            // 0x0004(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FInteractionVoiceConfig                VoiceConfig;                                       // 0x0008(0x0048)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	struct FVector2D                              DelayTime;                                         // 0x0050(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FFennyVoiceTipCfg;

// ScriptStruct CharacterInteractionV3.ScenarioStandbyActorInfo
// 0x0058 (0x0058 - 0x0000)
struct FScenarioStandbyActorInfo final
{
public:
	class FName                                   ActorName;                                         // 0x0000(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UAnimSequence>           StandbyAnim;                                       // 0x0008(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UAnimSequence>           FaceStandbyAnim;                                   // 0x0030(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FScenarioStandbyActorInfo;

// ScriptStruct CharacterInteractionV3.FennyShowerStandbyCfg
// 0x0038 (0x0038 - 0x0000)
struct FFennyShowerStandbyCfg final
{
public:
	TArray<struct FScenarioStandbyActorInfo>      StandbyActorInfos;                                 // 0x0000(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class ULevelSequence>          CameraSequenceAsset;                               // 0x0010(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FFennyShowerStandbyCfg;

// ScriptStruct CharacterInteractionV3.InteractionV3HolyLightData
// 0x0020 (0x0020 - 0x0000)
struct FInteractionV3HolyLightData final
{
public:
	class FName                                   SocketName;                                        // 0x0000(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Intensity;                                         // 0x0008(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   UIName;                                            // 0x000C(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Rei-SdkDumper ])
	class UCurveFloat*                            SizeRatio;                                         // 0x0018(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FInteractionV3HolyLightData;

// ScriptStruct CharacterInteractionV3.InteractionV3HolyLightRuntimeData
// 0x0028 (0x0028 - 0x0000)
struct FInteractionV3HolyLightRuntimeData final
{
public:
	struct FInteractionV3HolyLightData            Data;                                              // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPublic)
	int32                                         AddTimes;                                          // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_FInteractionV3HolyLightRuntimeData;

// ScriptStruct CharacterInteractionV3.InteractionV3HolyLightRuntimeDataArray
// 0x0010 (0x0010 - 0x0000)
struct FInteractionV3HolyLightRuntimeDataArray final
{
public:
	TArray<struct FInteractionV3HolyLightRuntimeData> ArrayData;                                     // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FInteractionV3HolyLightRuntimeDataArray;

// ScriptStruct CharacterInteractionV3.InteractionArchivementConditionV3
// 0x0018 (0x0018 - 0x0000)
struct FInteractionArchivementConditionV3 final
{
public:
	TArray<int32>                                 ConditionIDs;                                      // 0x0000(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	EInteractionConditionTypeV3                   ConditionType;                                     // 0x0010(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_FInteractionArchivementConditionV3;

// ScriptStruct CharacterInteractionV3.InteractionArchivementInfoV3
// 0x0028 (0x0028 - 0x0000)
struct FInteractionArchivementInfoV3 final
{
public:
	int32                                         ID;                                                // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Rei-SdkDumper ])
	TArray<struct FInteractionArchivementConditionV3> Conditions;                                    // 0x0008(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class UInteractionV3Event*>            Events;                                            // 0x0018(0x0010)(Edit, ExportObject, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FInteractionArchivementInfoV3;

// ScriptStruct CharacterInteractionV3.SceneActorComponentShowConfig
// 0x0028 (0x0030 - 0x0008)
struct FSceneActorComponentShowConfig final : public FTableRowBase
{
public:
	class FString                                 SceneName;                                         // 0x0008(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   ActorName;                                         // 0x0018(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   ComponentTag;                                      // 0x0020(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShow;                                             // 0x0028(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_FSceneActorComponentShowConfig;

// ScriptStruct CharacterInteractionV3.ShowElementsAnim
// 0x0018 (0x0018 - 0x0000)
struct FShowElementsAnim final
{
public:
	class FName                                   ActorName;                                         // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimSequence*                          IdleAnim;                                          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimSequence*                          FaceIdleAnim;                                      // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FShowElementsAnim;

// ScriptStruct CharacterInteractionV3.InteractionActionKeyMapping
// 0x0068 (0x0068 - 0x0000)
struct FInteractionActionKeyMapping final
{
public:
	class FName                                   ActionName;                                        // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FInputChord                            KeyboardInputChord;                                // 0x0008(0x0020)(Edit, BlueprintVisible, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FInputChord                            PS4InputChord;                                     // 0x0028(0x0020)(Edit, BlueprintVisible, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FInputChord                            XBoxInputChord;                                    // 0x0048(0x0020)(Edit, BlueprintVisible, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FInteractionActionKeyMapping;

// ScriptStruct CharacterInteractionV3.InteractionPreInputInfo
// 0x0018 (0x0018 - 0x0000)
struct FInteractionPreInputInfo final
{
public:
	int32                                         Handle;                                            // 0x0000(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDown;                                             // 0x0004(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Rei-SdkDumper ])
	TDelegate<void()>                             Action;                                            // 0x0008(0x0010)(ZeroConstructor, Transient, InstancedReference, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FInteractionPreInputInfo;

// ScriptStruct CharacterInteractionV3.InteractionCacheKeyBinding
// 0x0020 (0x0020 - 0x0000)
struct FInteractionCacheKeyBinding final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(Transient, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EInputEvent                                   EventType;                                         // 0x0018(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_FInteractionCacheKeyBinding;

// ScriptStruct CharacterInteractionV3.InteractionInputContext
// 0x0020 (0x0020 - 0x0000)
struct FInteractionInputContext final
{
public:
	class UInteractionInputComponent*             InputComponent;                                    // 0x0000(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_8[0x18];                                       // 0x0008(0x0018)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_FInteractionInputContext;

// ScriptStruct CharacterInteractionV3.DragCircleDataV3
// 0x0010 (0x0010 - 0x0000)
struct FDragCircleDataV3 final
{
public:
	float                                         Radius;                                            // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Rei-SdkDumper ])
	class UCurveFloat*                            CircleMappingCurve;                                // 0x0008(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FDragCircleDataV3;

// ScriptStruct CharacterInteractionV3.DragControlDataV3
// 0x0050 (0x0050 - 0x0000)
struct FDragControlDataV3 final
{
public:
	struct FVector2D                              ScreenPercentToWorld;                              // 0x0000(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Size After Last Property [ Rei-SdkDumper ])
	struct FVector4                               WorldSpaceLimit;                                   // 0x0010(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCurveFloat*                            DragDampingCurve;                                  // 0x0020(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCurveFloat*                            DragRecoverCurve;                                  // 0x0028(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DragRecoverTime;                                   // 0x0030(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsUseCircleMapping;                               // 0x0034(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Rei-SdkDumper ])
	struct FDragCircleDataV3                      CircleMappingData;                                 // 0x0038(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bIsUseLimitSpeed;                                  // 0x0048(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Rei-SdkDumper ])
	float                                         SpdLimit;                                          // 0x004C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FDragControlDataV3;

// ScriptStruct CharacterInteractionV3.InteractionStandByActortStaticInfo
// 0x0060 (0x0060 - 0x0000)
struct FInteractionStandByActortStaticInfo final
{
public:
	class FName                                   ScenarioName;                                      // 0x0000(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   StateName;                                         // 0x0008(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSet<class FName>                             ActorNames;                                        // 0x0010(0x0050)(Edit, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FInteractionStandByActortStaticInfo;

// ScriptStruct CharacterInteractionV3.InteractionActorNames
// 0x0050 (0x0050 - 0x0000)
struct FInteractionActorNames final
{
public:
	TSet<class FName>                             ActorNames;                                        // 0x0000(0x0050)(Edit, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FInteractionActorNames;

// ScriptStruct CharacterInteractionV3.InteractionActorShowElementStaticInfo
// 0x0030 (0x0030 - 0x0000)
struct FInteractionActorShowElementStaticInfo final
{
public:
	class FName                                   ActorName;                                         // 0x0000(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UShowElementV3>          ShowElement;                                       // 0x0008(0x0028)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FInteractionActorShowElementStaticInfo;

// ScriptStruct CharacterInteractionV3.InteractionScenarioShowElementStaticInfo
// 0x0010 (0x0010 - 0x0000)
struct FInteractionScenarioShowElementStaticInfo final
{
public:
	TArray<struct FInteractionActorShowElementStaticInfo> ShowElementInfos;                          // 0x0000(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FInteractionScenarioShowElementStaticInfo;

// ScriptStruct CharacterInteractionV3.InteractionActorStaticInfo
// 0x0028 (0x0028 - 0x0000)
struct FInteractionActorStaticInfo final
{
public:
	TSoftClassPtr<class UClass>                   ActorClassRef;                                     // 0x0000(0x0028)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FInteractionActorStaticInfo;

// ScriptStruct CharacterInteractionV3.PerformerRuntimeSupport
// 0x0050 (0x0050 - 0x0000)
struct FPerformerRuntimeSupport final
{
public:
	TMap<class FName, TSoftObjectPtr<class UShowElementV3>> ShowElementsRefMap;                      // 0x0000(0x0050)(Edit, DisableEditOnInstance, UObjectWrapper, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FPerformerRuntimeSupport;

// ScriptStruct CharacterInteractionV3.RuleStringConfig
// 0x0010 (0x0018 - 0x0008)
struct FRuleStringConfig final : public FTableRowBase
{
public:
	class FName                                   RuleStringName;                                    // 0x0008(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   RuleStringContent;                                 // 0x0010(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FRuleStringConfig;

// ScriptStruct CharacterInteractionV3.InteractionV3BlendSpaceData
// 0x0020 (0x0020 - 0x0000)
struct FInteractionV3BlendSpaceData final
{
public:
	EInteractionV3BlendSpaceSlot                  SlotType;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Rei-SdkDumper ])
	class UBlendSpace*                            BlendSpace;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              BlendSpaceValue;                                   // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BlendRatio;                                        // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_FInteractionV3BlendSpaceData;

// ScriptStruct CharacterInteractionV3.IKMaintainRefPose
// 0x0014 (0x0014 - 0x0000)
struct FIKMaintainRefPose final
{
public:
	class FName                                   BoneName;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                JointOffset;                                       // 0x0008(0x000C)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FIKMaintainRefPose;

// ScriptStruct CharacterInteractionV3.IKMaintainRefPoseRelative
// 0x0010 (0x0010 - 0x0000)
struct FIKMaintainRefPoseRelative final
{
public:
	class FName                                   BoneName;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   RefBoneName;                                       // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FIKMaintainRefPoseRelative;

// ScriptStruct CharacterInteractionV3.WorldSpaceIKTarget
// 0x0050 (0x0050 - 0x0000)
struct FWorldSpaceIKTarget final
{
public:
	class FName                                   BoneName;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Size After Last Property [ Rei-SdkDumper ])
	struct FTransform                             TargetTransform;                                   // 0x0010(0x0030)(BlueprintVisible, BlueprintReadOnly, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector                                JointOffset;                                       // 0x0040(0x000C)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RecoverValue;                                      // 0x004C(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FWorldSpaceIKTarget;

// ScriptStruct CharacterInteractionV3.IKWorldSpaceEffectorAccumulate
// 0x0060 (0x0060 - 0x0000)
struct FIKWorldSpaceEffectorAccumulate final
{
public:
	class FName                                   BoneName;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                JointOffset;                                       // 0x0008(0x000C)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0xC];                                       // 0x0014(0x000C)(Fixing Size After Last Property [ Rei-SdkDumper ])
	struct FTransform                             AccumulateEffectorTransform;                       // 0x0020(0x0030)(BlueprintVisible, BlueprintReadOnly, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bMaintainCSPoseRotation;                           // 0x0050(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_51[0xF];                                       // 0x0051(0x000F)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_FIKWorldSpaceEffectorAccumulate;

// ScriptStruct CharacterInteractionV3.IKWorldSpaceJointAccumulate
// 0x0040 (0x0040 - 0x0000)
struct FIKWorldSpaceJointAccumulate final
{
public:
	class FName                                   BoneName;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Size After Last Property [ Rei-SdkDumper ])
	struct FTransform                             AccumulateJointTransform;                          // 0x0010(0x0030)(BlueprintVisible, BlueprintReadOnly, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FIKWorldSpaceJointAccumulate;

// ScriptStruct CharacterInteractionV3.InteractionV3IKData
// 0x0190 (0x0190 - 0x0000)
struct FInteractionV3IKData final
{
public:
	TMap<class FName, struct FIKMaintainRefPose>  MaintainRefPoses;                                  // 0x0000(0x0050)(Transient, NativeAccessSpecifierPublic)
	TMap<class FName, struct FIKMaintainRefPoseRelative> MaintainRefPoseRelatives;                   // 0x0050(0x0050)(Transient, NativeAccessSpecifierPublic)
	TMap<class FName, struct FWorldSpaceIKTarget> WorldSpaceIKTargets;                               // 0x00A0(0x0050)(Transient, NativeAccessSpecifierPublic)
	TMap<class FName, struct FIKWorldSpaceEffectorAccumulate> WorldSpaceEffectorAccumulates;         // 0x00F0(0x0050)(Transient, NativeAccessSpecifierPublic)
	TMap<class FName, struct FIKWorldSpaceJointAccumulate> WorldSpaceJointAccumulates;               // 0x0140(0x0050)(Transient, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FInteractionV3IKData;

// ScriptStruct CharacterInteractionV3.InteractionV3AnimInstanceProxy
// 0x0060 (0x07C0 - 0x0760)
struct FInteractionV3AnimInstanceProxy final : public FAnimInstanceProxy
{
public:
	TArray<struct FInteractionV3BlendSpaceData>   BlendSpaceDatas;                                   // 0x0760(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPublic)
	TMap<EInteractionV3IKSlot, struct FInteractionV3IKData> IKDatas;                                 // 0x0770(0x0050)(Transient, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FInteractionV3AnimInstanceProxy;

// ScriptStruct CharacterInteractionV3.PhysicsControlRigidBodyRelativeControlTickFunction
// 0x0008 (0x0030 - 0x0028)
struct FPhysicsControlRigidBodyRelativeControlTickFunction final : public FTickFunction
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_FPhysicsControlRigidBodyRelativeControlTickFunction;

// ScriptStruct CharacterInteractionV3.RigidBodyRelativeControlRecord
// 0x0028 (0x0028 - 0x0000)
struct FRigidBodyRelativeControlRecord final
{
public:
	class FName                                   ControlName;                                       // 0x0000(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TWeakObjectPtr<class UMeshComponent>          ParentMeshComponent;                               // 0x0008(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   ParentBoneName;                                    // 0x0010(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TWeakObjectPtr<class UMeshComponent>          ChildMeshComponent;                                // 0x0018(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   ChildBoneName;                                     // 0x0020(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FRigidBodyRelativeControlRecord;

// ScriptStruct CharacterInteractionV3.StandbyCameraConfig
// 0x00E8 (0x00F0 - 0x0008)
struct FStandbyCameraConfig final : public FTableRowBase
{
public:
	class FName                                   ID;                                                // 0x0008(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EInteractionV3StandbyCameraType               CameraType;                                        // 0x0010(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Rei-SdkDumper ])
	struct FVector2D                              Direction;                                         // 0x0014(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              PitchRange;                                        // 0x001C(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              YawRange;                                          // 0x0024(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FocalDistance;                                     // 0x002C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftObjectPath                        CurveFocalDistance_Pitch;                          // 0x0030(0x0018)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftObjectPath                        CurveFocalDistance_Yaw;                            // 0x0048(0x0018)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EInteractionV3CameraMoveType                  PitchMoveType;                                     // 0x0060(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Rei-SdkDumper ])
	struct FSoftObjectPath                        CurveDampingPitch;                                 // 0x0068(0x0018)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftObjectPath                        CurveDampingYaw;                                   // 0x0080(0x0018)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftObjectPath                        CurveScreenInputPitch;                             // 0x0098(0x0018)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftObjectPath                        CurveScreenInputYaw;                               // 0x00B0(0x0018)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          EnableCameraLag;                                   // 0x00C8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C9[0x3];                                       // 0x00C9(0x0003)(Fixing Size After Last Property [ Rei-SdkDumper ])
	float                                         CameraLagRotateSpeed;                              // 0x00CC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CameraLagTranslateSpeed;                           // 0x00D0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         CanOpreateCameraState;                             // 0x00D4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          EnableCameraTranslat;                              // 0x00D8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D9[0x3];                                       // 0x00D9(0x0003)(Fixing Size After Last Property [ Rei-SdkDumper ])
	struct FVector2D                              CameraTranslateH;                                  // 0x00DC(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              CameraTranslateV;                                  // 0x00E4(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_EC[0x4];                                       // 0x00EC(0x0004)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_FStandbyCameraConfig;

// ScriptStruct CharacterInteractionV3.PhysicsProfileModifier
// 0x0020 (0x0020 - 0x0000)
struct FPhysicsProfileModifier final
{
public:
	class FName                                   StartPhysicsControlProfile;                        // 0x0000(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   EndPhysicsControlProfile;                          // 0x0008(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   StartConstraintProfile;                            // 0x0010(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   EndConstraintProfile;                              // 0x0018(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FPhysicsProfileModifier;

// ScriptStruct CharacterInteractionV3.InteractionV3PhysProfileModifier
// 0x0060 (0x0060 - 0x0000)
struct FInteractionV3PhysProfileModifier final
{
public:
	struct FPhysicsProfileModifier                BodyProfile;                                       // 0x0000(0x0020)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FPhysicsProfileModifier                BodyAnimNodeProfile;                               // 0x0020(0x0020)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FPhysicsProfileModifier                FaceProfile;                                       // 0x0040(0x0020)(Edit, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FInteractionV3PhysProfileModifier;

// ScriptStruct CharacterInteractionV3.IKWorldSpaceEffectorAccumulateConfig
// 0x0028 (0x0028 - 0x0000)
struct FIKWorldSpaceEffectorAccumulateConfig final
{
public:
	EInteractionV3IKSlot                          SlotType;                                          // 0x0000(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Rei-SdkDumper ])
	class FName                                   BoneName;                                          // 0x0004(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                JointOffset;                                       // 0x000C(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                EffectorOffsetScale;                               // 0x0018(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bMaintainCSPoseRotation;                           // 0x0024(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_FIKWorldSpaceEffectorAccumulateConfig;

// ScriptStruct CharacterInteractionV3.IKWorldSpaceJointAccumulateConfig
// 0x000C (0x000C - 0x0000)
struct FIKWorldSpaceJointAccumulateConfig final
{
public:
	EInteractionV3IKSlot                          SlotType;                                          // 0x0000(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Rei-SdkDumper ])
	class FName                                   BoneName;                                          // 0x0004(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FIKWorldSpaceJointAccumulateConfig;

// ScriptStruct CharacterInteractionV3.IKWorldSpaceOffsetData
// 0x0020 (0x0020 - 0x0000)
struct FIKWorldSpaceOffsetData final
{
public:
	TArray<struct FIKWorldSpaceEffectorAccumulateConfig> EffectorOffsetConfigs;                      // 0x0000(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FIKWorldSpaceJointAccumulateConfig> JointOffsetConfigs;                            // 0x0010(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FIKWorldSpaceOffsetData;

// ScriptStruct CharacterInteractionV3.WorldSpaceIKTargetBoneConfig
// 0x0050 (0x0050 - 0x0000)
struct alignas(0x10) FWorldSpaceIKTargetBoneConfig final
{
public:
	EInteractionV3IKSlot                          SlotType;                                          // 0x0000(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Rei-SdkDumper ])
	class FName                                   BoneName;                                          // 0x0004(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                JointOffset;                                       // 0x000C(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_18[0x38];                                      // 0x0018(0x0038)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_FWorldSpaceIKTargetBoneConfig;

// ScriptStruct CharacterInteractionV3.WorldSpaceIKTargetConfig
// 0x0020 (0x0020 - 0x0000)
struct FWorldSpaceIKTargetConfig final
{
public:
	class FName                                   ParentActorName;                                   // 0x0000(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   ParentBoneName;                                    // 0x0008(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FWorldSpaceIKTargetBoneConfig>  BoneConfigs;                                       // 0x0010(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FWorldSpaceIKTargetConfig;

// ScriptStruct CharacterInteractionV3.IKMaintainWorldSpaceRelativeData
// 0x0010 (0x0010 - 0x0000)
struct FIKMaintainWorldSpaceRelativeData final
{
public:
	TArray<struct FWorldSpaceIKTargetConfig>      Configs;                                           // 0x0000(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FIKMaintainWorldSpaceRelativeData;

// ScriptStruct CharacterInteractionV3.IKMaintainRefPoseConfig
// 0x0018 (0x0018 - 0x0000)
struct FIKMaintainRefPoseConfig final
{
public:
	EInteractionV3IKSlot                          SlotType;                                          // 0x0000(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Rei-SdkDumper ])
	class FName                                   BoneName;                                          // 0x0004(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                JointOffset;                                       // 0x000C(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FIKMaintainRefPoseConfig;

// ScriptStruct CharacterInteractionV3.IKMaintainRefPoseRelativeConfig
// 0x0014 (0x0014 - 0x0000)
struct FIKMaintainRefPoseRelativeConfig final
{
public:
	EInteractionV3IKSlot                          SlotType;                                          // 0x0000(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Rei-SdkDumper ])
	class FName                                   BoneName;                                          // 0x0004(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   RefBoneName;                                       // 0x000C(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FIKMaintainRefPoseRelativeConfig;

// ScriptStruct CharacterInteractionV3.IKRefPoseFixData
// 0x0020 (0x0020 - 0x0000)
struct FIKRefPoseFixData final
{
public:
	TArray<struct FIKMaintainRefPoseConfig>       MaintainRefPoseConfigs;                            // 0x0000(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FIKMaintainRefPoseRelativeConfig> MaintainRefPoseRelativeConfigs;                  // 0x0010(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FIKRefPoseFixData;

// ScriptStruct CharacterInteractionV3.ActorOperateActTemplate
// 0x0068 (0x0070 - 0x0008)
