#pragma once

/*
* SDK generated by Rei-SdkDumper
* Based on Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CharacterInteractionV3

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "DeveloperSettings_classes.hpp"
#include "CharacterInteractionV3_structs.hpp"
#include "PhysicsControl_classes.hpp"
#include "CameraBlueprint_classes.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "SeasunAnimGraph_structs.hpp"


namespace SDK
{

// Class CharacterInteractionV3.InteractionV3PhysHandleComponent
// 0x0000 (0x0160 - 0x0160)
class UInteractionV3PhysHandleComponent final : public UPhysicsHandleComponent
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("InteractionV3PhysHandleComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"InteractionV3PhysHandleComponent")
	}
	static class UInteractionV3PhysHandleComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInteractionV3PhysHandleComponent>();
	}
};
DUMPER7_ASSERTS_UInteractionV3PhysHandleComponent;

// Class CharacterInteractionV3.ActorOperateAct
// 0x0118 (0x0140 - 0x0028)
class UActorOperateAct : public UObject
{
public:
	struct FInteractionVoiceConfig                VoiceConfig;                                       // 0x0028(0x0048)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	struct FInteractionV3OperateWwise             OperateWwiseData;                                  // 0x0070(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	class FString                                 ActorOperateActName;                               // 0x0080(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UAnimSequence>           FacialAnim;                                        // 0x0090(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector2D                              BlendInAndOut;                                     // 0x00B8(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UAnimMontage*                           FacialAnimMontage;                                 // 0x00C0(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bIsBlush;                                          // 0x00C8(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bForceEyeLookAtCamera;                             // 0x00C9(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_CA[0x2];                                       // 0x00CA(0x0002)(Fixing Size After Last Property [ Rei-SdkDumper ])
	struct FVector2D                              EyesLookAtPosition;                                // 0x00CC(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FInteractionV3PhysProfileModifier      ProfileModifier;                                   // 0x00D4(0x0060)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, Protected, NativeAccessSpecifierProtected)
	bool                                          bPhysicsBlendOut;                                  // 0x0134(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bAllPerformerPhysicsBlendOut;                      // 0x0135(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bOverrideKawaiiBlendOut;                           // 0x0136(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_137[0x1];                                      // 0x0137(0x0001)(Fixing Size After Last Property [ Rei-SdkDumper ])
	class UCurveFloat*                            OverrideDisableKawaiiBlendCurve;                   // 0x0138(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void OnPause(class AInteractionSkeletalActorV3* Actor);
	void OnRestart(class AInteractionSkeletalActorV3* Actor);
	void OnResume(class AInteractionSkeletalActorV3* Actor);
	void OnStart(class AInteractionSkeletalActorV3* Actor);
	void OnStartBlendOut(class AInteractionSkeletalActorV3* Actor);
	void OnStop(class AInteractionSkeletalActorV3* Actor);
	void OnUpdate(class UInteractionV3InputControl* InputControl, class AInteractionSkeletalActorV3* Actor, float DeltaSeconds);
	void ProcessStartAct(class AInteractionSkeletalActorV3* Actor);

	class UInteractionV3InputControl* GetInputControl() const;
	class UScenarioOperate* GetScenarioOperate() const;
	bool IsCompleteAndBlendOut() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ActorOperateAct")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ActorOperateAct")
	}
	static class UActorOperateAct* GetDefaultObj()
	{
		return GetDefaultObjImpl<UActorOperateAct>();
	}
};
DUMPER7_ASSERTS_UActorOperateAct;

// Class CharacterInteractionV3.BlendSpaceOperateAct
// 0x0030 (0x0170 - 0x0140)
class UBlendSpaceOperateAct final : public UActorOperateAct
{
public:
	TSoftObjectPtr<class UBlendSpace>             BlendSpace;                                        // 0x0140(0x0028)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EInteractionV3BlendSpaceSlot                  SlotType;                                          // 0x0168(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_169[0x7];                                      // 0x0169(0x0007)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BlendSpaceOperateAct")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BlendSpaceOperateAct")
	}
	static class UBlendSpaceOperateAct* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBlendSpaceOperateAct>();
	}
};
DUMPER7_ASSERTS_UBlendSpaceOperateAct;

// Class CharacterInteractionV3.InteractionV3Event
// 0x0000 (0x0028 - 0x0028)
class UInteractionV3Event : public UObject
{
public:
	void DoAction();

	bool CanTrigger() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("InteractionV3Event")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"InteractionV3Event")
	}
	static class UInteractionV3Event* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInteractionV3Event>();
	}
};
DUMPER7_ASSERTS_UInteractionV3Event;

// Class CharacterInteractionV3.InteractionV3Event_EasterEgg
// 0x0000 (0x0028 - 0x0028)
class UInteractionV3Event_EasterEgg final : public UInteractionV3Event
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("InteractionV3Event_EasterEgg")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"InteractionV3Event_EasterEgg")
	}
	static class UInteractionV3Event_EasterEgg* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInteractionV3Event_EasterEgg>();
	}
};
DUMPER7_ASSERTS_UInteractionV3Event_EasterEgg;

// Class CharacterInteractionV3.SequenceEvaluatorOperateAct
// 0x0078 (0x01B8 - 0x0140)
class USequenceEvaluatorOperateAct final : public UActorOperateAct
{
public:
	TSoftObjectPtr<class UAnimSequence>           InteractionAnim;                                   // 0x0140(0x0028)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UAnimSequence>           BreathAdditiveAnim;                                // 0x0168(0x0028)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bControlFacialAnim;                                // 0x0190(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_191[0x7];                                      // 0x0191(0x0007)(Fixing Size After Last Property [ Rei-SdkDumper ])
	class UAnimMontage*                           InteractionMontage;                                // 0x0198(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UAnimMontage*                           BreathAdditiveMontage;                             // 0x01A0(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<struct FAnimNotifyEvent>               ActiveFacialAnimNotifyState;                       // 0x01A8(0x0010)(ZeroConstructor, Transient, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SequenceEvaluatorOperateAct")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SequenceEvaluatorOperateAct")
	}
	static class USequenceEvaluatorOperateAct* GetDefaultObj()
	{
		return GetDefaultObjImpl<USequenceEvaluatorOperateAct>();
	}
};
DUMPER7_ASSERTS_USequenceEvaluatorOperateAct;

// Class CharacterInteractionV3.AdditiveSequenceEvaluatorOperateAct
// 0x0030 (0x0170 - 0x0140)
class UAdditiveSequenceEvaluatorOperateAct final : public UActorOperateAct
{
public:
	TSoftObjectPtr<class UAnimSequence>           BreathAdditiveAnim;                                // 0x0140(0x0028)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimMontage*                           BreathAdditiveMontage;                             // 0x0168(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AdditiveSequenceEvaluatorOperateAct")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AdditiveSequenceEvaluatorOperateAct")
	}
	static class UAdditiveSequenceEvaluatorOperateAct* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAdditiveSequenceEvaluatorOperateAct>();
	}
};
DUMPER7_ASSERTS_UAdditiveSequenceEvaluatorOperateAct;

// Class CharacterInteractionV3.InteractionV3PhysicsControlComponent
// 0x0050 (0x0520 - 0x04D0)
class UInteractionV3PhysicsControlComponent final : public UBaseGamePhysicsControlComponent
{
public:
	uint8                                         Pad_4D0[0x28];                                     // 0x04D0(0x0028)(Fixing Size After Last Property [ Rei-SdkDumper ])
	TArray<class FName>                           MaintainWorldSpaceRelativeControlNames;            // 0x04F8(0x0010)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
	TArray<struct FRigidBodyRelativeControlRecord> RigidBodyRelativeControls;                        // 0x0508(0x0010)(ZeroConstructor, Transient, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_518[0x8];                                      // 0x0518(0x0008)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])

public:
	bool ConditionalCreateMaintainWorldSpaceRelativeControl(class FName Name_0, class UMeshComponent* ParentMeshComponent, const class FName ParentBoneName, class UMeshComponent* ChildMeshComponent, const class FName ChildBoneName, const class FName Set, const class FName AdditionalSetName);
	bool ConditionalDestroyAllMaintainWorldSpaceRelativeControls();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("InteractionV3PhysicsControlComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"InteractionV3PhysicsControlComponent")
	}
	static class UInteractionV3PhysicsControlComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInteractionV3PhysicsControlComponent>();
	}
};
DUMPER7_ASSERTS_UInteractionV3PhysicsControlComponent;

// Class CharacterInteractionV3.LoopSequenceOperateAct
// 0x0038 (0x0178 - 0x0140)
class ULoopSequenceOperateAct final : public UActorOperateAct
{
public:
	TSoftObjectPtr<class UAnimSequence>           InteractionAnim;                                   // 0x0140(0x0028)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         StartLoopTime;                                     // 0x0168(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         EndLoopTime;                                       // 0x016C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimMontage*                           InteractionMontage;                                // 0x0170(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("LoopSequenceOperateAct")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"LoopSequenceOperateAct")
	}
	static class ULoopSequenceOperateAct* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULoopSequenceOperateAct>();
	}
};
DUMPER7_ASSERTS_ULoopSequenceOperateAct;

// Class CharacterInteractionV3.IKRefPoseFixOperateAct
// 0x0020 (0x0160 - 0x0140)
class UIKRefPoseFixOperateAct : public UActorOperateAct
{
public:
	struct FIKRefPoseFixData                      RefPoseFixData;                                    // 0x0140(0x0020)(Edit, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("IKRefPoseFixOperateAct")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"IKRefPoseFixOperateAct")
	}
	static class UIKRefPoseFixOperateAct* GetDefaultObj()
	{
		return GetDefaultObjImpl<UIKRefPoseFixOperateAct>();
	}
};
DUMPER7_ASSERTS_UIKRefPoseFixOperateAct;

// Class CharacterInteractionV3.HeadModifyOperateAct
// 0x0058 (0x01B8 - 0x0160)
class UHeadModifyOperateAct final : public UIKRefPoseFixOperateAct
{
public:
	bool                                          UseYawChange;                                      // 0x0160(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_161[0x7];                                      // 0x0161(0x0007)(Fixing Size After Last Property [ Rei-SdkDumper ])
	struct FRuntimeSpineWeight                    RuntimeSpineDatas;                                 // 0x0168(0x0050)(Edit, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("HeadModifyOperateAct")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"HeadModifyOperateAct")
	}
	static class UHeadModifyOperateAct* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHeadModifyOperateAct>();
	}
};
DUMPER7_ASSERTS_UHeadModifyOperateAct;

// Class CharacterInteractionV3.IKMaintainWorldSpaceRelativeOperateAct
// 0x0010 (0x0170 - 0x0160)
class UIKMaintainWorldSpaceRelativeOperateAct final : public UIKRefPoseFixOperateAct
{
public:
	struct FIKMaintainWorldSpaceRelativeData      MaintainRelativeData;                              // 0x0160(0x0010)(Edit, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("IKMaintainWorldSpaceRelativeOperateAct")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"IKMaintainWorldSpaceRelativeOperateAct")
	}
	static class UIKMaintainWorldSpaceRelativeOperateAct* GetDefaultObj()
	{
		return GetDefaultObjImpl<UIKMaintainWorldSpaceRelativeOperateAct>();
	}
};
DUMPER7_ASSERTS_UIKMaintainWorldSpaceRelativeOperateAct;

// Class CharacterInteractionV3.DestroyPhysicsControlEvent
// 0x0020 (0x0048 - 0x0028)
class UDestroyPhysicsControlEvent final : public UInteractionV3Event
{
public:
	class FName                                   ControlName;                                       // 0x0028(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   SetName;                                           // 0x0030(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   ActorName;                                         // 0x0038(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsBody;                                           // 0x0040(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DestroyPhysicsControlEvent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DestroyPhysicsControlEvent")
	}
	static class UDestroyPhysicsControlEvent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDestroyPhysicsControlEvent>();
	}
};
DUMPER7_ASSERTS_UDestroyPhysicsControlEvent;

// Class CharacterInteractionV3.IKWorldSpaceOffsetOperateAct
// 0x0020 (0x0180 - 0x0160)
class UIKWorldSpaceOffsetOperateAct final : public UIKRefPoseFixOperateAct
{
public:
	struct FIKWorldSpaceOffsetData                WorldSpaceOffsetData;                              // 0x0160(0x0020)(Edit, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("IKWorldSpaceOffsetOperateAct")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"IKWorldSpaceOffsetOperateAct")
	}
	static class UIKWorldSpaceOffsetOperateAct* GetDefaultObj()
	{
		return GetDefaultObjImpl<UIKWorldSpaceOffsetOperateAct>();
	}
};
DUMPER7_ASSERTS_UIKWorldSpaceOffsetOperateAct;

// Class CharacterInteractionV3.EyesFollowOperateAct
// 0x0010 (0x0150 - 0x0140)
class UEyesFollowOperateAct final : public UActorOperateAct
{
public:
	struct FVector2D                              HeadRotationScale;                                 // 0x0140(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bInterpHead;                                       // 0x0148(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_149[0x3];                                      // 0x0149(0x0003)(Fixing Size After Last Property [ Rei-SdkDumper ])
	float                                         HeadInterpSpeed;                                   // 0x014C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("EyesFollowOperateAct")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"EyesFollowOperateAct")
	}
	static class UEyesFollowOperateAct* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEyesFollowOperateAct>();
	}
};
DUMPER7_ASSERTS_UEyesFollowOperateAct;

// Class CharacterInteractionV3.PhysicalOffsetOperateAct
// 0x0048 (0x0188 - 0x0140)
class UPhysicalOffsetOperateAct final : public UActorOperateAct
{
public:
	bool                                          bDragFixedBone;                                    // 0x0140(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_141[0x3];                                      // 0x0141(0x0003)(Fixing Size After Last Property [ Rei-SdkDumper ])
	class FName                                   DefaultDragBoneName;                               // 0x0144(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                   DefaultDragLocationBoneName;                       // 0x014C(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                                DragScale;                                         // 0x0154(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                                DragStartLocation;                                 // 0x0160(0x000C)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                   CurDragBone;                                       // 0x016C(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bUseAnimNodePhysicsControl;                        // 0x0174(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_175[0x3];                                      // 0x0175(0x0003)(Fixing Size After Last Property [ Rei-SdkDumper ])
	float                                         LinearStiffness;                                   // 0x0178(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         LinearDamping;                                     // 0x017C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         AngularStiffness;                                  // 0x0180(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         AngularDamping;                                    // 0x0184(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PhysicalOffsetOperateAct")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PhysicalOffsetOperateAct")
	}
	static class UPhysicalOffsetOperateAct* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPhysicalOffsetOperateAct>();
	}
};
DUMPER7_ASSERTS_UPhysicalOffsetOperateAct;

// Class CharacterInteractionV3.InteractionCameraInstanceBase
// 0x0020 (0x03C0 - 0x03A0)
#pragma pack(push, 0x1)
class alignas(0x10) UInteractionCameraInstanceBase : public UCameraInstance
{
public:
	bool                                          bActiveBlendOut;                                   // 0x03A0(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bForceBlendOut;                                    // 0x03A1(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bLockBlendOutChange;                               // 0x03A2(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_3A3[0x1];                                      // 0x03A3(0x0001)(Fixing Size After Last Property [ Rei-SdkDumper ])
	struct FViewTargetTransitionParams            CameraTransitionParams;                            // 0x03A4(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_3B4[0x4];                                      // 0x03B4(0x0004)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("InteractionCameraInstanceBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"InteractionCameraInstanceBase")
	}
	static class UInteractionCameraInstanceBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInteractionCameraInstanceBase>();
	}
};
#pragma pack(pop)
DUMPER7_ASSERTS_UInteractionCameraInstanceBase;

// Class CharacterInteractionV3.InteractionMouseHoverInterface
// 0x0000 (0x0000 - 0x0000)
class IInteractionMouseHoverInterface final
{
public:
	void OnMouseHover(const TArray<class FName>& BoneNames, const class UCurveFloat* CurveScale, const struct FVector2D& SlideVector, const struct FVector2D& SlideStartPos, const struct FVector2D& SlidEndPos);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("InteractionMouseHoverInterface")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"InteractionMouseHoverInterface")
	}
	static class IInteractionMouseHoverInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IInteractionMouseHoverInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IInteractionMouseHoverInterface;

// Class CharacterInteractionV3.MouseHoverOperateAct
// 0x0020 (0x0160 - 0x0140)
class UMouseHoverOperateAct final : public UActorOperateAct
{
public:
	TArray<class FName>                           BoneNames;                                         // 0x0140(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	class UCurveFloat*                            CurveTorqueScale;                                  // 0x0150(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         SampleInterval;                                    // 0x0158(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_15C[0x4];                                      // 0x015C(0x0004)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MouseHoverOperateAct")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MouseHoverOperateAct")
	}
	static class UMouseHoverOperateAct* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMouseHoverOperateAct>();
	}
};
DUMPER7_ASSERTS_UMouseHoverOperateAct;

// Class CharacterInteractionV3.ScenarioLittleGameBase
// 0x0008 (0x0030 - 0x0028)
class UScenarioLittleGameBase : public UObject
{
public:
	bool                                          bInitialize;                                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])

public:
	void Exit();
	void Initialize();
	void OnExit();
	void OnInitialize();
	void OnStart();
	void OnUpdate(float DeltaSeconds);
	void Start();
	void Update(float DeltaSeconds);

	class UInteractionInputComponent* GetInteractionInputComponent() const;
	class UScenarioStateNode_LittleGame* GetStateNode() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ScenarioLittleGameBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ScenarioLittleGameBase")
	}
	static class UScenarioLittleGameBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UScenarioLittleGameBase>();
	}
};
DUMPER7_ASSERTS_UScenarioLittleGameBase;

// Class CharacterInteractionV3.ScenarioStandardLittleGame
// 0x0038 (0x0068 - 0x0030)
class UScenarioStandardLittleGame : public UScenarioLittleGameBase
{
public:
	TSoftClassPtr<class UClass>                   LittleGameWidget;                                  // 0x0030(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EScenarioLittleGameUIState                    UIState;                                           // 0x0058(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Rei-SdkDumper ])
	class AUniversalCameraActor*                  UniversalCharacter;                                // 0x0060(0x0008)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	void GameInput(const struct FLittleGameInputEvent& InputEvent);
	void MouseClick(const struct FLittleGameInputEvent& InputEvent);
	void MousePress(const struct FLittleGameInputEvent& InputEvent);
	void MouseRelease(const struct FLittleGameInputEvent& InputEvent);
	void OnGameInput(const struct FLittleGameInputEvent& InputEvent);
	void OnInitCameraSequenceFinished();
	void OnLookAround(float InValue);
	void OnLookUp(float InValue);
	void OnMouseClick(const struct FLittleGameInputEvent& InputEvent);
	void OnMousePress(const struct FLittleGameInputEvent& InputEvent);
	void OnMouseRelease(const struct FLittleGameInputEvent& InputEvent);
	void OnMoveForward(float InValue);
	void OnMoveRight(float InValue);
	void PlayShowElement(const class FString& ElementName, const class FString& NextState, bool bEndLastShowElement);
	void PlayShowElementList(const TArray<class FString>& InElements, const class FString& NextState, bool bEndLastShowElement);
	void SetUIState(EScenarioLittleGameUIState NewState);

	void DisableInput() const;
	void EnableInput() const;
	struct FSoftClassPath GetCustomGameUI() const;
	struct FVector2D GetMousePos() const;
	EScenarioLittleGameUIState GetUIState() const;
	bool IsBlockInput() const;
	bool IsCustomGameUI() const;
	int32 ListenForInputAction(class FName ActionName, EInputEvent EventType, bool bConsume, TDelegate<void()> Callback) const;
	void ListenForKeyAction(const struct FKey& InKey, EInputEvent EventType, bool bConsume, TDelegate<void()> Callback) const;
	void PlayShowElementByCallback(const class FString& ElementName, const class FString& NextState, TDelegate<void()> ShowElementPlayFinish, bool bEndLastShowElement) const;
	void PlayShowElementListByCallback(const TArray<class FString>& InElements, const class FString& NextState, TDelegate<void()> ShowElementPlayFinish, bool bEndLastShowElement) const;
	void SetInputModeGameAndUI(EMouseLockMode MouseLockMode) const;
	void SetInputModeGameOnly() const;
	void SetInputModeUIOnly() const;
	void StopAllListenForKeyAction() const;
	void StopAllListeningForHandle() const;
	void StopListenForKeyAction(const struct FKey& InKey, EInputEvent EventType) const;
	void StopListeningForHandle(int32 InHandle) const;
	void StopListeningForInputAction(class FName ActionName, EInputEvent EventType) const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ScenarioStandardLittleGame")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ScenarioStandardLittleGame")
	}
	static class UScenarioStandardLittleGame* GetDefaultObj()
	{
		return GetDefaultObjImpl<UScenarioStandardLittleGame>();
	}
};
DUMPER7_ASSERTS_UScenarioStandardLittleGame;

// Class CharacterInteractionV3.FennyGunFireLittleGame
// 0x0018 (0x0080 - 0x0068)
class UFennyGunFireLittleGame final : public UScenarioStandardLittleGame
{
public:
	TArray<struct FFennyVoiceTipCfg>              VoiceTipCfgs;                                      // 0x0068(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	struct FVector2D                              FirstRoundDelayTime;                               // 0x0078(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	const struct FFennyVoiceTipCfg GetVoiceTipCfg(int32 InId);
	int32 RandomVoice();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FennyGunFireLittleGame")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FennyGunFireLittleGame")
	}
	static class UFennyGunFireLittleGame* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFennyGunFireLittleGame>();
	}
};
DUMPER7_ASSERTS_UFennyGunFireLittleGame;

// Class CharacterInteractionV3.InteractionV3DragInterface
// 0x0000 (0x0000 - 0x0000)
class IInteractionV3DragInterface final
{
public:
	void EndDrag(const struct FTransform& TargetTransform, const struct FVector& DeltaLocation);
	void StartDrag(const struct FTransform& TargetTransform, const struct FVector& DeltaLocation);
	void UpdateDrag(const struct FTransform& TargetTransform, const struct FVector& DeltaLocation);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("InteractionV3DragInterface")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"InteractionV3DragInterface")
	}
	static class IInteractionV3DragInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IInteractionV3DragInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IInteractionV3DragInterface;

// Class CharacterInteractionV3.DragPropWorldSpaceOffsetOperateAct
// 0x0070 (0x01B0 - 0x0140)
class UDragPropWorldSpaceOffsetOperateAct final : public UActorOperateAct
{
public:
	bool                                          bSpringInterp;                                     // 0x0140(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_141[0x3];                                      // 0x0141(0x0003)(Fixing Size After Last Property [ Rei-SdkDumper ])
	float                                         ErrorTolerance;                                    // 0x0144(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Stiffness;                                         // 0x0148(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CriticalDamping;                                   // 0x014C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   DragSocketName;                                    // 0x0150(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                DragLocation;                                      // 0x0158(0x000C)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                                DeltaLocation;                                     // 0x0164(0x000C)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                                TargetLocation;                                    // 0x0170(0x000C)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                                PreTargetLocation;                                 // 0x017C(0x000C)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                                InterpTarget;                                      // 0x0188(0x000C)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         DragDistance;                                      // 0x0194(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVectorSpringState                     SpringState;                                       // 0x0198(0x0018)(NoDestructor, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DragPropWorldSpaceOffsetOperateAct")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DragPropWorldSpaceOffsetOperateAct")
	}
	static class UDragPropWorldSpaceOffsetOperateAct* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDragPropWorldSpaceOffsetOperateAct>();
	}
};
DUMPER7_ASSERTS_UDragPropWorldSpaceOffsetOperateAct;

// Class CharacterInteractionV3.AnimNotifyState_SubtitleStatus
// 0x0010 (0x0040 - 0x0030)
class UAnimNotifyState_SubtitleStatus final : public UAnimNotifyState
{
public:
	class FString                                 SubtitleKey;                                       // 0x0030(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AnimNotifyState_SubtitleStatus")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AnimNotifyState_SubtitleStatus")
	}
	static class UAnimNotifyState_SubtitleStatus* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAnimNotifyState_SubtitleStatus>();
	}
};
DUMPER7_ASSERTS_UAnimNotifyState_SubtitleStatus;

// Class CharacterInteractionV3.ShowElementV3Unit
// 0x0008 (0x0030 - 0x0028)
class UShowElementV3Unit : public UObject
{
public:
	TSubclassOf<class UShowElementV3UnitPlayer>   PlayerType;                                        // 0x0028(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ShowElementV3Unit")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ShowElementV3Unit")
	}
	static class UShowElementV3Unit* GetDefaultObj()
	{
		return GetDefaultObjImpl<UShowElementV3Unit>();
	}
};
DUMPER7_ASSERTS_UShowElementV3Unit;

// Class CharacterInteractionV3.InteractionArchivementComponentV3
// 0x0040 (0x00F0 - 0x00B0)
class UInteractionArchivementComponentV3 final : public UActorComponent
{
public:
	TArray<struct FInteractionArchivementInfoV3>  Archivements;                                      // 0x00B0(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	TArray<int32>                                 CompleteConditions;                                // 0x00C0(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TArray<int32>                                 CompleteArchivements;                              // 0x00D0(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TArray<int32>                                 PlayedArchivements;                                // 0x00E0(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, NativeAccessSpecifierProtected)

public:
	void PlayArchivement(int32 InId);
	void SetArchievementPlayed(int32 InId);
	void SetArchivementComplete(int32 InId);
	void SetConditionComplete(int32 InId);
	void SetConditionCompleteAdnRefresh(int32 InId);

	bool CanPlay(int32 InId) const;
	bool IsArchivementComplete(int32 InId) const;
	bool IsArchivementPlayed(int32 InId) const;
	bool IsConditionComplete(int32 InId) const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("InteractionArchivementComponentV3")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"InteractionArchivementComponentV3")
	}
	static class UInteractionArchivementComponentV3* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInteractionArchivementComponentV3>();
	}
};
DUMPER7_ASSERTS_UInteractionArchivementComponentV3;

// Class CharacterInteractionV3.FacialAnimUnit
// 0x0018 (0x0048 - 0x0030)
class UFacialAnimUnit final : public UShowElementV3Unit
{
public:
	class UAnimSequence*                          Sequence;                                          // 0x0030(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BlendInTime;                                       // 0x0038(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BlendOutTime;                                      // 0x003C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BlendOutTriggerTime;                               // 0x0040(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableAutoBlendOut;                               // 0x0044(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FacialAnimUnit")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FacialAnimUnit")
	}
	static class UFacialAnimUnit* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFacialAnimUnit>();
	}
};
DUMPER7_ASSERTS_UFacialAnimUnit;

// Class CharacterInteractionV3.AlignTransformToCharacterEvent
// 0x0018 (0x0040 - 0x0028)
class UAlignTransformToCharacterEvent final : public UInteractionV3Event
{
public:
	class FName                                   MasterActorName;                                   // 0x0028(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          AlignAllSubActor;                                  // 0x0030(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Rei-SdkDumper ])
	class FName                                   SubActorName;                                      // 0x0034(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          AlignTranslation;                                  // 0x003C(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          AlignRotation;                                     // 0x003D(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          AlignScale;                                        // 0x003E(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3F[0x1];                                       // 0x003F(0x0001)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AlignTransformToCharacterEvent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AlignTransformToCharacterEvent")
	}
	static class UAlignTransformToCharacterEvent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAlignTransformToCharacterEvent>();
	}
};
DUMPER7_ASSERTS_UAlignTransformToCharacterEvent;

// Class CharacterInteractionV3.FennyShowerLittleGame
// 0x0010 (0x0078 - 0x0068)
class UFennyShowerLittleGame final : public UScenarioStandardLittleGame
{
public:
	TArray<struct FFennyShowerStandbyCfg>         StandbyCfgs;                                       // 0x0068(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)

public:
	void GetCameraAdditivePitchAndYaw(float* OutPitch, float* OutYaw) const;
	bool GetCanActiveCamera() const;
	void PlayStandBy(const int32 idx) const;
	void SetCanActiveCamera(const bool bCan) const;
	void SetStandByInfo(const int32 idx) const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FennyShowerLittleGame")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FennyShowerLittleGame")
	}
	static class UFennyShowerLittleGame* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFennyShowerLittleGame>();
	}
};
DUMPER7_ASSERTS_UFennyShowerLittleGame;

// Class CharacterInteractionV3.HolyLightV3Component
// 0x0058 (0x0108 - 0x00B0)
class UHolyLightV3Component final : public UActorComponent
{
public:
	TMap<class FName, struct FInteractionV3HolyLightRuntimeDataArray> HolyLightRuntimeData;          // 0x00B0(0x0050)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	uint8                                         Pad_100[0x8];                                      // 0x0100(0x0008)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("HolyLightV3Component")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"HolyLightV3Component")
	}
	static class UHolyLightV3Component* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHolyLightV3Component>();
	}
};
DUMPER7_ASSERTS_UHolyLightV3Component;

// Class CharacterInteractionV3.InteractionActorV3
// 0x0170 (0x0398 - 0x0228)
class AInteractionActorV3 : public AActor
{
public:
	class FName                                   ActorName;                                         // 0x0228(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UShowElementV3UnitPlayerConfigAsset> SEUintPlayConfig;                      // 0x0230(0x0028)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TMap<TSubclassOf<class UShowElementV3Unit>, class UShowElementV3UnitPlayer*> PlayerMapByType;    // 0x0258(0x0050)(BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	TMap<TSubclassOf<class UShowElementV3UnitPlayer>, class UShowElementV3UnitPlayer*> PlayerMapByClass; // 0x02A8(0x0050)(BlueprintVisible, BlueprintReadOnly, Transient, Protected, NativeAccessSpecifierProtected)
	TMap<class UShowElementV3Unit*, class UShowElementV3UnitPlayer*> ElementUnitPlayerContext;       // 0x02F8(0x0050)(Transient, Protected, NativeAccessSpecifierProtected)
	TMap<class FString, TDelegate<void()>>        OperateDelegateMap;                                // 0x0348(0x0050)(Transient, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)

public:
	void BindOperateActEvent(const class FString& ActorOperateActName, const TDelegate<void(const class FString& ActorOperateActName, float DeltaSeconds, class UActorOperateAct* ActorOperateAct, EInteractionV3OperateEventType EventType)>& Delegate);
	void OnOperateEnd(const class FString& ActorOperateActName, class UActorOperateAct* ActorOperateAct);
	void OnOperateStart(const class FString& ActorOperateActName, class UActorOperateAct* ActorOperateAct);
	void OnOperateUpdate(const class FString& ActorOperateActName, float DeltaSeconds, class UActorOperateAct* ActorOperateAct);
	void PlayWeightedVoice(const struct FInteractionVoiceConfig& Config);
	void PlayWeightedVoiceWithAnimInstance(class UAnimInstance* AnimInstance, const struct FInteractionVoiceConfig& Config);
	void ReInitPhysics();
	void ResetActor();
	void ResetActorPhysics();
	void StopVoice(int32 TransitionMS, bool bInvokeCallback);
	void UnbindOperateActEvent(const class FString& ActorOperateActName);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("InteractionActorV3")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"InteractionActorV3")
	}
	static class AInteractionActorV3* GetDefaultObj()
	{
		return GetDefaultObjImpl<AInteractionActorV3>();
	}
};
DUMPER7_ASSERTS_AInteractionActorV3;

// Class CharacterInteractionV3.InteractionCameraActor
// 0x0608 (0x0830 - 0x0228)
class alignas(0x10) AInteractionCameraActor final : public AActor
{
public:
	uint8                                         Pad_228[0x8];                                      // 0x0228(0x0008)(Fixing Size After Last Property [ Rei-SdkDumper ])
	TSubclassOf<class UCameraInstance>            CameraBlueprintCalss;                              // 0x0230(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_238[0x5F8];                                    // 0x0238(0x05F8)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])

public:
	static class AInteractionCameraActor* GetCameraActor();

	void ActiveCamera();
	void GetAdditivePitchAndYaw(float* OutPitch, float* OutYaw);
	void SetOperateConfig(class FName ID);
	void SetStandbyConfig(class FName ID);
	void ToggleDebugCameraModifierInfo();

	const struct FMinimalViewInfo GetDefaultViewInfo() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("InteractionCameraActor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"InteractionCameraActor")
	}
	static class AInteractionCameraActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AInteractionCameraActor>();
	}
};
DUMPER7_ASSERTS_AInteractionCameraActor;

// Class CharacterInteractionV3.InteractionCameraInstance
// 0x02C0 (0x0680 - 0x03C0)
class UInteractionCameraInstance final : public UInteractionCameraInstanceBase
{
public:
	int32                                         MaxInputSubStep;                                   // 0x03B8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         MaxSubStepInputDist;                               // 0x03BC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FStandbyCameraConfig                   StandbyCameraConfig;                               // 0x03C0(0x00F0)(Transient, Protected, NativeAccessSpecifierProtected)
	struct FInteractionCameraModifierInfo         StandbyModifierInfo;                               // 0x04B0(0x0028)(BlueprintVisible, BlueprintReadOnly, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_4D8[0x40];                                     // 0x04D8(0x0040)(Fixing Size After Last Property [ Rei-SdkDumper ])
	struct FStandbyCameraConfig                   OperateCameraConfig;                               // 0x0518(0x00F0)(Transient, Protected, NativeAccessSpecifierProtected)
	struct FInteractionCameraModifierInfo         OperateModifierInfo;                               // 0x0608(0x0028)(BlueprintVisible, BlueprintReadOnly, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_630[0x44];                                     // 0x0630(0x0044)(Fixing Size After Last Property [ Rei-SdkDumper ])
	bool                                          bAllowCameraMove;                                  // 0x0674(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bIsOperateCamera;                                  // 0x0675(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_676[0xA];                                      // 0x0676(0x000A)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])

public:
	void AddInput(const struct FVector2D& Value);
	void SetOperateConfig(class FName ID);
	void SetStandbyConfig(class FName ID);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("InteractionCameraInstance")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"InteractionCameraInstance")
	}
	static class UInteractionCameraInstance* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInteractionCameraInstance>();
	}
};
DUMPER7_ASSERTS_UInteractionCameraInstance;

// Class CharacterInteractionV3.InteractionSkeletalActorV3
// 0x0030 (0x03C8 - 0x0398)
class AInteractionSkeletalActorV3 : public AInteractionActorV3
{
public:
	uint8                                         Pad_398[0x8];                                      // 0x0398(0x0008)(Fixing Size After Last Property [ Rei-SdkDumper ])
	class USkeletalMeshComponent*                 SkeletalMeshComponent;                             // 0x03A0(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UBaseGamePhysicsControlComponent*       BodyPhysicsControlComponent;                       // 0x03A8(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UBaseGamePhysicsControlComponent*       BodyAnimNodePhysicsControlComponent;               // 0x03B0(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UPhysicsHandleComponent*                PhysicsHandleComponent;                            // 0x03B8(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bSyncBodyAnim;                                     // 0x03C0(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3C1[0x7];                                      // 0x03C1(0x0007)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])

public:
	class UInteractionV3CharacterAnimInstance* GetInteractionCharacterAnimInstance() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("InteractionSkeletalActorV3")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"InteractionSkeletalActorV3")
	}
	static class AInteractionSkeletalActorV3* GetDefaultObj()
	{
		return GetDefaultObjImpl<AInteractionSkeletalActorV3>();
	}
};
DUMPER7_ASSERTS_AInteractionSkeletalActorV3;

// Class CharacterInteractionV3.InteractionCharacterV3
// 0x0090 (0x0458 - 0x03C8)
class AInteractionCharacterV3 : public AInteractionSkeletalActorV3
{
public:
	bool                                          bForceEyeLookAtCamera;                             // 0x03C8(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3C9[0x3];                                      // 0x03C9(0x0003)(Fixing Size After Last Property [ Rei-SdkDumper ])
	struct FVector2D                              EyesLookAtPosition;                                // 0x03CC(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FInteractionLookAtBoneData             EyeLookAtBoneInfo;                                 // 0x03D4(0x0010)(BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
