#pragma once

/*
* SDK generated by Rei-SdkDumper
* Based on Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CharacterInteraction

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "CharacterInteraction_structs.hpp"
#include "PhysicsControl_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function CharacterInteraction.InteractionArchivementComponent.GetEggLevelSeqs
// 0x0010 (0x0010 - 0x0000)
struct InteractionArchivementComponent_GetEggLevelSeqs final
{
public:
	TArray<class ULevelSequence*>                 OutLevelSeqs;                                      // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InteractionArchivementComponent_GetEggLevelSeqs;

// Function CharacterInteraction.InteractionArchivementComponent.SetArchievementPlayed
// 0x0004 (0x0004 - 0x0000)
struct InteractionArchivementComponent_SetArchievementPlayed final
{
public:
	int32                                         ID;                                                // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InteractionArchivementComponent_SetArchievementPlayed;

// Function CharacterInteraction.InteractionArchivementComponent.SetArchivementComplete
// 0x0004 (0x0004 - 0x0000)
struct InteractionArchivementComponent_SetArchivementComplete final
{
public:
	int32                                         ID;                                                // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InteractionArchivementComponent_SetArchivementComplete;

// Function CharacterInteraction.InteractionArchivementComponent.SetConditionComplete
// 0x0004 (0x0004 - 0x0000)
struct InteractionArchivementComponent_SetConditionComplete final
{
public:
	int32                                         ID;                                                // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InteractionArchivementComponent_SetConditionComplete;

// Function CharacterInteraction.InteractionArchivementComponent.SetConditionCompleteAdnRefresh
// 0x0004 (0x0004 - 0x0000)
struct InteractionArchivementComponent_SetConditionCompleteAdnRefresh final
{
public:
	int32                                         ID;                                                // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InteractionArchivementComponent_SetConditionCompleteAdnRefresh;

// Function CharacterInteraction.InteractionArchivementComponent.IsArchivementComplete
// 0x0008 (0x0008 - 0x0000)
struct InteractionArchivementComponent_IsArchivementComplete final
{
public:
	int32                                         ID;                                                // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_InteractionArchivementComponent_IsArchivementComplete;

// Function CharacterInteraction.InteractionArchivementComponent.IsArchivementPlayed
// 0x0008 (0x0008 - 0x0000)
struct InteractionArchivementComponent_IsArchivementPlayed final
{
public:
	int32                                         ID;                                                // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_InteractionArchivementComponent_IsArchivementPlayed;

// Function CharacterInteraction.InteractionArchivementComponent.IsConditionComplete
// 0x0008 (0x0008 - 0x0000)
struct InteractionArchivementComponent_IsConditionComplete final
{
public:
	int32                                         ID;                                                // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_InteractionArchivementComponent_IsConditionComplete;

// Function CharacterInteraction.CharacterInteractionComponent.GetInteractionAnimInstance
// 0x0008 (0x0008 - 0x0000)
struct CharacterInteractionComponent_GetInteractionAnimInstance final
{
public:
	class UInteractionAnimInstance*               ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CharacterInteractionComponent_GetInteractionAnimInstance;

// Function CharacterInteraction.CharacterInteractionComponent.GetInteractionHeadAnimInstance
// 0x0008 (0x0008 - 0x0000)
struct CharacterInteractionComponent_GetInteractionHeadAnimInstance final
{
public:
	class UInteractionHeadAnimInstance*           ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CharacterInteractionComponent_GetInteractionHeadAnimInstance;

// Function CharacterInteraction.CharacterInteractionComponent.PlayShowSequence
// 0x0004 (0x0004 - 0x0000)
struct CharacterInteractionComponent_PlayShowSequence final
{
public:
	int32                                         ShowSequenceID;                                    // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CharacterInteractionComponent_PlayShowSequence;

// Function CharacterInteraction.CharacterInteractionComponent.PlayWeightedVoice
// 0x0010 (0x0010 - 0x0000)
struct CharacterInteractionComponent_PlayWeightedVoice final
{
public:
	TArray<struct FWeightedVoice>                 VoiceIDs;                                          // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CharacterInteractionComponent_PlayWeightedVoice;

// Function CharacterInteraction.CharacterInteractionComponent.SetbIsPlayingAnim
// 0x0001 (0x0001 - 0x0000)
struct CharacterInteractionComponent_SetbIsPlayingAnim final
{
public:
	bool                                          bIsPlaying;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CharacterInteractionComponent_SetbIsPlayingAnim;

// Function CharacterInteraction.CharacterInteractionComponent.SetExplicitForbitEyeFollow
// 0x0001 (0x0001 - 0x0000)
struct CharacterInteractionComponent_SetExplicitForbitEyeFollow final
{
public:
	bool                                          bInExplicitForbit;                                 // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CharacterInteractionComponent_SetExplicitForbitEyeFollow;

// Function CharacterInteraction.CharacterInteractionComponent.SetFinishedInteractionTutorial
// 0x0001 (0x0001 - 0x0000)
struct CharacterInteractionComponent_SetFinishedInteractionTutorial final
{
public:
	bool                                          IsFinished;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CharacterInteractionComponent_SetFinishedInteractionTutorial;

// Function CharacterInteraction.CharacterInteractionComponent.SetIsInteractionInterface
// 0x0001 (0x0001 - 0x0000)
struct CharacterInteractionComponent_SetIsInteractionInterface final
{
public:
	bool                                          NewBool;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CharacterInteractionComponent_SetIsInteractionInterface;

// Function CharacterInteraction.CharacterInteractionComponent.SetOperateEyeFollow
// 0x0001 (0x0001 - 0x0000)
struct CharacterInteractionComponent_SetOperateEyeFollow final
{
public:
	bool                                          bEyeFollow;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CharacterInteractionComponent_SetOperateEyeFollow;

// Function CharacterInteraction.CharacterInteractionComponent.StartStandby
// 0x0004 (0x0004 - 0x0000)
struct CharacterInteractionComponent_StartStandby final
{
public:
	int32                                         StandByID;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CharacterInteractionComponent_StartStandby;

// Function CharacterInteraction.CharacterInteractionComponent.UpdateKawaii
// 0x0008 (0x0008 - 0x0000)
struct CharacterInteractionComponent_UpdateKawaii final
{
public:
	float                                         NewBlendCounter;                                   // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          NewShutDownKawaii;                                 // 0x0004(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_CharacterInteractionComponent_UpdateKawaii;

// Function CharacterInteraction.CharacterInteractionComponent.GetIsInteractionInterface
// 0x0001 (0x0001 - 0x0000)
struct CharacterInteractionComponent_GetIsInteractionInterface final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CharacterInteractionComponent_GetIsInteractionInterface;

// Function CharacterInteraction.CharacterInteractionComponent.GetKawaiiAlphaValue
// 0x0004 (0x0004 - 0x0000)
struct CharacterInteractionComponent_GetKawaiiAlphaValue final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CharacterInteractionComponent_GetKawaiiAlphaValue;

// Function CharacterInteraction.FlowerMouseOverInterface.OnMouseOver
// 0x0018 (0x0018 - 0x0000)
struct FlowerMouseOverInterface_OnMouseOver final
{
public:
	struct FVector2D                              OverDistance;                                      // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              TargetPosition;                                    // 0x0008(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              LastMousePos;                                      // 0x0010(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FlowerMouseOverInterface_OnMouseOver;

// Function CharacterInteraction.InteractionOperate.OnInteractionEnd
// 0x0008 (0x0008 - 0x0000)
struct InteractionOperate_OnInteractionEnd final
{
public:
	class AInteractionCharacter*                  Actor;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InteractionOperate_OnInteractionEnd;

// Function CharacterInteraction.InteractionOperate.OnInteractionRemove
// 0x0008 (0x0008 - 0x0000)
struct InteractionOperate_OnInteractionRemove final
{
public:
	class AInteractionCharacter*                  Actor;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InteractionOperate_OnInteractionRemove;

// Function CharacterInteraction.InteractionOperate.OnInteractionReuse
// 0x0008 (0x0008 - 0x0000)
struct InteractionOperate_OnInteractionReuse final
{
public:
	class AInteractionCharacter*                  Actor;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InteractionOperate_OnInteractionReuse;

// Function CharacterInteraction.InteractionOperate.OnInteractionStart
// 0x0008 (0x0008 - 0x0000)
struct InteractionOperate_OnInteractionStart final
{
public:
	class AInteractionCharacter*                  Actor;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InteractionOperate_OnInteractionStart;

// Function CharacterInteraction.InteractionOperate.OnInteractionUpdate
// 0x0010 (0x0010 - 0x0000)
struct InteractionOperate_OnInteractionUpdate final
{
public:
	class AInteractionCharacter*                  Actor;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DeltaTime;                                         // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_InteractionOperate_OnInteractionUpdate;

// Function CharacterInteraction.InteractionOperate.OnScenarioChange
// 0x0004 (0x0004 - 0x0000)
struct InteractionOperate_OnScenarioChange final
{
public:
	int32                                         ScenarioID;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InteractionOperate_OnScenarioChange;

// Function CharacterInteraction.InteractionOperate.OnStandByChange
// 0x0004 (0x0004 - 0x0000)
struct InteractionOperate_OnStandByChange final
{
public:
	int32                                         ScenarioID;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InteractionOperate_OnStandByChange;

// Function CharacterInteraction.InteractionOperate.SetIsStop
// 0x0001 (0x0001 - 0x0000)
struct InteractionOperate_SetIsStop final
{
public:
	bool                                          bInStop;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InteractionOperate_SetIsStop;

// Function CharacterInteraction.InteractionOperate.ShouldRemove
// 0x0010 (0x0010 - 0x0000)
struct InteractionOperate_ShouldRemove final
{
public:
	class AInteractionCharacter*                  Actor;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_InteractionOperate_ShouldRemove;

// Function CharacterInteraction.InteractionOperate.GetIsStop
// 0x0001 (0x0001 - 0x0000)
struct InteractionOperate_GetIsStop final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InteractionOperate_GetIsStop;

// Function CharacterInteraction.InteractionOperate.IsBlockOperate
// 0x0001 (0x0001 - 0x0000)
struct InteractionOperate_IsBlockOperate final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InteractionOperate_IsBlockOperate;

// Function CharacterInteraction.InteractionOperate.OnInteractionResume
// 0x0008 (0x0008 - 0x0000)
struct InteractionOperate_OnInteractionResume final
{
public:
	class AInteractionCharacter*                  Actor;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InteractionOperate_OnInteractionResume;

// Function CharacterInteraction.InteractionOperate.OnInteractionStop
// 0x0008 (0x0008 - 0x0000)
struct InteractionOperate_OnInteractionStop final
{
public:
	class AInteractionCharacter*                  Actor;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InteractionOperate_OnInteractionStop;

// Function CharacterInteraction.InteractionOperate.ShouldStopOnRelease
// 0x0001 (0x0001 - 0x0000)
struct InteractionOperate_ShouldStopOnRelease final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InteractionOperate_ShouldStopOnRelease;

// Function CharacterInteraction.DragInteraction.UpdateDrag
// 0x0010 (0x0010 - 0x0000)
struct DragInteraction_UpdateDrag final
{
public:
	class AInteractionCharacter*                  Actor;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DeltaSecond;                                       // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_DragInteraction_UpdateDrag;

// Function CharacterInteraction.DragInteraction.UpdateRecover
// 0x0010 (0x0010 - 0x0000)
struct DragInteraction_UpdateRecover final
{
public:
	class AInteractionCharacter*                  Actor;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DeltaSeconds;                                      // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_DragInteraction_UpdateRecover;

// Function CharacterInteraction.PropsUpdateInterface.PropsUpdate
// 0x0030 (0x0030 - 0x0000)
struct PropsUpdateInterface_PropsUpdate final
{
public:
	struct FTransform                             NewTransform;                                      // 0x0000(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PropsUpdateInterface_PropsUpdate;

// Function CharacterInteraction.InteractionAnimInstance.SetIsDebugDraw
// 0x0001 (0x0001 - 0x0000)
struct InteractionAnimInstance_SetIsDebugDraw final
{
public:
	bool                                          bInDebugDraw;                                      // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InteractionAnimInstance_SetIsDebugDraw;

// Function CharacterInteraction.InteractionAnimInstance.GetIsDebugDraw
// 0x0001 (0x0001 - 0x0000)
struct InteractionAnimInstance_GetIsDebugDraw final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InteractionAnimInstance_GetIsDebugDraw;

// Function CharacterInteraction.InteractionCableComponent.AddConstraint
// 0x0008 (0x0008 - 0x0000)
struct InteractionCableComponent_AddConstraint final
{
public:
	int32                                         IndexA;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         IndexB;                                            // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InteractionCableComponent_AddConstraint;

// Function CharacterInteraction.InteractionCableComponent.GrabParticles
// 0x0010 (0x0010 - 0x0000)
struct InteractionCableComponent_GrabParticles final
{
public:
	int32                                         ParticleIndex;                                     // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                DragForce;                                         // 0x0004(0x000C)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InteractionCableComponent_GrabParticles;

// Function CharacterInteraction.InteractionCableComponent.IntegrateParticles
// 0x0004 (0x0004 - 0x0000)
struct InteractionCableComponent_IntegrateParticles final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InteractionCableComponent_IntegrateParticles;

// Function CharacterInteraction.InteractionCableComponent.SetAttachEndTo
// 0x0018 (0x0018 - 0x0000)
struct InteractionCableComponent_SetAttachEndTo final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   ComponentProperty;                                 // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   SocketName;                                        // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InteractionCableComponent_SetAttachEndTo;

// Function CharacterInteraction.InteractionCableComponent.SetAttachEndToComponent
// 0x0010 (0x0010 - 0x0000)
struct InteractionCableComponent_SetAttachEndToComponent final
{
public:
	class USceneComponent*                        Component;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   SocketName;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InteractionCableComponent_SetAttachEndToComponent;

// Function CharacterInteraction.InteractionCableComponent.SolveDistanceConstraints
// 0x0004 (0x0004 - 0x0000)
struct InteractionCableComponent_SolveDistanceConstraints final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InteractionCableComponent_SolveDistanceConstraints;

// Function CharacterInteraction.InteractionCableComponent.UpdateVelocities
// 0x0004 (0x0004 - 0x0000)
struct InteractionCableComponent_UpdateVelocities final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InteractionCableComponent_UpdateVelocities;

// Function CharacterInteraction.InteractionCableComponent.GetAttachedActor
// 0x0008 (0x0008 - 0x0000)
struct InteractionCableComponent_GetAttachedActor final
{
public:
	class AActor*                                 ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InteractionCableComponent_GetAttachedActor;

// Function CharacterInteraction.InteractionCableComponent.GetAttachedComponent
// 0x0008 (0x0008 - 0x0000)
struct InteractionCableComponent_GetAttachedComponent final
{
public:
	class USceneComponent*                        ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InteractionCableComponent_GetAttachedComponent;

// Function CharacterInteraction.InteractionCableComponent.GetInteractionCableParticleLocations
// 0x0010 (0x0010 - 0x0000)
struct InteractionCableComponent_GetInteractionCableParticleLocations final
{
public:
	TArray<struct FVector>                        Locations;                                         // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InteractionCableComponent_GetInteractionCableParticleLocations;

// Function CharacterInteraction.InteractionCharacter.BlendPhysics
// 0x0004 (0x0004 - 0x0000)
struct InteractionCharacter_BlendPhysics final
{
public:
	float                                         TimelineLength;                                    // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InteractionCharacter_BlendPhysics;

// Function CharacterInteraction.InteractionCharacter.GetStandByConfig
// 0x00F0 (0x00F0 - 0x0000)
struct InteractionCharacter_GetStandByConfig final
{
public:
	int32                                         StandByID;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Rei-SdkDumper ])
	struct FInteractionStandByConfig              Config;                                            // 0x0008(0x00E0)(Parm, OutParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x00E8(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_InteractionCharacter_GetStandByConfig;

// Function CharacterInteraction.InteractionCharacter.SetPhysicsBlendWeight
// 0x0018 (0x0018 - 0x0000)
struct InteractionCharacter_SetPhysicsBlendWeight final
{
public:
	class FName                                   SetName;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         StartBlend;                                        // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Target;                                            // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BlendSpeed;                                        // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          CompleteClose;                                     // 0x0014(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_InteractionCharacter_SetPhysicsBlendWeight;

// Function CharacterInteraction.InteractionCharacter.SetReceiveInteraction
// 0x0001 (0x0001 - 0x0000)
struct InteractionCharacter_SetReceiveInteraction final
{
public:
	bool                                          bInReceive;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InteractionCharacter_SetReceiveInteraction;

// Function CharacterInteraction.InteractionCharacter.GetBodyComponent
// 0x0008 (0x0008 - 0x0000)
struct InteractionCharacter_GetBodyComponent final
{
public:
	class USkeletalMeshComponent*                 ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InteractionCharacter_GetBodyComponent;

// Function CharacterInteraction.InteractionCharacter.GetHeadComponent
// 0x0008 (0x0008 - 0x0000)
struct InteractionCharacter_GetHeadComponent final
{
public:
	class USkeletalMeshComponent*                 ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InteractionCharacter_GetHeadComponent;

// Function CharacterInteraction.InteractionCharacter.GetInteractionName
// 0x0008 (0x0008 - 0x0000)
struct InteractionCharacter_GetInteractionName final
{
public:
	class FName                                   ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InteractionCharacter_GetInteractionName;

// Function CharacterInteraction.InteractionCharacter.GetIsDebugDraw
// 0x0001 (0x0001 - 0x0000)
struct InteractionCharacter_GetIsDebugDraw final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InteractionCharacter_GetIsDebugDraw;

// Function CharacterInteraction.InteractionCharacter.GetReceiveInteraction
// 0x0001 (0x0001 - 0x0000)
struct InteractionCharacter_GetReceiveInteraction final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InteractionCharacter_GetReceiveInteraction;

// Function CharacterInteraction.InteractionCharacter.GetSkinID
// 0x0004 (0x0004 - 0x0000)
struct InteractionCharacter_GetSkinID final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InteractionCharacter_GetSkinID;

// Function CharacterInteraction.InteractionExtraSequenceProcessor.OnTickSequence
// 0x0004 (0x0004 - 0x0000)
struct InteractionExtraSequenceProcessor_OnTickSequence final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InteractionExtraSequenceProcessor_OnTickSequence;

// Function CharacterInteraction.InteractionExtraStandByProcessor.OnMenuEvent
// 0x0004 (0x0004 - 0x0000)
struct InteractionExtraStandByProcessor_OnMenuEvent final
{
public:
	int32                                         ID;                                                // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InteractionExtraStandByProcessor_OnMenuEvent;

// Function CharacterInteraction.InteractionExtraStandByProcessor.OnTickStandBy
// 0x0004 (0x0004 - 0x0000)
struct InteractionExtraStandByProcessor_OnTickStandBy final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InteractionExtraStandByProcessor_OnTickStandBy;

// Function CharacterInteraction.InteractionDirector.GetInteractionDirector
// 0x0010 (0x0010 - 0x0000)
struct InteractionDirector_GetInteractionDirector final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AInteractionDirector*                   ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InteractionDirector_GetInteractionDirector;

// Function CharacterInteraction.InteractionDirector.CreateInteractionCharacter
// 0x0018 (0x0018 - 0x0000)
struct InteractionDirector_CreateInteractionCharacter final
{
public:
	TSubclassOf<class AInteractionCharacter>      Type;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   InteractionCharacterName;                          // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AInteractionCharacter*                  ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InteractionDirector_CreateInteractionCharacter;

// Function CharacterInteraction.InteractionDirector.GetCollisionEventData
// 0x0020 (0x0020 - 0x0000)
struct InteractionDirector_GetCollisionEventData final
{
public:
	struct FInteractionCollisionEventData         ReturnValue;                                       // 0x0000(0x0020)(ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InteractionDirector_GetCollisionEventData;

// Function CharacterInteraction.InteractionDirector.GetLittleGameComponent
// 0x0008 (0x0008 - 0x0000)
struct InteractionDirector_GetLittleGameComponent final
{
public:
	class UInteractionLittleGameComponent*        ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InteractionDirector_GetLittleGameComponent;

// Function CharacterInteraction.InteractionDirector.GetMousePosition
// 0x0008 (0x0008 - 0x0000)
struct InteractionDirector_GetMousePosition final
{
public:
	struct FVector2D                              ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InteractionDirector_GetMousePosition;

// Function CharacterInteraction.InteractionDirector.GetMousePressPosition
// 0x0008 (0x0008 - 0x0000)
struct InteractionDirector_GetMousePressPosition final
{
public:
	struct FVector2D                              ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InteractionDirector_GetMousePressPosition;

// Function CharacterInteraction.InteractionDirector.HaveLittleGame
// 0x0001 (0x0001 - 0x0000)
struct InteractionDirector_HaveLittleGame final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InteractionDirector_HaveLittleGame;

// Function CharacterInteraction.InteractionDirector.RemoveInteractionCharacter
// 0x0008 (0x0008 - 0x0000)
struct InteractionDirector_RemoveInteractionCharacter final
{
public:
	class FName                                   Name_0;                                            // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InteractionDirector_RemoveInteractionCharacter;

// Function CharacterInteraction.InteractionDirector.SetIsInLittleGame
// 0x0001 (0x0001 - 0x0000)
struct InteractionDirector_SetIsInLittleGame final
{
public:
	bool                                          bIsInGame;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InteractionDirector_SetIsInLittleGame;

// Function CharacterInteraction.InteractionDirector.SetIsMouseInScreen
// 0x0001 (0x0001 - 0x0000)
struct InteractionDirector_SetIsMouseInScreen final
{
public:
	bool                                          bInIsMouseInScreen;                                // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InteractionDirector_SetIsMouseInScreen;

// Function CharacterInteraction.InteractionDirector.SetIsMousePressed
// 0x0001 (0x0001 - 0x0000)
struct InteractionDirector_SetIsMousePressed final
{
public:
	bool                                          bInIsMousePressed;                                 // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InteractionDirector_SetIsMousePressed;

// Function CharacterInteraction.InteractionDirector.SetMousePosition
// 0x0008 (0x0008 - 0x0000)
struct InteractionDirector_SetMousePosition final
{
public:
	struct FVector2D                              Pos;                                               // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InteractionDirector_SetMousePosition;

// Function CharacterInteraction.InteractionDirector.SetMousePressPosition
// 0x0008 (0x0008 - 0x0000)
struct InteractionDirector_SetMousePressPosition final
{
public:
	struct FVector2D                              Pos;                                               // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InteractionDirector_SetMousePressPosition;

// Function CharacterInteraction.InteractionDirector.StartLittleGame
// 0x0004 (0x0004 - 0x0000)
struct InteractionDirector_StartLittleGame final
{
public:
	int32                                         ID;                                                // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InteractionDirector_StartLittleGame;

// Function CharacterInteraction.InteractionDirector.StopLittleGame
// 0x0001 (0x0001 - 0x0000)
struct InteractionDirector_StopLittleGame final
{
public:
	bool                                          bIsVictory;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InteractionDirector_StopLittleGame;

// Function CharacterInteraction.InteractionDirector.GetAllInteractionCharacters
// 0x0050 (0x0050 - 0x0000)
struct InteractionDirector_GetAllInteractionCharacters final
{
public:
	TMap<class FName, class AInteractionCharacter*> ReturnValue;                                     // 0x0000(0x0050)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InteractionDirector_GetAllInteractionCharacters;

// Function CharacterInteraction.InteractionDirector.GetArchivementComponent
// 0x0008 (0x0008 - 0x0000)
struct InteractionDirector_GetArchivementComponent final
{
public:
	class UInteractionArchivementComponent*       ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InteractionDirector_GetArchivementComponent;

// Function CharacterInteraction.InteractionDirector.GetHolyLightComponent
// 0x0008 (0x0008 - 0x0000)
struct InteractionDirector_GetHolyLightComponent final
{
public:
	class UHolyLightComponent*                    ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InteractionDirector_GetHolyLightComponent;

// Function CharacterInteraction.InteractionDirector.GetInteractionCharacterByName
// 0x0010 (0x0010 - 0x0000)
struct InteractionDirector_GetInteractionCharacterByName final
{
public:
	class FName                                   Name_0;                                            // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AInteractionCharacter*                  ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InteractionDirector_GetInteractionCharacterByName;

// Function CharacterInteraction.InteractionDirector.IsInLittleGame
// 0x0001 (0x0001 - 0x0000)
struct InteractionDirector_IsInLittleGame final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InteractionDirector_IsInLittleGame;

// Function CharacterInteraction.InteractionDirector.IsMobilePlatform
// 0x0001 (0x0001 - 0x0000)
struct InteractionDirector_IsMobilePlatform final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InteractionDirector_IsMobilePlatform;

// Function CharacterInteraction.InteractionDirector.IsMouseInScreen
// 0x0001 (0x0001 - 0x0000)
struct InteractionDirector_IsMouseInScreen final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InteractionDirector_IsMouseInScreen;

// Function CharacterInteraction.InteractionDirector.IsMousePressed
// 0x0001 (0x0001 - 0x0000)
struct InteractionDirector_IsMousePressed final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InteractionDirector_IsMousePressed;

// Function CharacterInteraction.InteractionLib.CalculateQuadraticBezierPoint
// 0x0034 (0x0034 - 0x0000)
struct InteractionLib_CalculateQuadraticBezierPoint final
{
public:
	float                                         T;                                                 // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                P0;                                                // 0x0004(0x000C)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                P1;                                                // 0x0010(0x000C)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                P2;                                                // 0x001C(0x000C)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                ReturnValue;                                       // 0x0028(0x000C)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InteractionLib_CalculateQuadraticBezierPoint;

// Function CharacterInteraction.InteractionLib.GetCharacterAnimation
// 0x0038 (0x0038 - 0x0000)
struct InteractionLib_GetCharacterAnimation final
{
public:
	class FString                                 AnimName;                                          // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 GirlName;                                          // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 SkinAnimNameSuffix;                                // 0x0020(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimSequence*                          ReturnValue;                                       // 0x0030(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InteractionLib_GetCharacterAnimation;

// Function CharacterInteraction.InteractionLib.GetSkeletonMeshTriangle
// 0x0048 (0x0048 - 0x0000)
struct InteractionLib_GetSkeletonMeshTriangle final
{
public:
	class USkeletalMeshComponent*                 Mesh;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              CanvasSize;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                WorldPosition;                                     // 0x0010(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Dir;                                               // 0x001C(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              HitPosition;                                       // 0x0028(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Hit;                                               // 0x0030(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Rei-SdkDumper ])
	int32                                         LOD;                                               // 0x0034(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FCanvasUVTri>                   ReturnValue;                                       // 0x0038(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InteractionLib_GetSkeletonMeshTriangle;

// Function CharacterInteraction.InteractionLib.GetSkeletonTriangleInfo
// 0x0040 (0x0040 - 0x0000)
struct InteractionLib_GetSkeletonTriangleInfo final
{
public:
	class USkeletalMeshComponent*                 Mesh;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                WorldPosition;                                     // 0x0008(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Dir;                                               // 0x0014(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              HitUV;                                             // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           HitColor;                                          // 0x0028(0x0010)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Hit;                                               // 0x0038(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Rei-SdkDumper ])
	int32                                         LOD;                                               // 0x003C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InteractionLib_GetSkeletonTriangleInfo;

// Function CharacterInteraction.InteractionLib.NotifyEasterEggSequence
// 0x0008 (0x0008 - 0x0000)
struct InteractionLib_NotifyEasterEggSequence final
{
public:
	const class ULevelSequence*                   EasterEgg;                                         // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InteractionLib_NotifyEasterEggSequence;

// Function CharacterInteraction.InteractionLib.NotifyOperateState
// 0x0004 (0x0004 - 0x0000)
struct InteractionLib_NotifyOperateState final
{
public:
	int32                                         State;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InteractionLib_NotifyOperateState;

// Function CharacterInteraction.InteractionLittleGame.EnterGame
// 0x0004 (0x0004 - 0x0000)
struct InteractionLittleGame_EnterGame final
{
public:
	int32                                         ID;                                                // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InteractionLittleGame_EnterGame;

// Function CharacterInteraction.InteractionLittleGame.UpdateGame
// 0x0004 (0x0004 - 0x0000)
struct InteractionLittleGame_UpdateGame final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InteractionLittleGame_UpdateGame;

// Function CharacterInteraction.InteractionLittleGameComponent.SetIsInLittleGame
// 0x0001 (0x0001 - 0x0000)
struct InteractionLittleGameComponent_SetIsInLittleGame final
{
public:
	bool                                          bIsInGame;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InteractionLittleGameComponent_SetIsInLittleGame;

// Function CharacterInteraction.InteractionLittleGameComponent.StartLittleGame
// 0x0004 (0x0004 - 0x0000)
struct InteractionLittleGameComponent_StartLittleGame final
{
public:
	int32                                         ID;                                                // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InteractionLittleGameComponent_StartLittleGame;

// Function CharacterInteraction.InteractionLittleGameComponent.GetIsInLittleGame
// 0x0001 (0x0001 - 0x0000)
struct InteractionLittleGameComponent_GetIsInLittleGame final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InteractionLittleGameComponent_GetIsInLittleGame;

// Function CharacterInteraction.PhyOperate.DoEndOperate
// 0x0008 (0x0008 - 0x0000)
struct PhyOperate_DoEndOperate final
{
public:
	class AInteractionCharacter*                  Character;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PhyOperate_DoEndOperate;

// Function CharacterInteraction.PhyOperate.DoStartOperate
// 0x0008 (0x0008 - 0x0000)
struct PhyOperate_DoStartOperate final
{
public:
	class AInteractionCharacter*                  Character;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PhyOperate_DoStartOperate;

// Function CharacterInteraction.PhyOperate.DoUpdateOperate
// 0x0008 (0x0008 - 0x0000)
struct PhyOperate_DoUpdateOperate final
{
public:
	class AInteractionCharacter*                  Character;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
