#pragma once

/*
* SDK generated by Rei-SdkDumper
* Based on Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CharacterInteractionV3

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "InputCore_structs.hpp"
#include "CharacterInteractionV3_structs.hpp"
#include "UniversalCameraPlugin_structs.hpp"


namespace SDK::Params
{

// Function CharacterInteractionV3.ActorOperateAct.OnPause
// 0x0008 (0x0008 - 0x0000)
struct ActorOperateAct_OnPause final
{
public:
	class AInteractionSkeletalActorV3*            Actor;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ActorOperateAct_OnPause;

// Function CharacterInteractionV3.ActorOperateAct.OnRestart
// 0x0008 (0x0008 - 0x0000)
struct ActorOperateAct_OnRestart final
{
public:
	class AInteractionSkeletalActorV3*            Actor;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ActorOperateAct_OnRestart;

// Function CharacterInteractionV3.ActorOperateAct.OnResume
// 0x0008 (0x0008 - 0x0000)
struct ActorOperateAct_OnResume final
{
public:
	class AInteractionSkeletalActorV3*            Actor;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ActorOperateAct_OnResume;

// Function CharacterInteractionV3.ActorOperateAct.OnStart
// 0x0008 (0x0008 - 0x0000)
struct ActorOperateAct_OnStart final
{
public:
	class AInteractionSkeletalActorV3*            Actor;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ActorOperateAct_OnStart;

// Function CharacterInteractionV3.ActorOperateAct.OnStartBlendOut
// 0x0008 (0x0008 - 0x0000)
struct ActorOperateAct_OnStartBlendOut final
{
public:
	class AInteractionSkeletalActorV3*            Actor;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ActorOperateAct_OnStartBlendOut;

// Function CharacterInteractionV3.ActorOperateAct.OnStop
// 0x0008 (0x0008 - 0x0000)
struct ActorOperateAct_OnStop final
{
public:
	class AInteractionSkeletalActorV3*            Actor;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ActorOperateAct_OnStop;

// Function CharacterInteractionV3.ActorOperateAct.OnUpdate
// 0x0018 (0x0018 - 0x0000)
struct ActorOperateAct_OnUpdate final
{
public:
	class UInteractionV3InputControl*             InputControl;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AInteractionSkeletalActorV3*            Actor;                                             // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DeltaSeconds;                                      // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_ActorOperateAct_OnUpdate;

// Function CharacterInteractionV3.ActorOperateAct.ProcessStartAct
// 0x0008 (0x0008 - 0x0000)
struct ActorOperateAct_ProcessStartAct final
{
public:
	class AInteractionSkeletalActorV3*            Actor;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ActorOperateAct_ProcessStartAct;

// Function CharacterInteractionV3.ActorOperateAct.GetInputControl
// 0x0008 (0x0008 - 0x0000)
struct ActorOperateAct_GetInputControl final
{
public:
	class UInteractionV3InputControl*             ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ActorOperateAct_GetInputControl;

// Function CharacterInteractionV3.ActorOperateAct.GetScenarioOperate
// 0x0008 (0x0008 - 0x0000)
struct ActorOperateAct_GetScenarioOperate final
{
public:
	class UScenarioOperate*                       ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ActorOperateAct_GetScenarioOperate;

// Function CharacterInteractionV3.ActorOperateAct.IsCompleteAndBlendOut
// 0x0001 (0x0001 - 0x0000)
struct ActorOperateAct_IsCompleteAndBlendOut final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ActorOperateAct_IsCompleteAndBlendOut;

// Function CharacterInteractionV3.InteractionV3Event.CanTrigger
// 0x0001 (0x0001 - 0x0000)
struct InteractionV3Event_CanTrigger final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InteractionV3Event_CanTrigger;

// Function CharacterInteractionV3.InteractionV3PhysicsControlComponent.ConditionalCreateMaintainWorldSpaceRelativeControl
// 0x0040 (0x0040 - 0x0000)
struct InteractionV3PhysicsControlComponent_ConditionalCreateMaintainWorldSpaceRelativeControl final
{
public:
	class FName                                   Name_0;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMeshComponent*                         ParentMeshComponent;                               // 0x0008(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   ParentBoneName;                                    // 0x0010(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMeshComponent*                         ChildMeshComponent;                                // 0x0018(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   ChildBoneName;                                     // 0x0020(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   Set;                                               // 0x0028(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   AdditionalSetName;                                 // 0x0030(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0038(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_InteractionV3PhysicsControlComponent_ConditionalCreateMaintainWorldSpaceRelativeControl;

// Function CharacterInteractionV3.InteractionV3PhysicsControlComponent.ConditionalDestroyAllMaintainWorldSpaceRelativeControls
// 0x0001 (0x0001 - 0x0000)
struct InteractionV3PhysicsControlComponent_ConditionalDestroyAllMaintainWorldSpaceRelativeControls final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InteractionV3PhysicsControlComponent_ConditionalDestroyAllMaintainWorldSpaceRelativeControls;

// Function CharacterInteractionV3.InteractionMouseHoverInterface.OnMouseHover
// 0x0030 (0x0030 - 0x0000)
struct InteractionMouseHoverInterface_OnMouseHover final
{
public:
	TArray<class FName>                           BoneNames;                                         // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	const class UCurveFloat*                      CurveScale;                                        // 0x0010(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              SlideVector;                                       // 0x0018(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              SlideStartPos;                                     // 0x0020(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              SlidEndPos;                                        // 0x0028(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InteractionMouseHoverInterface_OnMouseHover;

// Function CharacterInteractionV3.ScenarioLittleGameBase.OnUpdate
// 0x0004 (0x0004 - 0x0000)
struct ScenarioLittleGameBase_OnUpdate final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ScenarioLittleGameBase_OnUpdate;

// Function CharacterInteractionV3.ScenarioLittleGameBase.Update
// 0x0004 (0x0004 - 0x0000)
struct ScenarioLittleGameBase_Update final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ScenarioLittleGameBase_Update;

// Function CharacterInteractionV3.ScenarioLittleGameBase.GetInteractionInputComponent
// 0x0008 (0x0008 - 0x0000)
struct ScenarioLittleGameBase_GetInteractionInputComponent final
{
public:
	class UInteractionInputComponent*             ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ScenarioLittleGameBase_GetInteractionInputComponent;

// Function CharacterInteractionV3.ScenarioLittleGameBase.GetStateNode
// 0x0008 (0x0008 - 0x0000)
struct ScenarioLittleGameBase_GetStateNode final
{
public:
	class UScenarioStateNode_LittleGame*          ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ScenarioLittleGameBase_GetStateNode;

// Function CharacterInteractionV3.ScenarioStandardLittleGame.GameInput
// 0x0018 (0x0018 - 0x0000)
struct ScenarioStandardLittleGame_GameInput final
{
public:
	struct FLittleGameInputEvent                  InputEvent;                                        // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ScenarioStandardLittleGame_GameInput;

// Function CharacterInteractionV3.ScenarioStandardLittleGame.MouseClick
// 0x0018 (0x0018 - 0x0000)
struct ScenarioStandardLittleGame_MouseClick final
{
public:
	struct FLittleGameInputEvent                  InputEvent;                                        // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ScenarioStandardLittleGame_MouseClick;

// Function CharacterInteractionV3.ScenarioStandardLittleGame.MousePress
// 0x0018 (0x0018 - 0x0000)
struct ScenarioStandardLittleGame_MousePress final
{
public:
	struct FLittleGameInputEvent                  InputEvent;                                        // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ScenarioStandardLittleGame_MousePress;

// Function CharacterInteractionV3.ScenarioStandardLittleGame.MouseRelease
// 0x0018 (0x0018 - 0x0000)
struct ScenarioStandardLittleGame_MouseRelease final
{
public:
	struct FLittleGameInputEvent                  InputEvent;                                        // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ScenarioStandardLittleGame_MouseRelease;

// Function CharacterInteractionV3.ScenarioStandardLittleGame.OnGameInput
// 0x0018 (0x0018 - 0x0000)
struct ScenarioStandardLittleGame_OnGameInput final
{
public:
	struct FLittleGameInputEvent                  InputEvent;                                        // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ScenarioStandardLittleGame_OnGameInput;

// Function CharacterInteractionV3.ScenarioStandardLittleGame.OnLookAround
// 0x0004 (0x0004 - 0x0000)
struct ScenarioStandardLittleGame_OnLookAround final
{
public:
	float                                         InValue;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ScenarioStandardLittleGame_OnLookAround;

// Function CharacterInteractionV3.ScenarioStandardLittleGame.OnLookUp
// 0x0004 (0x0004 - 0x0000)
struct ScenarioStandardLittleGame_OnLookUp final
{
public:
	float                                         InValue;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ScenarioStandardLittleGame_OnLookUp;

// Function CharacterInteractionV3.ScenarioStandardLittleGame.OnMouseClick
// 0x0018 (0x0018 - 0x0000)
struct ScenarioStandardLittleGame_OnMouseClick final
{
public:
	struct FLittleGameInputEvent                  InputEvent;                                        // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ScenarioStandardLittleGame_OnMouseClick;

// Function CharacterInteractionV3.ScenarioStandardLittleGame.OnMousePress
// 0x0018 (0x0018 - 0x0000)
struct ScenarioStandardLittleGame_OnMousePress final
{
public:
	struct FLittleGameInputEvent                  InputEvent;                                        // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ScenarioStandardLittleGame_OnMousePress;

// Function CharacterInteractionV3.ScenarioStandardLittleGame.OnMouseRelease
// 0x0018 (0x0018 - 0x0000)
struct ScenarioStandardLittleGame_OnMouseRelease final
{
public:
	struct FLittleGameInputEvent                  InputEvent;                                        // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ScenarioStandardLittleGame_OnMouseRelease;

// Function CharacterInteractionV3.ScenarioStandardLittleGame.OnMoveForward
// 0x0004 (0x0004 - 0x0000)
struct ScenarioStandardLittleGame_OnMoveForward final
{
public:
	float                                         InValue;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ScenarioStandardLittleGame_OnMoveForward;

// Function CharacterInteractionV3.ScenarioStandardLittleGame.OnMoveRight
// 0x0004 (0x0004 - 0x0000)
struct ScenarioStandardLittleGame_OnMoveRight final
{
public:
	float                                         InValue;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ScenarioStandardLittleGame_OnMoveRight;

// Function CharacterInteractionV3.ScenarioStandardLittleGame.PlayShowElement
// 0x0028 (0x0028 - 0x0000)
struct ScenarioStandardLittleGame_PlayShowElement final
{
public:
	class FString                                 ElementName;                                       // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 NextState;                                         // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEndLastShowElement;                               // 0x0020(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_ScenarioStandardLittleGame_PlayShowElement;

// Function CharacterInteractionV3.ScenarioStandardLittleGame.PlayShowElementList
// 0x0028 (0x0028 - 0x0000)
struct ScenarioStandardLittleGame_PlayShowElementList final
{
public:
	TArray<class FString>                         InElements;                                        // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	class FString                                 NextState;                                         // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEndLastShowElement;                               // 0x0020(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_ScenarioStandardLittleGame_PlayShowElementList;

// Function CharacterInteractionV3.ScenarioStandardLittleGame.SetUIState
// 0x0001 (0x0001 - 0x0000)
struct ScenarioStandardLittleGame_SetUIState final
{
public:
	EScenarioLittleGameUIState                    NewState;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ScenarioStandardLittleGame_SetUIState;

// Function CharacterInteractionV3.ScenarioStandardLittleGame.GetCustomGameUI
// 0x0018 (0x0018 - 0x0000)
struct ScenarioStandardLittleGame_GetCustomGameUI final
{
public:
	struct FSoftClassPath                         ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ScenarioStandardLittleGame_GetCustomGameUI;

// Function CharacterInteractionV3.ScenarioStandardLittleGame.GetMousePos
// 0x0008 (0x0008 - 0x0000)
struct ScenarioStandardLittleGame_GetMousePos final
{
public:
	struct FVector2D                              ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ScenarioStandardLittleGame_GetMousePos;

// Function CharacterInteractionV3.ScenarioStandardLittleGame.GetUIState
// 0x0001 (0x0001 - 0x0000)
struct ScenarioStandardLittleGame_GetUIState final
{
public:
	EScenarioLittleGameUIState                    ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ScenarioStandardLittleGame_GetUIState;

// Function CharacterInteractionV3.ScenarioStandardLittleGame.IsBlockInput
// 0x0001 (0x0001 - 0x0000)
struct ScenarioStandardLittleGame_IsBlockInput final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ScenarioStandardLittleGame_IsBlockInput;

// Function CharacterInteractionV3.ScenarioStandardLittleGame.IsCustomGameUI
// 0x0001 (0x0001 - 0x0000)
struct ScenarioStandardLittleGame_IsCustomGameUI final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ScenarioStandardLittleGame_IsCustomGameUI;

// Function CharacterInteractionV3.ScenarioStandardLittleGame.ListenForInputAction
// 0x0020 (0x0020 - 0x0000)
struct ScenarioStandardLittleGame_ListenForInputAction final
{
public:
	class FName                                   ActionName;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EInputEvent                                   EventType;                                         // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bConsume;                                          // 0x0009(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A[0x2];                                        // 0x000A(0x0002)(Fixing Size After Last Property [ Rei-SdkDumper ])
	TDelegate<void()>                             Callback;                                          // 0x000C(0x0010)(Parm, ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x001C(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ScenarioStandardLittleGame_ListenForInputAction;

// Function CharacterInteractionV3.ScenarioStandardLittleGame.ListenForKeyAction
// 0x0030 (0x0030 - 0x0000)
struct ScenarioStandardLittleGame_ListenForKeyAction final
{
public:
	struct FKey                                   InKey;                                             // 0x0000(0x0018)(ConstParm, Parm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EInputEvent                                   EventType;                                         // 0x0018(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bConsume;                                          // 0x0019(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1A[0x2];                                       // 0x001A(0x0002)(Fixing Size After Last Property [ Rei-SdkDumper ])
	TDelegate<void()>                             Callback;                                          // 0x001C(0x0010)(Parm, ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_ScenarioStandardLittleGame_ListenForKeyAction;

// Function CharacterInteractionV3.ScenarioStandardLittleGame.PlayShowElementByCallback
// 0x0038 (0x0038 - 0x0000)
struct ScenarioStandardLittleGame_PlayShowElementByCallback final
{
public:
	class FString                                 ElementName;                                       // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 NextState;                                         // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void()>                             ShowElementPlayFinish;                             // 0x0020(0x0010)(Parm, ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bEndLastShowElement;                               // 0x0030(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_ScenarioStandardLittleGame_PlayShowElementByCallback;

// Function CharacterInteractionV3.ScenarioStandardLittleGame.PlayShowElementListByCallback
// 0x0038 (0x0038 - 0x0000)
struct ScenarioStandardLittleGame_PlayShowElementListByCallback final
{
public:
	TArray<class FString>                         InElements;                                        // 0x0000(0x0010)(ConstParm, Parm, ZeroConstructor, NativeAccessSpecifierPublic)
	class FString                                 NextState;                                         // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void()>                             ShowElementPlayFinish;                             // 0x0020(0x0010)(Parm, ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bEndLastShowElement;                               // 0x0030(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_ScenarioStandardLittleGame_PlayShowElementListByCallback;

// Function CharacterInteractionV3.ScenarioStandardLittleGame.SetInputModeGameAndUI
// 0x0001 (0x0001 - 0x0000)
struct ScenarioStandardLittleGame_SetInputModeGameAndUI final
{
public:
	EMouseLockMode                                MouseLockMode;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ScenarioStandardLittleGame_SetInputModeGameAndUI;

// Function CharacterInteractionV3.ScenarioStandardLittleGame.StopListenForKeyAction
// 0x0020 (0x0020 - 0x0000)
struct ScenarioStandardLittleGame_StopListenForKeyAction final
{
public:
	struct FKey                                   InKey;                                             // 0x0000(0x0018)(ConstParm, Parm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EInputEvent                                   EventType;                                         // 0x0018(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_ScenarioStandardLittleGame_StopListenForKeyAction;

// Function CharacterInteractionV3.ScenarioStandardLittleGame.StopListeningForHandle
// 0x0004 (0x0004 - 0x0000)
struct ScenarioStandardLittleGame_StopListeningForHandle final
{
public:
	int32                                         InHandle;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ScenarioStandardLittleGame_StopListeningForHandle;

// Function CharacterInteractionV3.ScenarioStandardLittleGame.StopListeningForInputAction
// 0x000C (0x000C - 0x0000)
struct ScenarioStandardLittleGame_StopListeningForInputAction final
{
public:
	class FName                                   ActionName;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EInputEvent                                   EventType;                                         // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_ScenarioStandardLittleGame_StopListeningForInputAction;

// Function CharacterInteractionV3.FennyGunFireLittleGame.GetVoiceTipCfg
// 0x0060 (0x0060 - 0x0000)
struct FennyGunFireLittleGame_GetVoiceTipCfg final
{
public:
	int32                                         InId;                                              // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Rei-SdkDumper ])
	struct FFennyVoiceTipCfg                      ReturnValue;                                       // 0x0008(0x0058)(ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FennyGunFireLittleGame_GetVoiceTipCfg;

// Function CharacterInteractionV3.FennyGunFireLittleGame.RandomVoice
// 0x0004 (0x0004 - 0x0000)
struct FennyGunFireLittleGame_RandomVoice final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FennyGunFireLittleGame_RandomVoice;

// Function CharacterInteractionV3.InteractionV3DragInterface.EndDrag
// 0x0040 (0x0040 - 0x0000)
struct InteractionV3DragInterface_EndDrag final
{
public:
	struct FTransform                             TargetTransform;                                   // 0x0000(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector                                DeltaLocation;                                     // 0x0030(0x000C)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_InteractionV3DragInterface_EndDrag;

// Function CharacterInteractionV3.InteractionV3DragInterface.StartDrag
// 0x0040 (0x0040 - 0x0000)
struct InteractionV3DragInterface_StartDrag final
{
public:
	struct FTransform                             TargetTransform;                                   // 0x0000(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector                                DeltaLocation;                                     // 0x0030(0x000C)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_InteractionV3DragInterface_StartDrag;

// Function CharacterInteractionV3.InteractionV3DragInterface.UpdateDrag
// 0x0040 (0x0040 - 0x0000)
struct InteractionV3DragInterface_UpdateDrag final
{
public:
	struct FTransform                             TargetTransform;                                   // 0x0000(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector                                DeltaLocation;                                     // 0x0030(0x000C)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_InteractionV3DragInterface_UpdateDrag;

// Function CharacterInteractionV3.InteractionArchivementComponentV3.PlayArchivement
// 0x0004 (0x0004 - 0x0000)
struct InteractionArchivementComponentV3_PlayArchivement final
{
public:
	int32                                         InId;                                              // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InteractionArchivementComponentV3_PlayArchivement;

// Function CharacterInteractionV3.InteractionArchivementComponentV3.SetArchievementPlayed
// 0x0004 (0x0004 - 0x0000)
struct InteractionArchivementComponentV3_SetArchievementPlayed final
{
public:
	int32                                         InId;                                              // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InteractionArchivementComponentV3_SetArchievementPlayed;

// Function CharacterInteractionV3.InteractionArchivementComponentV3.SetArchivementComplete
// 0x0004 (0x0004 - 0x0000)
struct InteractionArchivementComponentV3_SetArchivementComplete final
{
public:
	int32                                         InId;                                              // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InteractionArchivementComponentV3_SetArchivementComplete;

// Function CharacterInteractionV3.InteractionArchivementComponentV3.SetConditionComplete
// 0x0004 (0x0004 - 0x0000)
struct InteractionArchivementComponentV3_SetConditionComplete final
{
public:
	int32                                         InId;                                              // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InteractionArchivementComponentV3_SetConditionComplete;

// Function CharacterInteractionV3.InteractionArchivementComponentV3.SetConditionCompleteAdnRefresh
// 0x0004 (0x0004 - 0x0000)
struct InteractionArchivementComponentV3_SetConditionCompleteAdnRefresh final
{
public:
	int32                                         InId;                                              // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InteractionArchivementComponentV3_SetConditionCompleteAdnRefresh;

// Function CharacterInteractionV3.InteractionArchivementComponentV3.CanPlay
// 0x0008 (0x0008 - 0x0000)
struct InteractionArchivementComponentV3_CanPlay final
{
public:
	int32                                         InId;                                              // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_InteractionArchivementComponentV3_CanPlay;

// Function CharacterInteractionV3.InteractionArchivementComponentV3.IsArchivementComplete
// 0x0008 (0x0008 - 0x0000)
struct InteractionArchivementComponentV3_IsArchivementComplete final
{
public:
	int32                                         InId;                                              // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_InteractionArchivementComponentV3_IsArchivementComplete;

// Function CharacterInteractionV3.InteractionArchivementComponentV3.IsArchivementPlayed
// 0x0008 (0x0008 - 0x0000)
struct InteractionArchivementComponentV3_IsArchivementPlayed final
{
public:
	int32                                         InId;                                              // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_InteractionArchivementComponentV3_IsArchivementPlayed;

// Function CharacterInteractionV3.InteractionArchivementComponentV3.IsConditionComplete
// 0x0008 (0x0008 - 0x0000)
struct InteractionArchivementComponentV3_IsConditionComplete final
{
public:
	int32                                         InId;                                              // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_InteractionArchivementComponentV3_IsConditionComplete;

// Function CharacterInteractionV3.FennyShowerLittleGame.GetCameraAdditivePitchAndYaw
// 0x0008 (0x0008 - 0x0000)
struct FennyShowerLittleGame_GetCameraAdditivePitchAndYaw final
{
public:
	float                                         OutPitch;                                          // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         OutYaw;                                            // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FennyShowerLittleGame_GetCameraAdditivePitchAndYaw;

// Function CharacterInteractionV3.FennyShowerLittleGame.GetCanActiveCamera
// 0x0001 (0x0001 - 0x0000)
struct FennyShowerLittleGame_GetCanActiveCamera final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FennyShowerLittleGame_GetCanActiveCamera;

// Function CharacterInteractionV3.FennyShowerLittleGame.PlayStandBy
// 0x0004 (0x0004 - 0x0000)
struct FennyShowerLittleGame_PlayStandBy final
{
public:
	int32                                         idx;                                               // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FennyShowerLittleGame_PlayStandBy;

// Function CharacterInteractionV3.FennyShowerLittleGame.SetCanActiveCamera
// 0x0001 (0x0001 - 0x0000)
struct FennyShowerLittleGame_SetCanActiveCamera final
{
public:
	bool                                          bCan;                                              // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FennyShowerLittleGame_SetCanActiveCamera;

// Function CharacterInteractionV3.FennyShowerLittleGame.SetStandByInfo
// 0x0004 (0x0004 - 0x0000)
struct FennyShowerLittleGame_SetStandByInfo final
{
public:
	int32                                         idx;                                               // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FennyShowerLittleGame_SetStandByInfo;

// Function CharacterInteractionV3.InteractionActorV3.BindOperateActEvent
// 0x0020 (0x0020 - 0x0000)
struct InteractionActorV3_BindOperateActEvent final
{
public:
	class FString                                 ActorOperateActName;                               // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(const class FString& ActorOperateActName, float DeltaSeconds, class UActorOperateAct* ActorOperateAct, EInteractionV3OperateEventType EventType)> Delegate; // 0x0010(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InteractionActorV3_BindOperateActEvent;

// Function CharacterInteractionV3.InteractionActorV3.OnOperateEnd
// 0x0018 (0x0018 - 0x0000)
struct InteractionActorV3_OnOperateEnd final
{
public:
	class FString                                 ActorOperateActName;                               // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UActorOperateAct*                       ActorOperateAct;                                   // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InteractionActorV3_OnOperateEnd;

// Function CharacterInteractionV3.InteractionActorV3.OnOperateStart
// 0x0018 (0x0018 - 0x0000)
struct InteractionActorV3_OnOperateStart final
{
public:
	class FString                                 ActorOperateActName;                               // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UActorOperateAct*                       ActorOperateAct;                                   // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InteractionActorV3_OnOperateStart;

// Function CharacterInteractionV3.InteractionActorV3.OnOperateUpdate
// 0x0020 (0x0020 - 0x0000)
struct InteractionActorV3_OnOperateUpdate final
{
public:
	class FString                                 ActorOperateActName;                               // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DeltaSeconds;                                      // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Rei-SdkDumper ])
	class UActorOperateAct*                       ActorOperateAct;                                   // 0x0018(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InteractionActorV3_OnOperateUpdate;

// Function CharacterInteractionV3.InteractionActorV3.PlayWeightedVoice
// 0x0048 (0x0048 - 0x0000)
struct InteractionActorV3_PlayWeightedVoice final
{
public:
	struct FInteractionVoiceConfig                Config;                                            // 0x0000(0x0048)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InteractionActorV3_PlayWeightedVoice;

// Function CharacterInteractionV3.InteractionActorV3.PlayWeightedVoiceWithAnimInstance
// 0x0050 (0x0050 - 0x0000)
struct InteractionActorV3_PlayWeightedVoiceWithAnimInstance final
{
public:
	class UAnimInstance*                          AnimInstance;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FInteractionVoiceConfig                Config;                                            // 0x0008(0x0048)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InteractionActorV3_PlayWeightedVoiceWithAnimInstance;

// Function CharacterInteractionV3.InteractionActorV3.StopVoice
// 0x0008 (0x0008 - 0x0000)
struct InteractionActorV3_StopVoice final
{
public:
	int32                                         TransitionMS;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bInvokeCallback;                                   // 0x0004(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_InteractionActorV3_StopVoice;

// Function CharacterInteractionV3.InteractionActorV3.UnbindOperateActEvent
// 0x0010 (0x0010 - 0x0000)
struct InteractionActorV3_UnbindOperateActEvent final
{
public:
	class FString                                 ActorOperateActName;                               // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InteractionActorV3_UnbindOperateActEvent;

// Function CharacterInteractionV3.InteractionCameraActor.GetCameraActor
// 0x0008 (0x0008 - 0x0000)
struct InteractionCameraActor_GetCameraActor final
{
public:
	class AInteractionCameraActor*                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InteractionCameraActor_GetCameraActor;

// Function CharacterInteractionV3.InteractionCameraActor.GetAdditivePitchAndYaw
// 0x0008 (0x0008 - 0x0000)
struct InteractionCameraActor_GetAdditivePitchAndYaw final
{
public:
	float                                         OutPitch;                                          // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         OutYaw;                                            // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InteractionCameraActor_GetAdditivePitchAndYaw;

// Function CharacterInteractionV3.InteractionCameraActor.SetOperateConfig
// 0x0008 (0x0008 - 0x0000)
struct InteractionCameraActor_SetOperateConfig final
{
public:
	class FName                                   ID;                                                // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InteractionCameraActor_SetOperateConfig;

// Function CharacterInteractionV3.InteractionCameraActor.SetStandbyConfig
// 0x0008 (0x0008 - 0x0000)
struct InteractionCameraActor_SetStandbyConfig final
{
public:
	class FName                                   ID;                                                // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InteractionCameraActor_SetStandbyConfig;

// Function CharacterInteractionV3.InteractionCameraActor.GetDefaultViewInfo
// 0x05F0 (0x05F0 - 0x0000)
struct InteractionCameraActor_GetDefaultViewInfo final
{
public:
	struct FMinimalViewInfo                       ReturnValue;                                       // 0x0000(0x05F0)(ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InteractionCameraActor_GetDefaultViewInfo;

// Function CharacterInteractionV3.InteractionCameraInstance.AddInput
// 0x0008 (0x0008 - 0x0000)
struct InteractionCameraInstance_AddInput final
{
public:
	struct FVector2D                              Value;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InteractionCameraInstance_AddInput;

// Function CharacterInteractionV3.InteractionCameraInstance.SetOperateConfig
// 0x0008 (0x0008 - 0x0000)
struct InteractionCameraInstance_SetOperateConfig final
{
public:
	class FName                                   ID;                                                // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InteractionCameraInstance_SetOperateConfig;

// Function CharacterInteractionV3.InteractionCameraInstance.SetStandbyConfig
// 0x0008 (0x0008 - 0x0000)
struct InteractionCameraInstance_SetStandbyConfig final
{
public:
	class FName                                   ID;                                                // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InteractionCameraInstance_SetStandbyConfig;

// Function CharacterInteractionV3.InteractionSkeletalActorV3.GetInteractionCharacterAnimInstance
// 0x0008 (0x0008 - 0x0000)
struct InteractionSkeletalActorV3_GetInteractionCharacterAnimInstance final
{
public:
	class UInteractionV3CharacterAnimInstance*    ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InteractionSkeletalActorV3_GetInteractionCharacterAnimInstance;

// Function CharacterInteractionV3.InteractionCharacterV3.SetKawaiiBlendScale
// 0x0004 (0x0004 - 0x0000)
struct InteractionCharacterV3_SetKawaiiBlendScale final
{
public:
	float                                         KawaiiBlendScaleValue;                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InteractionCharacterV3_SetKawaiiBlendScale;

// Function CharacterInteractionV3.InteractionCharacterV3.GetInteractionCharacterFaceAnimInstance
// 0x0008 (0x0008 - 0x0000)
struct InteractionCharacterV3_GetInteractionCharacterFaceAnimInstance final
{
public:
	class UInteractionV3FaceAnimInstance*         ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InteractionCharacterV3_GetInteractionCharacterFaceAnimInstance;

// Function CharacterInteractionV3.InteractionCharacterV3.GetKawaiiAlphaValue
// 0x0004 (0x0004 - 0x0000)
struct InteractionCharacterV3_GetKawaiiAlphaValue final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InteractionCharacterV3_GetKawaiiAlphaValue;

// Function CharacterInteractionV3.InteractionV3InputCollision.IsInCollision
// 0x000C (0x000C - 0x0000)
struct InteractionV3InputCollision_IsInCollision final
{
public:
	struct FVector2D                              CheckPos;                                          // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_InteractionV3InputCollision_IsInCollision;

// Function CharacterInteractionV3.InteractionDirectorV3.GetInstance
// 0x0008 (0x0008 - 0x0000)
struct InteractionDirectorV3_GetInstance final
{
public:
	class AInteractionDirectorV3*                 ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InteractionDirectorV3_GetInstance;

// Function CharacterInteractionV3.InteractionDirectorV3.GetInteractionDirector
// 0x0010 (0x0010 - 0x0000)
struct InteractionDirectorV3_GetInteractionDirector final
{
public:
	const class UObject*                          WorldContextObject;                                // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AInteractionDirectorV3*                 ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InteractionDirectorV3_GetInteractionDirector;

// Function CharacterInteractionV3.InteractionDirectorV3.CreateInteractionActorFromName
// 0x0010 (0x0010 - 0x0000)
struct InteractionDirectorV3_CreateInteractionActorFromName final
{
public:
	class FName                                   ActorName;                                         // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AInteractionActorV3*                    ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InteractionDirectorV3_CreateInteractionActorFromName;

// Function CharacterInteractionV3.InteractionDirectorV3.CreateInteractionActorInScenario
// 0x0008 (0x0008 - 0x0000)
struct InteractionDirectorV3_CreateInteractionActorInScenario final
{
public:
	class FName                                   ScenarioName;                                      // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InteractionDirectorV3_CreateInteractionActorInScenario;

// Function CharacterInteractionV3.InteractionDirectorV3.EndScenarioShowElement
// 0x0008 (0x0008 - 0x0000)
struct InteractionDirectorV3_EndScenarioShowElement final
{
public:
	class FName                                   ShowElementName;                                   // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InteractionDirectorV3_EndScenarioShowElement;

// Function CharacterInteractionV3.InteractionDirectorV3.EnterScenario
// 0x0018 (0x0018 - 0x0000)
struct InteractionDirectorV3_EnterScenario final
{
public:
	class FString                                 ScenarioName;                                      // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_InteractionDirectorV3_EnterScenario;

// Function CharacterInteractionV3.InteractionDirectorV3.OnEnterScenario
// 0x0010 (0x0010 - 0x0000)
struct InteractionDirectorV3_OnEnterScenario final
{
public:
	class FString                                 ScenarioName;                                      // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InteractionDirectorV3_OnEnterScenario;

// Function CharacterInteractionV3.InteractionDirectorV3.PlayScenarioShowElement
// 0x0018 (0x0018 - 0x0000)
struct InteractionDirectorV3_PlayScenarioShowElement final
{
public:
