#pragma once

/*
* SDK generated by Rei-SdkDumper
* Based on Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CrashEye

#include "Basic.hpp"


namespace SDK::Params
{

// Function CrashEye.CrashEyeHelper.CrashAddExtraData
// 0x0020 (0x0020 - 0x0000)
struct CrashEyeHelper_CrashAddExtraData final
{
public:
	class FString                                 InKey;                                             // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 InValue;                                           // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CrashEyeHelper_CrashAddExtraData;

// Function CrashEye.CrashEyeHelper.CrashEyeLeaveBreadcrumb
// 0x0010 (0x0010 - 0x0000)
struct CrashEyeHelper_CrashEyeLeaveBreadcrumb final
{
public:
	class FString                                 Breadcrumb;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CrashEyeHelper_CrashEyeLeaveBreadcrumb;

// Function CrashEye.CrashEyeHelper.CrashEyeSendScriptException
// 0x0030 (0x0030 - 0x0000)
struct CrashEyeHelper_CrashEyeSendScriptException final
{
public:
	class FString                                 InErrorTitle;                                      // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 InStacktree;                                       // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 InLanguage;                                        // 0x0020(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CrashEyeHelper_CrashEyeSendScriptException;

// Function CrashEye.CrashEyeHelper.CrashEyeSetAppVersion
// 0x0010 (0x0010 - 0x0000)
struct CrashEyeHelper_CrashEyeSetAppVersion final
{
public:
	class FString                                 Version;                                           // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CrashEyeHelper_CrashEyeSetAppVersion;

// Function CrashEye.CrashEyeHelper.CrashEyeSetUserIdentifier
// 0x0010 (0x0010 - 0x0000)
struct CrashEyeHelper_CrashEyeSetUserIdentifier final
{
public:
	class FString                                 UserIdentifier;                                    // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CrashEyeHelper_CrashEyeSetUserIdentifier;

}

