#pragma once

/*
* SDK generated by Rei-SdkDumper
* Based on Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CrashEye

#include "Basic.hpp"

#include "Engine_classes.hpp"
#include "CoreUObject_classes.hpp"


namespace SDK
{

// Class CrashEye.CrashEyeHelper
// 0x0000 (0x0028 - 0x0028)
class UCrashEyeHelper final : public UBlueprintFunctionLibrary
{
public:
	static void CrashAddExtraData(const class FString& InKey, const class FString& InValue);
	static void CrashEyeLeaveBreadcrumb(const class FString& Breadcrumb);
	static void CrashEyeSendScriptException(const class FString& InErrorTitle, const class FString& InStacktree, const class FString& InLanguage);
	static void CrashEyeSetAppVersion(const class FString& Version);
	static void CrashEyeSetUserIdentifier(const class FString& UserIdentifier);
	static void CrashEyeTestCrash();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CrashEyeHelper")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CrashEyeHelper")
	}
	static class UCrashEyeHelper* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCrashEyeHelper>();
	}
};
DUMPER7_ASSERTS_UCrashEyeHelper;

// Class CrashEye.CrashEyeRuntimeSettings
// 0x0058 (0x0080 - 0x0028)
class UCrashEyeRuntimeSettings final : public UObject
{
public:
	bool                                          Andoird_bEnableCrashEye;                           // 0x0028(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Rei-SdkDumper ])
	class FString                                 Andoird_AppID;                                     // 0x0030(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Up_URL;                                            // 0x0040(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IOS_bEnableCrashEye;                               // 0x0050(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Rei-SdkDumper ])
	class FString                                 IOS_AppID;                                         // 0x0058(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Windows_bEnableCrashEye;                           // 0x0068(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Rei-SdkDumper ])
	class FString                                 Windows_AppID;                                     // 0x0070(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CrashEyeRuntimeSettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CrashEyeRuntimeSettings")
	}
	static class UCrashEyeRuntimeSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCrashEyeRuntimeSettings>();
	}
};
DUMPER7_ASSERTS_UCrashEyeRuntimeSettings;

}

