#pragma once

/*
* SDK generated by Rei-SdkDumper
* Based on Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DarkZone

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function DarkZone.DarkZoneActorInterface.InitActor
// 0x0018 (0x0018 - 0x0000)
struct DarkZoneActorInterface_InitActor final
{
public:
	int32                                         InActorId;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         State;                                             // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<float>                                 CustomParam;                                       // 0x0008(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DarkZoneActorInterface_InitActor;

// Function DarkZone.DarkZoneFogSwitchActor.ActiveCustomFog
// 0x0004 (0x0004 - 0x0000)
struct DarkZoneFogSwitchActor_ActiveCustomFog final
{
public:
	int32                                         InIndex;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DarkZoneFogSwitchActor_ActiveCustomFog;

// Function DarkZone.DarkZoneFogSwitchActor.Switch
// 0x000C (0x000C - 0x0000)
struct DarkZoneFogSwitchActor_Switch final
{
public:
	int32                                         A;                                                 // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         B;                                                 // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InProgress;                                        // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DarkZoneFogSwitchActor_Switch;

// Function DarkZone.DarkZoneGeneralTriggerRegion.GetList
// 0x0010 (0x0010 - 0x0000)
struct DarkZoneGeneralTriggerRegion_GetList final
{
public:
	TArray<class FString>                         ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DarkZoneGeneralTriggerRegion_GetList;

// Function DarkZone.DarkZoneMapPointMgr.GetSpawnActor
// 0x0010 (0x0010 - 0x0000)
struct DarkZoneMapPointMgr_GetSpawnActor final
{
public:
	int32                                         ActorId;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Rei-SdkDumper ])
	class AActor*                                 ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DarkZoneMapPointMgr_GetSpawnActor;

// Function DarkZone.DarkZoneMapPointMgr.OnDestroyActor
// 0x0004 (0x0004 - 0x0000)
struct DarkZoneMapPointMgr_OnDestroyActor final
{
public:
	int32                                         ActorId;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DarkZoneMapPointMgr_OnDestroyActor;

// Function DarkZone.DarkZoneMapPointMgr.TrySpawnActor
// 0x0010 (0x0010 - 0x0000)
struct DarkZoneMapPointMgr_TrySpawnActor final
{
public:
	int32                                         ActorId;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Rei-SdkDumper ])
	class AActor*                                 ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DarkZoneMapPointMgr_TrySpawnActor;

// Function DarkZone.DarkZonePatrolArea.GetRandomPos
// 0x000C (0x000C - 0x0000)
struct DarkZonePatrolArea_GetRandomPos final
{
public:
	struct FVector                                ReturnValue;                                       // 0x0000(0x000C)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DarkZonePatrolArea_GetRandomPos;

// Function DarkZone.DarkZoneSpecialLogic.AddGZ
// 0x0008 (0x0008 - 0x0000)
struct DarkZoneSpecialLogic_AddGZ final
{
public:
	int32                                         Val;                                               // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DarkZoneSpecialLogic_AddGZ;

// Function DarkZone.DarkZoneSpecialLogic.GetGZ
// 0x0004 (0x0004 - 0x0000)
struct DarkZoneSpecialLogic_GetGZ final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DarkZoneSpecialLogic_GetGZ;

// Function DarkZone.DarkZoneSpecialLogic.GetGZLevel
// 0x0004 (0x0004 - 0x0000)
struct DarkZoneSpecialLogic_GetGZLevel final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DarkZoneSpecialLogic_GetGZLevel;

// Function DarkZone.DarkZoneSpecialLogic.GetGZMax
// 0x0004 (0x0004 - 0x0000)
struct DarkZoneSpecialLogic_GetGZMax final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DarkZoneSpecialLogic_GetGZMax;

// Function DarkZone.DarkZoneSpecialLogic.GetGZSpeed
// 0x0004 (0x0004 - 0x0000)
struct DarkZoneSpecialLogic_GetGZSpeed final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DarkZoneSpecialLogic_GetGZSpeed;

// Function DarkZone.DarkZoneSpecialLogic.SetGZ
// 0x0004 (0x0004 - 0x0000)
struct DarkZoneSpecialLogic_SetGZ final
{
public:
	int32                                         Val;                                               // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DarkZoneSpecialLogic_SetGZ;

// Function DarkZone.DarkZoneSpecialLogic.SetGZLevelAndSpeed
// 0x0008 (0x0008 - 0x0000)
struct DarkZoneSpecialLogic_SetGZLevelAndSpeed final
{
public:
	int32                                         Level;                                             // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Speed;                                             // 0x0004(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DarkZoneSpecialLogic_SetGZLevelAndSpeed;

// Function DarkZone.DarkZoneSpecialLogic.SetGZMax
// 0x0004 (0x0004 - 0x0000)
struct DarkZoneSpecialLogic_SetGZMax final
{
public:
	int32                                         Val;                                               // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DarkZoneSpecialLogic_SetGZMax;

// Function DarkZone.DarkZoneSpecialLogic.SetGZRate
// 0x0004 (0x0004 - 0x0000)
struct DarkZoneSpecialLogic_SetGZRate final
{
public:
	float                                         Val;                                               // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DarkZoneSpecialLogic_SetGZRate;

// Function DarkZone.DarkZoneSystem.CanFreeRush
// 0x0001 (0x0001 - 0x0000)
struct DarkZoneSystem_CanFreeRush final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DarkZoneSystem_CanFreeRush;

// Function DarkZone.DarkZoneSystem.SetFreeRush
// 0x0001 (0x0001 - 0x0000)
struct DarkZoneSystem_SetFreeRush final
{
public:
	bool                                          CanFree;                                           // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DarkZoneSystem_SetFreeRush;

// Function DarkZone.DarkZoneTaskMgr.BeginTask
// 0x0028 (0x0028 - 0x0000)
struct DarkZoneTaskMgr_BeginTask final
{
public:
	int32                                         RegionId;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         TaskId;                                            // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 TaskPath;                                          // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 LevelStreamingPath;                                // 0x0018(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DarkZoneTaskMgr_BeginTask;

// Function DarkZone.DarkZoneTaskMgr.CheckRegionHasTask
// 0x0008 (0x0008 - 0x0000)
struct DarkZoneTaskMgr_CheckRegionHasTask final
{
public:
	int32                                         InRegionId;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_DarkZoneTaskMgr_CheckRegionHasTask;

// Function DarkZone.DarkZoneTaskMgr.GetCurrentRegionList
// 0x0010 (0x0010 - 0x0000)
struct DarkZoneTaskMgr_GetCurrentRegionList final
{
public:
	TArray<int32>                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DarkZoneTaskMgr_GetCurrentRegionList;

// Function DarkZone.DarkZoneTaskMgr.GetCurrentTaskCount
// 0x0004 (0x0004 - 0x0000)
struct DarkZoneTaskMgr_GetCurrentTaskCount final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DarkZoneTaskMgr_GetCurrentTaskCount;

// Function DarkZone.DarkZoneTaskMgr.GetCurrentTaskId
// 0x0008 (0x0008 - 0x0000)
struct DarkZoneTaskMgr_GetCurrentTaskId final
{
public:
	int32                                         InRegionId;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DarkZoneTaskMgr_GetCurrentTaskId;

// Function DarkZone.DarkZoneTaskMgr.GetNpcLevel
// 0x0004 (0x0004 - 0x0000)
struct DarkZoneTaskMgr_GetNpcLevel final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DarkZoneTaskMgr_GetNpcLevel;

// Function DarkZone.DarkZoneTaskMgr.GetTaskDuration
// 0x0008 (0x0008 - 0x0000)
struct DarkZoneTaskMgr_GetTaskDuration final
{
public:
	int32                                         InRegionId;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DarkZoneTaskMgr_GetTaskDuration;

// Function DarkZone.DarkZoneTaskMgr.NotifyTaskBegin
// 0x0008 (0x0008 - 0x0000)
struct DarkZoneTaskMgr_NotifyTaskBegin final
{
public:
	class AGameTaskActor*                         InTaskActor;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DarkZoneTaskMgr_NotifyTaskBegin;

// Function DarkZone.DarkZoneTaskMgr.OnTaskFailedMain
// 0x0008 (0x0008 - 0x0000)
struct DarkZoneTaskMgr_OnTaskFailedMain final
{
public:
	class AGameTaskActor*                         InTaskActor;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DarkZoneTaskMgr_OnTaskFailedMain;

// Function DarkZone.DarkZoneTaskMgr.OnTaskFailedSimple
// 0x0008 (0x0008 - 0x0000)
struct DarkZoneTaskMgr_OnTaskFailedSimple final
{
public:
	class AGameTaskActor*                         InTaskActor;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DarkZoneTaskMgr_OnTaskFailedSimple;

// Function DarkZone.DarkZoneTaskMgr.OnTaskFinishSimple
// 0x0008 (0x0008 - 0x0000)
struct DarkZoneTaskMgr_OnTaskFinishSimple final
{
public:
	class AGameTaskActor*                         InTaskActor;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DarkZoneTaskMgr_OnTaskFinishSimple;

// Function DarkZone.DarkZoneTaskMgr.SetMainTaskActor
// 0x0008 (0x0008 - 0x0000)
struct DarkZoneTaskMgr_SetMainTaskActor final
{
public:
	class AGameTaskActor*                         InTaskActor;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DarkZoneTaskMgr_SetMainTaskActor;

// Function DarkZone.DarkZoneTaskMgr.StopAllTask
// 0x0001 (0x0001 - 0x0000)
struct DarkZoneTaskMgr_StopAllTask final
{
public:
	bool                                          IsUnloadLevel;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DarkZoneTaskMgr_StopAllTask;

// Function DarkZone.DarkZoneTaskMgr.StopRegionTask
// 0x0008 (0x0008 - 0x0000)
struct DarkZoneTaskMgr_StopRegionTask final
{
public:
	int32                                         InRegionId;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsUnloadLevel;                                     // 0x0004(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_DarkZoneTaskMgr_StopRegionTask;

}

