#pragma once

/*
* SDK generated by Rei-SdkDumper
* Based on Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DarkZone

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "Engine_classes.hpp"
#include "DarkZone_structs.hpp"
#include "GameTask_structs.hpp"
#include "AIModule_classes.hpp"


namespace SDK
{

// Class DarkZone.DarkZoneActorInterface
// 0x0000 (0x0000 - 0x0000)
class IDarkZoneActorInterface final
{
public:
	void InitActor(int32 InActorId, int32 State, const TArray<float>& CustomParam);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DarkZoneActorInterface")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DarkZoneActorInterface")
	}
	static class IDarkZoneActorInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IDarkZoneActorInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IDarkZoneActorInterface;

// Class DarkZone.DarkZoneFogActor
// 0x0018 (0x0240 - 0x0228)
class ADarkZoneFogActor final : public AActor
{
public:
	int32                                         Index_0;                                           // 0x0228(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_22C[0x4];                                      // 0x022C(0x0004)(Fixing Size After Last Property [ Rei-SdkDumper ])
	class FString                                 Explain;                                           // 0x0230(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DarkZoneFogActor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DarkZoneFogActor")
	}
	static class ADarkZoneFogActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<ADarkZoneFogActor>();
	}
};
DUMPER7_ASSERTS_ADarkZoneFogActor;

// Class DarkZone.DarkZoneFogSwitchActor
// 0x0038 (0x0260 - 0x0228)
class ADarkZoneFogSwitchActor final : public AActor
{
public:
	class UDarkZoneSystem*                        System;                                            // 0x0228(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TotalSwitchTime;                                   // 0x0230(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_234[0x2C];                                     // 0x0234(0x002C)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])

public:
	void ActiveCustomFog(int32 InIndex);
	void Switch(int32 A, int32 B, float InProgress);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DarkZoneFogSwitchActor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DarkZoneFogSwitchActor")
	}
	static class ADarkZoneFogSwitchActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<ADarkZoneFogSwitchActor>();
	}
};
DUMPER7_ASSERTS_ADarkZoneFogSwitchActor;

// Class DarkZone.DarkZoneGeneralTriggerRegion
// 0x0030 (0x0258 - 0x0228)
class ADarkZoneGeneralTriggerRegion final : public AActor
{
public:
	class FString                                 Type;                                              // 0x0228(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         RegionId;                                          // 0x0238(0x0004)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         FogLevel;                                          // 0x023C(0x0004)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         FogLayer;                                          // 0x0240(0x0004)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_244[0x4];                                      // 0x0244(0x0004)(Fixing Size After Last Property [ Rei-SdkDumper ])
	struct FDarkZoneRegionExportButton            Export;                                            // 0x0248(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          ShowRegion;                                        // 0x0249(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          ShowFogLevel;                                      // 0x024A(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_24B[0xD];                                      // 0x024B(0x000D)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])

public:
	void OnEntryRegion();
	void OnExitRegion();

	TArray<class FString> GetList() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DarkZoneGeneralTriggerRegion")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DarkZoneGeneralTriggerRegion")
	}
	static class ADarkZoneGeneralTriggerRegion* GetDefaultObj()
	{
		return GetDefaultObjImpl<ADarkZoneGeneralTriggerRegion>();
	}
};
DUMPER7_ASSERTS_ADarkZoneGeneralTriggerRegion;

// Class DarkZone.DarkZoneMapPointMgr
// 0x00F8 (0x0320 - 0x0228)
class ADarkZoneMapPointMgr final : public AActor
{
public:
	uint8                                         Pad_228[0xA0];                                     // 0x0228(0x00A0)(Fixing Size After Last Property [ Rei-SdkDumper ])
	TMap<int32, TWeakObjectPtr<class AActor>>     AllSpawnActor;                                     // 0x02C8(0x0050)(Transient, UObjectWrapper, NativeAccessSpecifierPrivate)
	uint8                                         Pad_318[0x8];                                      // 0x0318(0x0008)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])

public:
	class AActor* GetSpawnActor(int32 ActorId);
	void OnDestroyActor(int32 ActorId);
	class AActor* TrySpawnActor(int32 ActorId);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DarkZoneMapPointMgr")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DarkZoneMapPointMgr")
	}
	static class ADarkZoneMapPointMgr* GetDefaultObj()
	{
		return GetDefaultObjImpl<ADarkZoneMapPointMgr>();
	}
};
DUMPER7_ASSERTS_ADarkZoneMapPointMgr;

// Class DarkZone.DarkZoneNavLinkProxy
// 0x0028 (0x02A0 - 0x0278)
class ADarkZoneNavLinkProxy final : public ANavLinkProxy
{
public:
	TArray<struct FVector>                        TargetArray;                                       // 0x0278(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          IsClosed;                                          // 0x0288(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_289[0x3];                                      // 0x0289(0x0003)(Fixing Size After Last Property [ Rei-SdkDumper ])
	float                                         Interval;                                          // 0x028C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_290[0x10];                                     // 0x0290(0x0010)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])

public:
	void AutoFill();
	void Clear();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DarkZoneNavLinkProxy")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DarkZoneNavLinkProxy")
	}
	static class ADarkZoneNavLinkProxy* GetDefaultObj()
	{
		return GetDefaultObjImpl<ADarkZoneNavLinkProxy>();
	}
};
DUMPER7_ASSERTS_ADarkZoneNavLinkProxy;

// Class DarkZone.DarkZonePatrolArea
// 0x0010 (0x0238 - 0x0228)
class ADarkZonePatrolArea final : public AActor
{
public:
	class UCapsuleComponent*                      Capsule;                                           // 0x0228(0x0008)(Edit, ExportObject, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              IdleTimeRange;                                     // 0x0230(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	struct FVector GetRandomPos();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DarkZonePatrolArea")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DarkZonePatrolArea")
	}
	static class ADarkZonePatrolArea* GetDefaultObj()
	{
		return GetDefaultObjImpl<ADarkZonePatrolArea>();
	}
};
DUMPER7_ASSERTS_ADarkZonePatrolArea;

// Class DarkZone.DarkZoneMapPoint
// 0x0038 (0x0260 - 0x0228)
class ADarkZoneMapPoint final : public AActor
{
public:
	int32                                         Type;                                              // 0x0228(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ID;                                                // 0x022C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<int32>                                 CustomParam;                                       // 0x0230(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	struct FDarkZonePointTypeComboBox             TypeComboBox;                                      // 0x0240(0x0004)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FDarkZonePointInteractionComboBox      InteractionComboBox;                               // 0x0244(0x0004)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FDarkZonePointExportButton             Export;                                            // 0x0248(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_249[0x7];                                      // 0x0249(0x0007)(Fixing Size After Last Property [ Rei-SdkDumper ])
	class AActor*                                 SpawnActor;                                        // 0x0250(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ADarkZoneMapPointMgr*                   Mgr;                                               // 0x0258(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DarkZoneMapPoint")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DarkZoneMapPoint")
	}
	static class ADarkZoneMapPoint* GetDefaultObj()
	{
		return GetDefaultObjImpl<ADarkZoneMapPoint>();
	}
};
DUMPER7_ASSERTS_ADarkZoneMapPoint;

// Class DarkZone.DarkZoneNpcPoint
// 0x0038 (0x0260 - 0x0228)
class ADarkZoneNpcPoint final : public AActor
{
public:
	struct FDarkZoneNpcPointExportButton          Export;                                            // 0x0228(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_229[0x3];                                      // 0x0229(0x0003)(Fixing Size After Last Property [ Rei-SdkDumper ])
	int32                                         DropGroup;                                         // 0x022C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UArrowComponent*                        ArrowComponent;                                    // 0x0230(0x0008)(Edit, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_238[0x28];                                     // 0x0238(0x0028)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DarkZoneNpcPoint")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DarkZoneNpcPoint")
	}
	static class ADarkZoneNpcPoint* GetDefaultObj()
	{
		return GetDefaultObjImpl<ADarkZoneNpcPoint>();
	}
};
DUMPER7_ASSERTS_ADarkZoneNpcPoint;

// Class DarkZone.DarkZoneRegionMgr
// 0x0028 (0x0250 - 0x0228)
class ADarkZoneRegionMgr final : public AActor
{
public:
	uint8                                         Pad_228[0x28];                                     // 0x0228(0x0028)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DarkZoneRegionMgr")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DarkZoneRegionMgr")
	}
	static class ADarkZoneRegionMgr* GetDefaultObj()
	{
		return GetDefaultObjImpl<ADarkZoneRegionMgr>();
	}
};
DUMPER7_ASSERTS_ADarkZoneRegionMgr;

// Class DarkZone.DarkZoneSettingSystem
// 0x0150 (0x0180 - 0x0030)
class UDarkZoneSettingSystem final : public UGameInstanceSubsystem
{
public:
	uint8                                         Pad_30[0x150];                                     // 0x0030(0x0150)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DarkZoneSettingSystem")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DarkZoneSettingSystem")
	}
	static class UDarkZoneSettingSystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDarkZoneSettingSystem>();
	}
};
DUMPER7_ASSERTS_UDarkZoneSettingSystem;

// Class DarkZone.DarkZoneSpecialLogic
// 0x0020 (0x0248 - 0x0228)
class ADarkZoneSpecialLogic final : public AActor
{
public:
	uint8                                         Pad_228[0x20];                                     // 0x0228(0x0020)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])

public:
	int32 AddGZ(int32 Val);
	int32 GetGZ();
	int32 GetGZLevel();
	int32 GetGZMax();
	int32 GetGZSpeed();
	void SetGZ(const int32 Val);
	void SetGZLevelAndSpeed(const int32 Level, const int32 Speed);
	void SetGZMax(const int32 Val);
	void SetGZRate(const float Val);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DarkZoneSpecialLogic")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DarkZoneSpecialLogic")
	}
	static class ADarkZoneSpecialLogic* GetDefaultObj()
	{
		return GetDefaultObjImpl<ADarkZoneSpecialLogic>();
	}
};
DUMPER7_ASSERTS_ADarkZoneSpecialLogic;

// Class DarkZone.DarkZoneSystem
// 0x0120 (0x0150 - 0x0030)
class UDarkZoneSystem final : public UWorldSubsystem
{
public:
	TSet<TWeakObjectPtr<class AActor>>            WaitDestroyActorList;                              // 0x0030(0x0050)(Transient, UObjectWrapper, NativeAccessSpecifierPublic)
	uint8                                         Pad_80[0x88];                                      // 0x0080(0x0088)(Fixing Size After Last Property [ Rei-SdkDumper ])
	EDarkZoneType                                 PlayType;                                          // 0x0108(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_109[0x7];                                      // 0x0109(0x0007)(Fixing Size After Last Property [ Rei-SdkDumper ])
	class ADarkZoneTaskMgr*                       TaskMgr;                                           // 0x0110(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UDarkZoneSettingSystem*                 Setting;                                           // 0x0118(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ADarkZoneMapPointMgr*                   MapPointMgr;                                       // 0x0120(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ADarkZoneRegionMgr*                     RegionMgr;                                         // 0x0128(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ADarkZoneFogSwitchActor*                FogSwitch;                                         // 0x0130(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 SpecialLogic;                                      // 0x0138(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_140[0x10];                                     // 0x0140(0x0010)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])

public:
	bool CanFreeRush();
	void SetFreeRush(const bool CanFree);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DarkZoneSystem")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DarkZoneSystem")
	}
	static class UDarkZoneSystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDarkZoneSystem>();
	}
};
DUMPER7_ASSERTS_UDarkZoneSystem;

// Class DarkZone.DarkZoneTaskMgr
// 0x0118 (0x0340 - 0x0228)
class ADarkZoneTaskMgr final : public AActor
{
public:
	TDelegate<void(int32 RegionId, int32 TaskId)> NotifyTaskComplete;                                // 0x0228(0x0010)(ZeroConstructor, Transient, InstancedReference, NoDestructor, NativeAccessSpecifierPublic)
	TDelegate<void(int32 RegionId, int32 TaskId, ELevelFailedReason Reason)> NotifyTaskFailed;       // 0x0238(0x0010)(ZeroConstructor, Transient, InstancedReference, NoDestructor, NativeAccessSpecifierPublic)
	TDelegate<void(int32 RegionId, bool IsAuto)>  NotifyEntryRegion;                                 // 0x0248(0x0010)(ZeroConstructor, Transient, InstancedReference, NoDestructor, NativeAccessSpecifierPublic)
	TDelegate<void(int32 Reason)>                 NotifyMainTaskFailed;                              // 0x0258(0x0010)(ZeroConstructor, Transient, InstancedReference, NoDestructor, NativeAccessSpecifierPublic)
	TDelegate<void(int32 RegionId)>               NotifyExitEntryRegion;                             // 0x0268(0x0010)(ZeroConstructor, Transient, InstancedReference, NoDestructor, NativeAccessSpecifierPublic)
	TDelegate<void(int32 RegionId)>               NotifyExitRegion;                                  // 0x0278(0x0010)(ZeroConstructor, Transient, InstancedReference, NoDestructor, NativeAccessSpecifierPublic)
	TDelegate<void(int32 RegionId)>               NotifyEntryActiveRegion;                           // 0x0288(0x0010)(ZeroConstructor, Transient, InstancedReference, NoDestructor, NativeAccessSpecifierPublic)
	TDelegate<void(int32 OldId, int32 NewId)>     NotifyFogChanged;                                  // 0x0298(0x0010)(ZeroConstructor, Transient, InstancedReference, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          DontFlushLevelStreaming;                           // 0x02A8(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ManualRemoveStreamingLevel;                        // 0x02A9(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsInited;                                          // 0x02AA(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2AB[0x95];                                     // 0x02AB(0x0095)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])

public:
	void BeginTask(int32 RegionId, int32 TaskId, const class FString& TaskPath, const class FString& LevelStreamingPath);
	bool CheckRegionHasTask(int32 InRegionId);
	TArray<int32> GetCurrentRegionList();
	int32 GetCurrentTaskCount();
	int32 GetCurrentTaskId(int32 InRegionId);
	int32 GetNpcLevel();
	float GetTaskDuration(int32 InRegionId);
	void NotifyChildLevelHidden();
	void NotifyChildLevelVisible();
	void NotifyTaskBegin(class AGameTaskActor* InTaskActor);
	void OnTaskFailedMain(class AGameTaskActor* InTaskActor);
	void OnTaskFailedSimple(class AGameTaskActor* InTaskActor);
	void OnTaskFinishSimple(class AGameTaskActor* InTaskActor);
	void SetMainTaskActor(class AGameTaskActor* InTaskActor);
	void StopAllTask(bool IsUnloadLevel);
	void StopRegionTask(int32 InRegionId, bool IsUnloadLevel);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DarkZoneTaskMgr")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DarkZoneTaskMgr")
	}
	static class ADarkZoneTaskMgr* GetDefaultObj()
	{
		return GetDefaultObjImpl<ADarkZoneTaskMgr>();
	}
};
DUMPER7_ASSERTS_ADarkZoneTaskMgr;

// Class DarkZone.DarkZoneTaskRegion
// 0x0018 (0x0240 - 0x0228)
class ADarkZoneTaskRegion : public AActor
{
public:
	int32                                         RegionId;                                          // 0x0228(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FDarkZoneRegionExportButton            Export;                                            // 0x022C(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_22D[0x3];                                      // 0x022D(0x0003)(Fixing Size After Last Property [ Rei-SdkDumper ])
	struct FDarkZoneRegionPreviewButton           Preview;                                           // 0x0230(0x0004)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_234[0xC];                                      // 0x0234(0x000C)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DarkZoneTaskRegion")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DarkZoneTaskRegion")
	}
	static class ADarkZoneTaskRegion* GetDefaultObj()
	{
		return GetDefaultObjImpl<ADarkZoneTaskRegion>();
	}
};
DUMPER7_ASSERTS_ADarkZoneTaskRegion;

// Class DarkZone.DarkZoneTaskRegionEntry
// 0x0000 (0x0240 - 0x0240)
class ADarkZoneTaskRegionEntry final : public ADarkZoneTaskRegion
{
public:
	void OnEntryRegion();
	void OnExitRegion();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DarkZoneTaskRegionEntry")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DarkZoneTaskRegionEntry")
	}
	static class ADarkZoneTaskRegionEntry* GetDefaultObj()
	{
		return GetDefaultObjImpl<ADarkZoneTaskRegionEntry>();
	}
};
DUMPER7_ASSERTS_ADarkZoneTaskRegionEntry;

// Class DarkZone.DarkZoneTaskRegionActive
// 0x0000 (0x0240 - 0x0240)
class ADarkZoneTaskRegionActive final : public ADarkZoneTaskRegion
{
public:
	void OnEntryRegion();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DarkZoneTaskRegionActive")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DarkZoneTaskRegionActive")
	}
	static class ADarkZoneTaskRegionActive* GetDefaultObj()
	{
		return GetDefaultObjImpl<ADarkZoneTaskRegionActive>();
	}
};
DUMPER7_ASSERTS_ADarkZoneTaskRegionActive;

// Class DarkZone.DarkZoneTaskRegionExit
// 0x0000 (0x0240 - 0x0240)
class ADarkZoneTaskRegionExit final : public ADarkZoneTaskRegion
{
public:
	void OnEntryRegion();
	void OnExitRegion();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DarkZoneTaskRegionExit")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DarkZoneTaskRegionExit")
	}
	static class ADarkZoneTaskRegionExit* GetDefaultObj()
	{
		return GetDefaultObjImpl<ADarkZoneTaskRegionExit>();
	}
};
DUMPER7_ASSERTS_ADarkZoneTaskRegionExit;

// Class DarkZone.SlopeNavLinkProxy
// 0x0008 (0x0280 - 0x0278)
class ASlopeNavLinkProxy final : public ANavLinkProxy
{
public:
	float                                         Interval;                                          // 0x0278(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_27C[0x4];                                      // 0x027C(0x0004)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])

public:
	void AutoFill();
	void Clear();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SlopeNavLinkProxy")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SlopeNavLinkProxy")
	}
	static class ASlopeNavLinkProxy* GetDefaultObj()
	{
		return GetDefaultObjImpl<ASlopeNavLinkProxy>();
	}
};
DUMPER7_ASSERTS_ASlopeNavLinkProxy;

}

