#pragma once

/*
* SDK generated by Rei-SdkDumper
* Based on Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DarkZone

#include "Basic.hpp"


namespace SDK
{

// Enum DarkZone.EDarkZoneType
// NumValues: 0x0003
enum class EDarkZoneType : uint8
{
	DarkZone                                 = 0,
	Explore                                  = 1,
	EDarkZoneType_MAX                        = 2,
};

// ScriptStruct DarkZone.DarkZoneRegionPreviewButton
// 0x0004 (0x0004 - 0x0000)
struct FDarkZoneRegionPreviewButton final
{
public:
	int32                                         OverrideButton;                                    // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FDarkZoneRegionPreviewButton;

// ScriptStruct DarkZone.DarkZoneRegionExportButton
// 0x0001 (0x0001 - 0x0000)
struct FDarkZoneRegionExportButton final
{
public:
	uint8                                         Pad_0[0x1];                                        // 0x0000(0x0001)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_FDarkZoneRegionExportButton;

// ScriptStruct DarkZone.DarkZoneNavLinkProxyUI
// 0x0001 (0x0001 - 0x0000)
struct FDarkZoneNavLinkProxyUI final
{
public:
	uint8                                         Pad_0[0x1];                                        // 0x0000(0x0001)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_FDarkZoneNavLinkProxyUI;

// ScriptStruct DarkZone.DarkZoneNpcPointExportButton
// 0x0001 (0x0001 - 0x0000)
struct FDarkZoneNpcPointExportButton final
{
public:
	uint8                                         Pad_0[0x1];                                        // 0x0000(0x0001)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_FDarkZoneNpcPointExportButton;

// ScriptStruct DarkZone.DarkZonePointInteractionComboBox
// 0x0004 (0x0004 - 0x0000)
struct FDarkZonePointInteractionComboBox final
{
public:
	int32                                         OverrideButton;                                    // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FDarkZonePointInteractionComboBox;

// ScriptStruct DarkZone.DarkZonePointTypeComboBox
// 0x0004 (0x0004 - 0x0000)
struct FDarkZonePointTypeComboBox final
{
public:
	int32                                         OverrideButton;                                    // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FDarkZonePointTypeComboBox;

// ScriptStruct DarkZone.DarkZonePointExportButton
// 0x0001 (0x0001 - 0x0000)
struct FDarkZonePointExportButton final
{
public:
	uint8                                         Pad_0[0x1];                                        // 0x0000(0x0001)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_FDarkZonePointExportButton;

}

