#pragma once

/*
* SDK generated by Rei-SdkDumper
* Based on Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DatasmithContent

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "DatasmithContent_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class DatasmithContent.DatasmithAssetImportData
// 0x0000 (0x0028 - 0x0028)
class UDatasmithAssetImportData : public UAssetImportData
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DatasmithAssetImportData")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DatasmithAssetImportData")
	}
	static class UDatasmithAssetImportData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDatasmithAssetImportData>();
	}
};
DUMPER7_ASSERTS_UDatasmithAssetImportData;

// Class DatasmithContent.DatasmithStaticMeshImportData
// 0x0000 (0x0028 - 0x0028)
class UDatasmithStaticMeshImportData : public UDatasmithAssetImportData
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DatasmithStaticMeshImportData")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DatasmithStaticMeshImportData")
	}
	static class UDatasmithStaticMeshImportData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDatasmithStaticMeshImportData>();
	}
};
DUMPER7_ASSERTS_UDatasmithStaticMeshImportData;

// Class DatasmithContent.DatasmithStaticMeshCADImportData
// 0x0000 (0x0028 - 0x0028)
class UDatasmithStaticMeshCADImportData final : public UDatasmithStaticMeshImportData
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DatasmithStaticMeshCADImportData")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DatasmithStaticMeshCADImportData")
	}
	static class UDatasmithStaticMeshCADImportData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDatasmithStaticMeshCADImportData>();
	}
};
DUMPER7_ASSERTS_UDatasmithStaticMeshCADImportData;

// Class DatasmithContent.DatasmithObjectTemplate
// 0x0008 (0x0030 - 0x0028)
class UDatasmithObjectTemplate : public UObject
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DatasmithObjectTemplate")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DatasmithObjectTemplate")
	}
	static class UDatasmithObjectTemplate* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDatasmithObjectTemplate>();
	}
};
DUMPER7_ASSERTS_UDatasmithObjectTemplate;

// Class DatasmithContent.DatasmithActorTemplate
// 0x00A0 (0x00D0 - 0x0030)
class UDatasmithActorTemplate final : public UDatasmithObjectTemplate
{
public:
	TSet<class FName>                             Layers;                                            // 0x0030(0x0050)(NativeAccessSpecifierPublic)
	TSet<class FName>                             Tags;                                              // 0x0080(0x0050)(NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DatasmithActorTemplate")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DatasmithActorTemplate")
	}
	static class UDatasmithActorTemplate* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDatasmithActorTemplate>();
	}
};
DUMPER7_ASSERTS_UDatasmithActorTemplate;

// Class DatasmithContent.DatasmithAdditionalData
// 0x0000 (0x0028 - 0x0028)
class UDatasmithAdditionalData final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DatasmithAdditionalData")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DatasmithAdditionalData")
	}
	static class UDatasmithAdditionalData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDatasmithAdditionalData>();
	}
};
DUMPER7_ASSERTS_UDatasmithAdditionalData;

// Class DatasmithContent.DatasmithAreaLightActor
// 0x0058 (0x0280 - 0x0228)
class ADatasmithAreaLightActor final : public AActor
{
public:
	EDatasmithAreaLightActorType                  LightType;                                         // 0x0228(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EDatasmithAreaLightActorShape                 LightShape;                                        // 0x0229(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_22A[0x2];                                      // 0x022A(0x0002)(Fixing Size After Last Property [ Rei-SdkDumper ])
	struct FVector2D                              Dimensions;                                        // 0x022C(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Intensity;                                         // 0x0234(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ELightUnits                                   IntensityUnits;                                    // 0x0238(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_239[0x3];                                      // 0x0239(0x0003)(Fixing Size After Last Property [ Rei-SdkDumper ])
	struct FLinearColor                           Color;                                             // 0x023C(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Temperature;                                       // 0x024C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTextureLightProfile*                   IESTexture;                                        // 0x0250(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseIESBrightness;                                 // 0x0258(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_259[0x3];                                      // 0x0259(0x0003)(Fixing Size After Last Property [ Rei-SdkDumper ])
	float                                         IESBrightnessScale;                                // 0x025C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               Rotation;                                          // 0x0260(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	float                                         SourceRadius;                                      // 0x026C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SourceLength;                                      // 0x0270(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AttenuationRadius;                                 // 0x0274(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SpotlightInnerAngle;                               // 0x0278(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SpotlightOuterAngle;                               // 0x027C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DatasmithAreaLightActor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DatasmithAreaLightActor")
	}
	static class ADatasmithAreaLightActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<ADatasmithAreaLightActor>();
	}
};
DUMPER7_ASSERTS_ADatasmithAreaLightActor;

// Class DatasmithContent.DatasmithAreaLightActorTemplate
// 0x0070 (0x00A0 - 0x0030)
class UDatasmithAreaLightActorTemplate final : public UDatasmithObjectTemplate
{
public:
	EDatasmithAreaLightActorType                  LightType;                                         // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EDatasmithAreaLightActorShape                 LightShape;                                        // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_32[0x2];                                       // 0x0032(0x0002)(Fixing Size After Last Property [ Rei-SdkDumper ])
	struct FVector2D                              Dimensions;                                        // 0x0034(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           Color;                                             // 0x003C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Intensity;                                         // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ELightUnits                                   IntensityUnits;                                    // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Rei-SdkDumper ])
	float                                         Temperature;                                       // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UTextureLightProfile>    IESTexture;                                        // 0x0058(0x0028)(UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseIESBrightness;                                 // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_81[0x3];                                       // 0x0081(0x0003)(Fixing Size After Last Property [ Rei-SdkDumper ])
	float                                         IESBrightnessScale;                                // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               Rotation;                                          // 0x0088(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	float                                         SourceRadius;                                      // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SourceLength;                                      // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AttenuationRadius;                                 // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DatasmithAreaLightActorTemplate")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DatasmithAreaLightActorTemplate")
	}
	static class UDatasmithAreaLightActorTemplate* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDatasmithAreaLightActorTemplate>();
	}
};
DUMPER7_ASSERTS_UDatasmithAreaLightActorTemplate;

// Class DatasmithContent.DatasmithSceneImportData
// 0x0000 (0x0028 - 0x0028)
class UDatasmithSceneImportData : public UAssetImportData
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DatasmithSceneImportData")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DatasmithSceneImportData")
	}
	static class UDatasmithSceneImportData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDatasmithSceneImportData>();
	}
};
DUMPER7_ASSERTS_UDatasmithSceneImportData;

// Class DatasmithContent.DatasmithTranslatedSceneImportData
// 0x0000 (0x0028 - 0x0028)
class UDatasmithTranslatedSceneImportData final : public UDatasmithSceneImportData
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DatasmithTranslatedSceneImportData")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DatasmithTranslatedSceneImportData")
	}
	static class UDatasmithTranslatedSceneImportData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDatasmithTranslatedSceneImportData>();
	}
};
DUMPER7_ASSERTS_UDatasmithTranslatedSceneImportData;

// Class DatasmithContent.DatasmithCADImportSceneData
// 0x0000 (0x0028 - 0x0028)
class UDatasmithCADImportSceneData final : public UDatasmithSceneImportData
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DatasmithCADImportSceneData")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DatasmithCADImportSceneData")
	}
	static class UDatasmithCADImportSceneData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDatasmithCADImportSceneData>();
	}
};
DUMPER7_ASSERTS_UDatasmithCADImportSceneData;

// Class DatasmithContent.DatasmithMDLSceneImportData
// 0x0000 (0x0028 - 0x0028)
class UDatasmithMDLSceneImportData final : public UDatasmithSceneImportData
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DatasmithMDLSceneImportData")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DatasmithMDLSceneImportData")
	}
	static class UDatasmithMDLSceneImportData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDatasmithMDLSceneImportData>();
	}
};
DUMPER7_ASSERTS_UDatasmithMDLSceneImportData;

// Class DatasmithContent.DatasmithGLTFSceneImportData
// 0x0048 (0x0070 - 0x0028)
class UDatasmithGLTFSceneImportData final : public UDatasmithSceneImportData
{
public:
	class FString                                 Generator;                                         // 0x0028(0x0010)(Edit, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Version;                                           // 0x0038(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Rei-SdkDumper ])
	class FString                                 Author;                                            // 0x0040(0x0010)(Edit, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 License;                                           // 0x0050(0x0010)(Edit, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Source;                                            // 0x0060(0x0010)(Edit, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DatasmithGLTFSceneImportData")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DatasmithGLTFSceneImportData")
	}
	static class UDatasmithGLTFSceneImportData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDatasmithGLTFSceneImportData>();
	}
};
DUMPER7_ASSERTS_UDatasmithGLTFSceneImportData;

// Class DatasmithContent.DatasmithStaticMeshGLTFImportData
// 0x0010 (0x0038 - 0x0028)
class UDatasmithStaticMeshGLTFImportData final : public UDatasmithStaticMeshImportData
{
public:
	class FString                                 SourceMeshName;                                    // 0x0028(0x0010)(Edit, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DatasmithStaticMeshGLTFImportData")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DatasmithStaticMeshGLTFImportData")
	}
	static class UDatasmithStaticMeshGLTFImportData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDatasmithStaticMeshGLTFImportData>();
	}
};
DUMPER7_ASSERTS_UDatasmithStaticMeshGLTFImportData;

// Class DatasmithContent.DatasmithFBXSceneImportData
// 0x0020 (0x0048 - 0x0028)
class UDatasmithFBXSceneImportData : public UDatasmithSceneImportData
{
public:
	bool                                          bGenerateLightmapUVs;                              // 0x0028(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Rei-SdkDumper ])
	class FString                                 TexturesDir;                                       // 0x0030(0x0010)(Edit, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         IntermediateSerialization;                         // 0x0040(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bColorizeMaterials;                                // 0x0041(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_42[0x6];                                       // 0x0042(0x0006)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DatasmithFBXSceneImportData")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DatasmithFBXSceneImportData")
	}
	static class UDatasmithFBXSceneImportData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDatasmithFBXSceneImportData>();
	}
};
DUMPER7_ASSERTS_UDatasmithFBXSceneImportData;

// Class DatasmithContent.DatasmithDeltaGenAssetImportData
// 0x0000 (0x0028 - 0x0028)
class UDatasmithDeltaGenAssetImportData final : public UDatasmithAssetImportData
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DatasmithDeltaGenAssetImportData")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DatasmithDeltaGenAssetImportData")
	}
	static class UDatasmithDeltaGenAssetImportData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDatasmithDeltaGenAssetImportData>();
	}
};
DUMPER7_ASSERTS_UDatasmithDeltaGenAssetImportData;

// Class DatasmithContent.DatasmithDeltaGenSceneImportData
// 0x0048 (0x0090 - 0x0048)
class UDatasmithDeltaGenSceneImportData final : public UDatasmithFBXSceneImportData
{
public:
	bool                                          bMergeNodes;                                       // 0x0048(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOptimizeDuplicatedNodes;                          // 0x0049(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bRemoveInvisibleNodes;                             // 0x004A(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSimplifyNodeHierarchy;                            // 0x004B(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bImportVar;                                        // 0x004C(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4D[0x3];                                       // 0x004D(0x0003)(Fixing Size After Last Property [ Rei-SdkDumper ])
	class FString                                 VarPath;                                           // 0x0050(0x0010)(Edit, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bImportPos;                                        // 0x0060(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Rei-SdkDumper ])
	class FString                                 PosPath;                                           // 0x0068(0x0010)(Edit, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bImportTml;                                        // 0x0078(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Rei-SdkDumper ])
	class FString                                 TmlPath;                                           // 0x0080(0x0010)(Edit, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DatasmithDeltaGenSceneImportData")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DatasmithDeltaGenSceneImportData")
	}
	static class UDatasmithDeltaGenSceneImportData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDatasmithDeltaGenSceneImportData>();
	}
};
DUMPER7_ASSERTS_UDatasmithDeltaGenSceneImportData;

// Class DatasmithContent.DatasmithVREDAssetImportData
// 0x0000 (0x0028 - 0x0028)
class UDatasmithVREDAssetImportData final : public UDatasmithAssetImportData
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DatasmithVREDAssetImportData")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DatasmithVREDAssetImportData")
	}
	static class UDatasmithVREDAssetImportData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDatasmithVREDAssetImportData>();
	}
};
DUMPER7_ASSERTS_UDatasmithVREDAssetImportData;

// Class DatasmithContent.DatasmithVREDSceneImportData
// 0x0060 (0x00A8 - 0x0048)
class UDatasmithVREDSceneImportData final : public UDatasmithFBXSceneImportData
{
public:
	bool                                          bMergeNodes;                                       // 0x0048(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOptimizeDuplicatedNodes;                          // 0x0049(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bImportMats;                                       // 0x004A(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4B[0x5];                                       // 0x004B(0x0005)(Fixing Size After Last Property [ Rei-SdkDumper ])
	class FString                                 MatsPath;                                          // 0x0050(0x0010)(Edit, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bImportVar;                                        // 0x0060(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCleanVar;                                         // 0x0061(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_62[0x6];                                       // 0x0062(0x0006)(Fixing Size After Last Property [ Rei-SdkDumper ])
	class FString                                 VarPath;                                           // 0x0068(0x0010)(Edit, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bImportLightInfo;                                  // 0x0078(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Rei-SdkDumper ])
	class FString                                 LightInfoPath;                                     // 0x0080(0x0010)(Edit, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bImportClipInfo;                                   // 0x0090(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Rei-SdkDumper ])
	class FString                                 ClipInfoPath;                                      // 0x0098(0x0010)(Edit, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DatasmithVREDSceneImportData")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DatasmithVREDSceneImportData")
	}
	static class UDatasmithVREDSceneImportData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDatasmithVREDSceneImportData>();
	}
};
DUMPER7_ASSERTS_UDatasmithVREDSceneImportData;

// Class DatasmithContent.DatasmithIFCSceneImportData
// 0x0000 (0x0028 - 0x0028)
class UDatasmithIFCSceneImportData final : public UDatasmithSceneImportData
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DatasmithIFCSceneImportData")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DatasmithIFCSceneImportData")
	}
	static class UDatasmithIFCSceneImportData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDatasmithIFCSceneImportData>();
	}
};
DUMPER7_ASSERTS_UDatasmithIFCSceneImportData;

// Class DatasmithContent.DatasmithStaticMeshIFCImportData
// 0x0010 (0x0038 - 0x0028)
class UDatasmithStaticMeshIFCImportData final : public UDatasmithStaticMeshImportData
{
public:
	class FString                                 SourceGlobalId;                                    // 0x0028(0x0010)(Edit, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DatasmithStaticMeshIFCImportData")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DatasmithStaticMeshIFCImportData")
	}
	static class UDatasmithStaticMeshIFCImportData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDatasmithStaticMeshIFCImportData>();
	}
};
DUMPER7_ASSERTS_UDatasmithStaticMeshIFCImportData;

// Class DatasmithContent.DatasmithAssetUserData
// 0x0050 (0x0078 - 0x0028)
class UDatasmithAssetUserData final : public UAssetUserData
{
public:
	TMap<class FName, class FString>              MetaData;                                          // 0x0028(0x0050)(Edit, BlueprintVisible, EditConst, AdvancedDisplay, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DatasmithAssetUserData")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DatasmithAssetUserData")
	}
	static class UDatasmithAssetUserData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDatasmithAssetUserData>();
	}
};
DUMPER7_ASSERTS_UDatasmithAssetUserData;

// Class DatasmithContent.DatasmithSkyLightComponentTemplate
// 0x0010 (0x0040 - 0x0030)
class UDatasmithSkyLightComponentTemplate final : public UDatasmithObjectTemplate
{
public:
	ESkyLightSourceType                           SourceType;                                        // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Rei-SdkDumper ])
	int32                                         CubemapResolution;                                 // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTextureCube*                           Cubemap;                                           // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DatasmithSkyLightComponentTemplate")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DatasmithSkyLightComponentTemplate")
	}
	static class UDatasmithSkyLightComponentTemplate* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDatasmithSkyLightComponentTemplate>();
	}
};
DUMPER7_ASSERTS_UDatasmithSkyLightComponentTemplate;

// Class DatasmithContent.DatasmithCineCameraActorTemplate
// 0x0030 (0x0060 - 0x0030)
class UDatasmithCineCameraActorTemplate final : public UDatasmithObjectTemplate
{
public:
	struct FDatasmithCameraLookatTrackingSettingsTemplate LookatTrackingSettings;                    // 0x0030(0x0030)(NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DatasmithCineCameraActorTemplate")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DatasmithCineCameraActorTemplate")
	}
	static class UDatasmithCineCameraActorTemplate* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDatasmithCineCameraActorTemplate>();
	}
};
DUMPER7_ASSERTS_UDatasmithCineCameraActorTemplate;

// Class DatasmithContent.DatasmithCineCameraComponentTemplate
// 0x0060 (0x0090 - 0x0030)
class UDatasmithCineCameraComponentTemplate final : public UDatasmithObjectTemplate
{
public:
	struct FDatasmithCameraFilmbackSettingsTemplate FilmbackSettings;                                // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FDatasmithCameraLensSettingsTemplate   LensSettings;                                      // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FDatasmithCameraFocusSettingsTemplate  FocusSettings;                                     // 0x003C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	float                                         CurrentFocalLength;                                // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CurrentAperture;                                   // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Rei-SdkDumper ])
	struct FDatasmithPostProcessSettingsTemplate  PostProcessSettings;                               // 0x0050(0x0040)(NoDestructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DatasmithCineCameraComponentTemplate")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DatasmithCineCameraComponentTemplate")
	}
	static class UDatasmithCineCameraComponentTemplate* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDatasmithCineCameraComponentTemplate>();
	}
};
DUMPER7_ASSERTS_UDatasmithCineCameraComponentTemplate;

// Class DatasmithContent.DatasmithContentBlueprintLibrary
// 0x0000 (0x0028 - 0x0028)
class UDatasmithContentBlueprintLibrary final : public UBlueprintFunctionLibrary
{
public:
	static class UDatasmithAssetUserData* GetDatasmithUserData(class UObject* Object);
	static void GetDatasmithUserDataKeysAndValuesForValue(class UObject* Object, const class FString& StringToMatch, TArray<class FName>* OutKeys, TArray<class FString>* OutValues);
	static class FString GetDatasmithUserDataValueForKey(class UObject* Object, class FName Key);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DatasmithContentBlueprintLibrary")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DatasmithContentBlueprintLibrary")
	}
	static class UDatasmithContentBlueprintLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDatasmithContentBlueprintLibrary>();
	}
};
DUMPER7_ASSERTS_UDatasmithContentBlueprintLibrary;

// Class DatasmithContent.DatasmithCustomActionBase
// 0x0008 (0x0030 - 0x0028)
class UDatasmithCustomActionBase final : public UObject
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DatasmithCustomActionBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DatasmithCustomActionBase")
	}
	static class UDatasmithCustomActionBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDatasmithCustomActionBase>();
	}
};
DUMPER7_ASSERTS_UDatasmithCustomActionBase;

// Class DatasmithContent.DatasmithDecalComponentTemplate
// 0x0018 (0x0048 - 0x0030)
class UDatasmithDecalComponentTemplate final : public UDatasmithObjectTemplate
{
public:
	int32                                         SortOrder;                                         // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                DecalSize;                                         // 0x0034(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterialInterface*                     Material;                                          // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DatasmithDecalComponentTemplate")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DatasmithDecalComponentTemplate")
	}
	static class UDatasmithDecalComponentTemplate* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDatasmithDecalComponentTemplate>();
	}
};
DUMPER7_ASSERTS_UDatasmithDecalComponentTemplate;

// Class DatasmithContent.DatasmithImportedSequencesActor
// 0x0010 (0x0238 - 0x0228)
class ADatasmithImportedSequencesActor final : public AActor
{
public:
	TArray<class ULevelSequence*>                 ImportedSequences;                                 // 0x0228(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)

public:
	void PlayLevelSequence(class ULevelSequence* SequenceToPlay);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DatasmithImportedSequencesActor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DatasmithImportedSequencesActor")
	}
	static class ADatasmithImportedSequencesActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<ADatasmithImportedSequencesActor>();
	}
};
DUMPER7_ASSERTS_ADatasmithImportedSequencesActor;

// Class DatasmithContent.DatasmithOptionsBase
// 0x0000 (0x0028 - 0x0028)
class UDatasmithOptionsBase : public UObject
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DatasmithOptionsBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DatasmithOptionsBase")
	}
	static class UDatasmithOptionsBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDatasmithOptionsBase>();
	}
};
DUMPER7_ASSERTS_UDatasmithOptionsBase;

// Class DatasmithContent.DatasmithCommonTessellationOptions
// 0x0010 (0x0038 - 0x0028)
class UDatasmithCommonTessellationOptions final : public UDatasmithOptionsBase
{
public:
	struct FDatasmithTessellationOptions          Options;                                           // 0x0028(0x0010)(Edit, BlueprintVisible, Config, NoDestructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DatasmithCommonTessellationOptions")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DatasmithCommonTessellationOptions")
	}
	static class UDatasmithCommonTessellationOptions* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDatasmithCommonTessellationOptions>();
	}
};
DUMPER7_ASSERTS_UDatasmithCommonTessellationOptions;

// Class DatasmithContent.DatasmithImportOptions
// 0x0050 (0x0078 - 0x0028)
class UDatasmithImportOptions final : public UDatasmithOptionsBase
{
public:
	EDatasmithImportSearchPackagePolicy           SearchPackagePolicy;                               // 0x0028(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EDatasmithImportAssetConflictPolicy           MaterialConflictPolicy;                            // 0x0029(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EDatasmithImportAssetConflictPolicy           TextureConflictPolicy;                             // 0x002A(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EDatasmithImportActorPolicy                   StaticMeshActorImportPolicy;                       // 0x002B(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EDatasmithImportActorPolicy                   LightImportPolicy;                                 // 0x002C(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EDatasmithImportActorPolicy                   CameraImportPolicy;                                // 0x002D(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EDatasmithImportActorPolicy                   OtherActorImportPolicy;                            // 0x002E(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EDatasmithImportMaterialQuality               MaterialQuality;                                   // 0x002F(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_30[0x4];                                       // 0x0030(0x0004)(Fixing Size After Last Property [ Rei-SdkDumper ])
	struct FDatasmithImportBaseOptions            BaseOptions;                                       // 0x0034(0x0014)(Edit, BlueprintVisible, Config, NoDestructor, NativeAccessSpecifierPublic)
	struct FDatasmithReimportOptions              ReimportOptions;                                   // 0x0048(0x0002)(Edit, BlueprintVisible, Config, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_4A[0x6];                                       // 0x004A(0x0006)(Fixing Size After Last Property [ Rei-SdkDumper ])
	class FString                                 Filename;                                          // 0x0050(0x0010)(BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 FilePath;                                          // 0x0060(0x0010)(BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_70[0x8];                                       // 0x0070(0x0008)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DatasmithImportOptions")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DatasmithImportOptions")
	}
	static class UDatasmithImportOptions* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDatasmithImportOptions>();
	}
};
DUMPER7_ASSERTS_UDatasmithImportOptions;

// Class DatasmithContent.DatasmithLandscapeTemplate
// 0x0010 (0x0040 - 0x0030)
class UDatasmithLandscapeTemplate final : public UDatasmithObjectTemplate
{
public:
	class UMaterialInterface*                     LandscapeMaterial;                                 // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         StaticLightingLOD;                                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DatasmithLandscapeTemplate")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DatasmithLandscapeTemplate")
	}
	static class UDatasmithLandscapeTemplate* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDatasmithLandscapeTemplate>();
	}
};
DUMPER7_ASSERTS_UDatasmithLandscapeTemplate;

// Class DatasmithContent.DatasmithLightComponentTemplate
// 0x0038 (0x0068 - 0x0030)
class UDatasmithLightComponentTemplate final : public UDatasmithObjectTemplate
{
public:
	uint8                                         bVisible : 1;                                      // 0x0030(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         BitPad_30_1 : 7;                                   // 0x0030(0x0001)(Fixing Bit-Field Size For New Byte [ Rei-SdkDumper ])
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Rei-SdkDumper ])
	uint8                                         CastShadows : 1;                                   // 0x0034(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bUseTemperature : 1;                               // 0x0034(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bUseIESBrightness : 1;                             // 0x0034(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Rei-SdkDumper ])
	float                                         Intensity;                                         // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Temperature;                                       // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         IESBrightnessScale;                                // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           LightColor;                                        // 0x0044(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Rei-SdkDumper ])
	class UMaterialInterface*                     LightFunctionMaterial;                             // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTextureLightProfile*                   IESTexture;                                        // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DatasmithLightComponentTemplate")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DatasmithLightComponentTemplate")
	}
	static class UDatasmithLightComponentTemplate* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDatasmithLightComponentTemplate>();
	}
};
DUMPER7_ASSERTS_UDatasmithLightComponentTemplate;

// Class DatasmithContent.DatasmithMaterialInstanceTemplate
// 0x0168 (0x0198 - 0x0030)
class UDatasmithMaterialInstanceTemplate final : public UDatasmithObjectTemplate
{
public:
	TSoftObjectPtr<class UMaterialInterface>      ParentMaterial;                                    // 0x0030(0x0028)(UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<class FName, float>                      ScalarParameterValues;                             // 0x0058(0x0050)(NativeAccessSpecifierPublic)
	TMap<class FName, struct FLinearColor>        VectorParameterValues;                             // 0x00A8(0x0050)(NativeAccessSpecifierPublic)
	TMap<class FName, TSoftObjectPtr<class UTexture>> TextureParameterValues;                        // 0x00F8(0x0050)(UObjectWrapper, NativeAccessSpecifierPublic)
	struct FDatasmithStaticParameterSetTemplate   StaticParameters;                                  // 0x0148(0x0050)(NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DatasmithMaterialInstanceTemplate")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DatasmithMaterialInstanceTemplate")
	}
	static class UDatasmithMaterialInstanceTemplate* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDatasmithMaterialInstanceTemplate>();
	}
};
DUMPER7_ASSERTS_UDatasmithMaterialInstanceTemplate;

// Class DatasmithContent.DatasmithPointLightComponentTemplate
// 0x0010 (0x0040 - 0x0030)
class UDatasmithPointLightComponentTemplate final : public UDatasmithObjectTemplate
{
public:
	ELightUnits                                   IntensityUnits;                                    // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Rei-SdkDumper ])
	float                                         SourceRadius;                                      // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SourceLength;                                      // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AttenuationRadius;                                 // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DatasmithPointLightComponentTemplate")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DatasmithPointLightComponentTemplate")
	}
	static class UDatasmithPointLightComponentTemplate* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDatasmithPointLightComponentTemplate>();
	}
};
DUMPER7_ASSERTS_UDatasmithPointLightComponentTemplate;

// Class DatasmithContent.DatasmithPostProcessVolumeTemplate
// 0x0050 (0x0080 - 0x0030)
class UDatasmithPostProcessVolumeTemplate final : public UDatasmithObjectTemplate
{
public:
	struct FDatasmithPostProcessSettingsTemplate  Settings;                                          // 0x0030(0x0040)(NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         bEnabled : 1;                                      // 0x0070(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bUnbound : 1;                                      // 0x0070(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_71[0xF];                                       // 0x0071(0x000F)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DatasmithPostProcessVolumeTemplate")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DatasmithPostProcessVolumeTemplate")
	}
	static class UDatasmithPostProcessVolumeTemplate* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDatasmithPostProcessVolumeTemplate>();
	}
};
DUMPER7_ASSERTS_UDatasmithPostProcessVolumeTemplate;

// Class DatasmithContent.DatasmithScene
// 0x0008 (0x0030 - 0x0028)
class UDatasmithScene final : public UObject
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DatasmithScene")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DatasmithScene")
	}
	static class UDatasmithScene* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDatasmithScene>();
	}
};
DUMPER7_ASSERTS_UDatasmithScene;

// Class DatasmithContent.DatasmithSceneActor
// 0x0058 (0x0280 - 0x0228)
class ADatasmithSceneActor final : public AActor
{
public:
	class UDatasmithScene*                        Scene;                                             // 0x0228(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<class FName, TSoftObjectPtr<class AActor>> RelatedActors;                                   // 0x0230(0x0050)(Edit, EditConst, AdvancedDisplay, UObjectWrapper, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DatasmithSceneActor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DatasmithSceneActor")
	}
	static class ADatasmithSceneActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<ADatasmithSceneActor>();
	}
};
DUMPER7_ASSERTS_ADatasmithSceneActor;

// Class DatasmithContent.DatasmithSceneComponentTemplate
// 0x00C0 (0x00F0 - 0x0030)
class UDatasmithSceneComponentTemplate final : public UDatasmithObjectTemplate
{
public:
	struct FTransform                             RelativeTransform;                                 // 0x0030(0x0030)(IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	EComponentMobility                            Mobility;                                          // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Rei-SdkDumper ])
	TSoftObjectPtr<class USceneComponent>         AttachParent;                                      // 0x0068(0x0028)(ExportObject, InstancedReference, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bVisible;                                          // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Rei-SdkDumper ])
	TSet<class FName>                             Tags;                                              // 0x0098(0x0050)(NativeAccessSpecifierPublic)
	uint8                                         Pad_E8[0x8];                                       // 0x00E8(0x0008)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DatasmithSceneComponentTemplate")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DatasmithSceneComponentTemplate")
	}
	static class UDatasmithSceneComponentTemplate* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDatasmithSceneComponentTemplate>();
	}
};
DUMPER7_ASSERTS_UDatasmithSceneComponentTemplate;

// Class DatasmithContent.DatasmithSpotLightComponentTemplate
// 0x0008 (0x0038 - 0x0030)
class UDatasmithSpotLightComponentTemplate final : public UDatasmithObjectTemplate
{
public:
	float                                         InnerConeAngle;                                    // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         OuterConeAngle;                                    // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DatasmithSpotLightComponentTemplate")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DatasmithSpotLightComponentTemplate")
	}
	static class UDatasmithSpotLightComponentTemplate* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDatasmithSpotLightComponentTemplate>();
	}
};
DUMPER7_ASSERTS_UDatasmithSpotLightComponentTemplate;

// Class DatasmithContent.DatasmithStaticMeshComponentTemplate
// 0x0018 (0x0048 - 0x0030)
class UDatasmithStaticMeshComponentTemplate final : public UDatasmithObjectTemplate
{
public:
	class UStaticMesh*                            StaticMesh;                                        // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UMaterialInterface*>             OverrideMaterials;                                 // 0x0038(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DatasmithStaticMeshComponentTemplate")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DatasmithStaticMeshComponentTemplate")
	}
	static class UDatasmithStaticMeshComponentTemplate* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDatasmithStaticMeshComponentTemplate>();
	}
};
DUMPER7_ASSERTS_UDatasmithStaticMeshComponentTemplate;

// Class DatasmithContent.DatasmithStaticMeshTemplate
// 0x0078 (0x00A8 - 0x0030)
class UDatasmithStaticMeshTemplate final : public UDatasmithObjectTemplate
{
public:
	struct FDatasmithMeshSectionInfoMapTemplate   SectionInfoMap;                                    // 0x0030(0x0050)(Edit, EditConst, NativeAccessSpecifierPublic)
	int32                                         LightMapCoordinateIndex;                           // 0x0080(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         LightMapResolution;                                // 0x0084(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FDatasmithMeshBuildSettingsTemplate> BuildSettings;                                // 0x0088(0x0010)(Edit, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
	TArray<struct FDatasmithStaticMaterialTemplate> StaticMaterials;                                 // 0x0098(0x0010)(Edit, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DatasmithStaticMeshTemplate")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DatasmithStaticMeshTemplate")
	}
	static class UDatasmithStaticMeshTemplate* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDatasmithStaticMeshTemplate>();
	}
};
DUMPER7_ASSERTS_UDatasmithStaticMeshTemplate;

}

