#pragma once

/*
* SDK generated by Rei-SdkDumper
* Based on Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DesignerCore

#include "Basic.hpp"

#include "CoreUObject_classes.hpp"


namespace SDK
{

// Class DesignerCore.DesignerCore
// 0x00C8 (0x00F0 - 0x0028)
class UDesignerCore final : public UObject
{
public:
	uint8                                         Pad_28[0xC8];                                      // 0x0028(0x00C8)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DesignerCore")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DesignerCore")
	}
	static class UDesignerCore* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDesignerCore>();
	}
};
DUMPER7_ASSERTS_UDesignerCore;

// Class DesignerCore.DesignerCoreRSThread
// 0x0060 (0x0088 - 0x0028)
class UDesignerCoreRSThread final : public UObject
{
public:
	uint8                                         Pad_28[0x60];                                      // 0x0028(0x0060)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DesignerCoreRSThread")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DesignerCoreRSThread")
	}
	static class UDesignerCoreRSThread* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDesignerCoreRSThread>();
	}
};
DUMPER7_ASSERTS_UDesignerCoreRSThread;

// Class DesignerCore.DesignerCoreSocket
// 0x00B8 (0x00E0 - 0x0028)
class alignas(0x10) UDesignerCoreSocket final : public UObject
{
public:
	uint8                                         Pad_28[0x40];                                      // 0x0028(0x0040)(Fixing Size After Last Property [ Rei-SdkDumper ])
	TArray<class UDesignerCoreRSThread*>          RecThreads;                                        // 0x0068(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TMulticastInlineDelegate<void(const class FString& Data)> ReceiveSocketDataDelegate;             // 0x0078(0x0010)(Edit, ZeroConstructor, EditConst, InstancedReference, BlueprintAssignable, Protected, NativeAccessSpecifierProtected)
	TMulticastInlineDelegate<void(bool bSuccess)> ConnectedServerResultDelegate;                     // 0x0088(0x0010)(Edit, ZeroConstructor, EditConst, InstancedReference, BlueprintAssignable, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_98[0x48];                                      // 0x0098(0x0048)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])

public:
	void Close();
	bool CreateServer(const class FString& IP, int32 Port, int32 ReceiveSize, int32 SendSize);
	void OnDisConnected(class UDesignerCoreRSThread* pThread);
	void SendData(const class FString& Message);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DesignerCoreSocket")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DesignerCoreSocket")
	}
	static class UDesignerCoreSocket* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDesignerCoreSocket>();
	}
};
DUMPER7_ASSERTS_UDesignerCoreSocket;

}

