#pragma once

/*
* SDK generated by Rei-SdkDumper
* Based on Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DLCOnline

#include "Basic.hpp"

#include "DLCOnline_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class DLCOnline.DLCOnlineGameMode
// 0x0188 (0x0498 - 0x0310)
class ADLCOnlineGameMode final : public AGameMode
{
public:
	class FString                                 NetGUID;                                           // 0x0310(0x0010)(ZeroConstructor, Transient, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_320[0x178];                                    // 0x0320(0x0178)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])

public:
	void CheckOffLineHost();
	void CreateRoom();
	class FString GetHostInfo(int32 TargetIndex, const class FString& Key);
	int32 GetHostSize();
	void JoinRoom(const class FString& InRoomGUID);
	void LuaStartPlay();
	void OnRoomDataChanged();
	void StorageHostData(const class FString& HostName, const class FString& HostOwnerName, const class FString& MapId, const class FString& RoomType, const class FString& CampsNum, const class FString& TeamNum, const class FString& TeamPlayerNum, const class FString& ServerType);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DLCOnlineGameMode")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DLCOnlineGameMode")
	}
	static class ADLCOnlineGameMode* GetDefaultObj()
	{
		return GetDefaultObjImpl<ADLCOnlineGameMode>();
	}
};
DUMPER7_ASSERTS_ADLCOnlineGameMode;

// Class DLCOnline.DLCOnlinePlayerController
// 0x0020 (0x0598 - 0x0578)
class ADLCOnlinePlayerController final : public APlayerController
{
public:
	class UDLCOnlineSystem*                       OnlineSystem;                                      // 0x0578(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ADLCOnlineSyncActor*                    SyncActor;                                         // 0x0580(0x0008)(Net, ZeroConstructor, Transient, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                         PlayerID;                                          // 0x0588(0x0008)(Net, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_590[0x8];                                      // 0x0590(0x0008)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])

public:
	void ApplyBegin();
	void AutoFillRobot(int32 InCamp, int32 InTeam, int32 InCount);
	void ChangeRole(EDLCOnlineRoleType InRoleType);
	void ChangeToFightPlayer(EDLCOnlineRoleType InRoleType, int32 CampId, int32 TeamID, int32 PosID);
	struct FDLCOnlinePlayer GetPlayerData();
	bool IsMaster();
	void KickPlayer(int64 InPlayerId);
	void NotifyLuaStart();
	void OnRep_SyncActor();
	void SetPlayerName(const class FString& InName);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DLCOnlinePlayerController")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DLCOnlinePlayerController")
	}
	static class ADLCOnlinePlayerController* GetDefaultObj()
	{
		return GetDefaultObjImpl<ADLCOnlinePlayerController>();
	}
};
DUMPER7_ASSERTS_ADLCOnlinePlayerController;

// Class DLCOnline.DLCOnlineRoomGameMode
// 0x0118 (0x0428 - 0x0310)
class ADLCOnlineRoomGameMode final : public AGameMode
{
public:
	uint8                                         Pad_310[0x110];                                    // 0x0310(0x0110)(Fixing Size After Last Property [ Rei-SdkDumper ])
	class ADLCOnlineSyncActor*                    SyncActor;                                         // 0x0420(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	void LuaStartPlay();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DLCOnlineRoomGameMode")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DLCOnlineRoomGameMode")
	}
	static class ADLCOnlineRoomGameMode* GetDefaultObj()
	{
		return GetDefaultObjImpl<ADLCOnlineRoomGameMode>();
	}
};
DUMPER7_ASSERTS_ADLCOnlineRoomGameMode;

// Class DLCOnline.DLCOnlineSyncActor
// 0x00B8 (0x02E0 - 0x0228)
class ADLCOnlineSyncActor final : public AActor
{
public:
	TArray<struct FDLCOnlinePlayer>               Players;                                           // 0x0228(0x0010)(Net, ZeroConstructor, RepNotify, NativeAccessSpecifierPublic)
	int64                                         MasterID;                                          // 0x0238(0x0008)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FDLCOnlineCreateRoomInfo               RoomCreateData;                                    // 0x0240(0x0034)(Net, NoDestructor, NativeAccessSpecifierPublic)
	TDelegate<void()>                             NotifyRoomPlayerChanged;                           // 0x0274(0x0010)(ZeroConstructor, Transient, InstancedReference, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_284[0x5C];                                     // 0x0284(0x005C)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])

public:
	struct FDLCOnlinePlayer FindPlayerByPos(int32 CampId, int32 TeamID, int32 PosID);
	void OnPlayerDataChanged();
	void OnRep_Players();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DLCOnlineSyncActor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DLCOnlineSyncActor")
	}
	static class ADLCOnlineSyncActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<ADLCOnlineSyncActor>();
	}
};
DUMPER7_ASSERTS_ADLCOnlineSyncActor;

// Class DLCOnline.DLCOnlineSystem
// 0x0080 (0x00B0 - 0x0030)
class UDLCOnlineSystem final : public UGameInstanceSubsystem
{
public:
	uint8                                         Pad_30[0x10];                                      // 0x0030(0x0010)(Fixing Size After Last Property [ Rei-SdkDumper ])
	struct FDLCOnlineRoomData                     RoomData;                                          // 0x0040(0x0028)(Transient, NativeAccessSpecifierPublic)
	struct FDLCOnlineCreateRoomInfo               HostData;                                          // 0x0068(0x0034)(Transient, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_9C[0x4];                                       // 0x009C(0x0004)(Fixing Size After Last Property [ Rei-SdkDumper ])
	TArray<struct FDLCOnlineConfig>               Configs;                                           // 0x00A0(0x0010)(BlueprintVisible, ZeroConstructor, Transient, NativeAccessSpecifierPublic)

public:
	static class UDLCOnlineSystem* Get(class UObject* InWorldContext);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DLCOnlineSystem")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DLCOnlineSystem")
	}
	static class UDLCOnlineSystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDLCOnlineSystem>();
	}
};
DUMPER7_ASSERTS_UDLCOnlineSystem;

}

