#pragma once

/*
* SDK generated by Rei-SdkDumper
* Based on Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DS_GMThrowResult

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct DS_GMThrowResult.DS_GMThrowResult
// 0x0020 (0x0020 - 0x0000)
struct FDS_GMThrowResult final
{
public:
	class FName                                   PosName_11_0E40BA66485DB618FD1810A326481BA6;       // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Type_22_AC08CD594DD973B1C0D5B1AD4C3BF048;          // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Rei-SdkDumper ])
	class USkeletalMeshComponent*                 Mesh_24_3FDCA62F470A895D77655195A7A7D5CD;          // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         NPCID_21_2D5F73774D80166C5E416794815CB509;         // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MatID_27_DDCD4CB5444285932F38AB8559BBC363;         // 0x001C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_FDS_GMThrowResult;

}

