#pragma once

/*
* SDK generated by Rei-SdkDumper
* Based on Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DungeonArchitectRuntime

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "DungeonArchitectRuntime_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AIModule_classes.hpp"


namespace SDK
{

// Class DungeonArchitectRuntime.FlowExecTask
// 0x0030 (0x0058 - 0x0028)
class UFlowExecTask : public UObject
{
public:
	class FString                                 Description;                                       // 0x0028(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 NodeVariableName;                                  // 0x0038(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UFlowExecTaskExtender*>          Extenders;                                         // 0x0048(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FlowExecTask")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FlowExecTask")
	}
	static class UFlowExecTask* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFlowExecTask>();
	}
};
DUMPER7_ASSERTS_UFlowExecTask;

// Class DungeonArchitectRuntime.FlowTaskAbstractBase
// 0x0000 (0x0058 - 0x0058)
class UFlowTaskAbstractBase : public UFlowExecTask
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FlowTaskAbstractBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FlowTaskAbstractBase")
	}
	static class UFlowTaskAbstractBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFlowTaskAbstractBase>();
	}
};
DUMPER7_ASSERTS_UFlowTaskAbstractBase;

// Class DungeonArchitectRuntime.Dungeon
// 0x00F8 (0x0320 - 0x0228)
class ADungeon final : public AActor
{
public:
	struct FGuid                                  uid;                                               // 0x0228(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UDungeonThemeAsset*>             Themes;                                            // 0x0238(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TSubclassOf<class UDungeonBuilder>            BuilderClass;                                      // 0x0248(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UDungeonMarkerEmitter*>          MarkerEmitters;                                    // 0x0250(0x0010)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, ContainsInstancedReference, SimpleDisplay, NativeAccessSpecifierPublic)
	TArray<class UDungeonEventListener*>          EventListeners;                                    // 0x0260(0x0010)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, ContainsInstancedReference, SimpleDisplay, NativeAccessSpecifierPublic)
	TArray<struct FClusterThemeInfo>              ClusterThemes;                                     // 0x0270(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          bDrawDebugData;                                    // 0x0280(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_281[0x7];                                      // 0x0281(0x0007)(Fixing Size After Last Property [ Rei-SdkDumper ])
	class UDungeonBuilder*                        Builder;                                           // 0x0288(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UDungeonConfig*                         Config;                                            // 0x0290(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UDungeonModel*                          DungeonModel;                                      // 0x0298(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UDungeonToolData*                       ToolData;                                          // 0x02A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UDungeonQuery*                          Query;                                             // 0x02A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FDungeonLevelStreamingConfig           LevelStreamingConfig;                              // 0x02B0(0x0018)(NoDestructor, NativeAccessSpecifierPublic)
	class UDungeonLevelStreamingModel*            LevelStreamingModel;                               // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                BuildPriorityLocation;                             // 0x02D0(0x000C)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2DC[0x4];                                      // 0x02DC(0x0004)(Fixing Size After Last Property [ Rei-SdkDumper ])
	TMulticastInlineDelegate<void(class ADungeon* Dungeon)> OnDungeonBuildComplete;                  // 0x02E0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_2F0[0x30];                                     // 0x02F0(0x0030)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])

public:
	static class ADungeon* GetDungeonActor();
	static int32 GetDungeonLevelNumber(const class UObject* SceneObject);

	void BuildDungeon();
	void DestroyDungeon();
	class UDungeonQuery* GetQuery();
	class UDungeonBuilder* SetBuilderClass(TSubclassOf<class UDungeonBuilder> InBuilderClass);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("Dungeon")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"Dungeon")
	}
	static class ADungeon* GetDefaultObj()
	{
		return GetDefaultObjImpl<ADungeon>();
	}
};
DUMPER7_ASSERTS_ADungeon;

// Class DungeonArchitectRuntime.FlowTaskAbstract_CreateKeyLock
// 0x0040 (0x0098 - 0x0058)
class UFlowTaskAbstract_CreateKeyLock : public UFlowTaskAbstractBase
{
public:
	class FString                                 KeyPath;                                           // 0x0058(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 LockPath;                                          // 0x0068(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 KeyMarkerName;                                     // 0x0078(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 LockMarkerName;                                    // 0x0088(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FlowTaskAbstract_CreateKeyLock")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FlowTaskAbstract_CreateKeyLock")
	}
	static class UFlowTaskAbstract_CreateKeyLock* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFlowTaskAbstract_CreateKeyLock>();
	}
};
DUMPER7_ASSERTS_UFlowTaskAbstract_CreateKeyLock;

// Class DungeonArchitectRuntime.DungeonActorTemplate
// 0x0010 (0x0038 - 0x0028)
class UDungeonActorTemplate final : public UObject
{
public:
	TSubclassOf<class AActor>                     ClassTemplate;                                     // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 ActorTemplate;                                     // 0x0030(0x0008)(ExportObject, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DungeonActorTemplate")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DungeonActorTemplate")
	}
	static class UDungeonActorTemplate* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDungeonActorTemplate>();
	}
};
DUMPER7_ASSERTS_UDungeonActorTemplate;

// Class DungeonArchitectRuntime.FlowTaskAbstract_PathBuilderBase
// 0x0000 (0x0058 - 0x0058)
class UFlowTaskAbstract_PathBuilderBase : public UFlowTaskAbstractBase
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FlowTaskAbstract_PathBuilderBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FlowTaskAbstract_PathBuilderBase")
	}
	static class UFlowTaskAbstract_PathBuilderBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFlowTaskAbstract_PathBuilderBase>();
	}
};
DUMPER7_ASSERTS_UFlowTaskAbstract_PathBuilderBase;

// Class DungeonArchitectRuntime.DungeonBPFunctionLibrary
// 0x0000 (0x0028 - 0x0028)
class UDungeonBPFunctionLibrary final : public UBlueprintFunctionLibrary
{
public:
	static bool ActorBelongsToDungeon(class ADungeon* Dungeon, class AActor* ActorToCheck);
	static bool DungeonObjectHasAuthority(class UObject* Object);
	static class AActor* SpawnDungeonOwnedActor(class ADungeon* Dungeon, TSubclassOf<class AActor> ActorClass, const struct FTransform& Transform);
	static class ULevelStreamingDynamic* StreamDungeonModuleLevel(class UObject* WorldContextObject, TSoftObjectPtr<class UWorld> Level, int32 InstanceId, const struct FVector& Location, const struct FRotator& Rotation, bool* bOutSuccess);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DungeonBPFunctionLibrary")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DungeonBPFunctionLibrary")
	}
	static class UDungeonBPFunctionLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDungeonBPFunctionLibrary>();
	}
};
DUMPER7_ASSERTS_UDungeonBPFunctionLibrary;

// Class DungeonArchitectRuntime.FlowTaskAbstract_CreateMainPath
// 0x0078 (0x00D0 - 0x0058)
class UFlowTaskAbstract_CreateMainPath : public UFlowTaskAbstract_PathBuilderBase
{
public:
	int32                                         PathSize;                                          // 0x0058(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Rei-SdkDumper ])
	class FString                                 PathName;                                          // 0x0060(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           NodeColor;                                         // 0x0070(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 StartMarkerName;                                   // 0x0080(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 GoalMarkerName;                                    // 0x0090(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 StartNodePathName;                                 // 0x00A0(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 GoalNodePathName;                                  // 0x00B0(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         NumParallelSearches;                               // 0x00C0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C4[0x4];                                       // 0x00C4(0x0004)(Fixing Size After Last Property [ Rei-SdkDumper ])
	int64                                         MaxFramesToProcess;                                // 0x00C8(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FlowTaskAbstract_CreateMainPath")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FlowTaskAbstract_CreateMainPath")
	}
	static class UFlowTaskAbstract_CreateMainPath* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFlowTaskAbstract_CreateMainPath>();
	}
};
DUMPER7_ASSERTS_UFlowTaskAbstract_CreateMainPath;

// Class DungeonArchitectRuntime.DungeonBuilder
// 0x0048 (0x0070 - 0x0028)
class UDungeonBuilder : public UObject
{
public:
	class UDungeonConfig*                         Config;                                            // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_30[0x10];                                      // 0x0030(0x0010)(Fixing Size After Last Property [ Rei-SdkDumper ])
	class ADungeon*                               Dungeon;                                           // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UDungeonModel*                          Model;                                             // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UDungeonQuery*                          Query;                                             // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_58[0x18];                                      // 0x0058(0x0018)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])

public:
	void EmitDungeonMarkers();
	void EmitMarker(const class FString& SocketType, const struct FTransform& Transform);

	TArray<struct FPropSocket> GetMarkers() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DungeonBuilder")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DungeonBuilder")
	}
	static class UDungeonBuilder* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDungeonBuilder>();
	}
};
DUMPER7_ASSERTS_UDungeonBuilder;

// Class DungeonArchitectRuntime.DungeonConfig
// 0x0020 (0x0048 - 0x0028)
class UDungeonConfig : public UObject
{
public:
	class FString                                 OrderCategory;                                     // 0x0028(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Seed;                                              // 0x0038(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Instanced;                                         // 0x003C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Rei-SdkDumper ])
	float                                         MaxBuildTimePerFrameMs;                            // 0x0040(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DungeonConfig")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DungeonConfig")
	}
	static class UDungeonConfig* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDungeonConfig>();
	}
};
DUMPER7_ASSERTS_UDungeonConfig;

// Class DungeonArchitectRuntime.DungeonDebug
// 0x0008 (0x0230 - 0x0228)
class ADungeonDebug final : public AActor
{
public:
	class AActor*                                 CloneTemplate;                                     // 0x0228(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DungeonDebug")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DungeonDebug")
	}
	static class ADungeonDebug* GetDefaultObj()
	{
		return GetDefaultObjImpl<ADungeonDebug>();
	}
};
DUMPER7_ASSERTS_ADungeonDebug;

// Class DungeonArchitectRuntime.DungeonEditorViewportProperties
// 0x0030 (0x0058 - 0x0028)
class UDungeonEditorViewportProperties final : public UObject
{
public:
	class UDungeonConfig*                         DungeonConfig;                                     // 0x0028(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UDungeonMarkerEmitter*>          MarkerEmitters;                                    // 0x0030(0x0010)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, ContainsInstancedReference, SimpleDisplay, NativeAccessSpecifierPublic)
	TSubclassOf<class UDungeonBuilder>            BuilderClass;                                      // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_48[0x10];                                      // 0x0048(0x0010)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DungeonEditorViewportProperties")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DungeonEditorViewportProperties")
	}
	static class UDungeonEditorViewportProperties* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDungeonEditorViewportProperties>();
	}
};
DUMPER7_ASSERTS_UDungeonEditorViewportProperties;

// Class DungeonArchitectRuntime.DungeonEventListener
// 0x0000 (0x0028 - 0x0028)
class UDungeonEventListener : public UObject
{
public:
	void OnDungeonDestroyed(class ADungeon* Dungeon);
	void OnDungeonLayoutBuilt(class ADungeon* Dungeon);
	void OnMarkersEmitted(class ADungeon* Dungeon, TArray<struct FDungeonMarkerInfo>& MarkerList, TArray<struct FDungeonMarkerInfo>* MarkerListRef);
	void OnPostDungeonBuild(class ADungeon* Dungeon);
	void OnPreDungeonBuild(class ADungeon* Dungeon);
	void OnPreDungeonDestroy(class ADungeon* Dungeon);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DungeonEventListener")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DungeonEventListener")
	}
	static class UDungeonEventListener* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDungeonEventListener>();
	}
};
DUMPER7_ASSERTS_UDungeonEventListener;

// Class DungeonArchitectRuntime.DungeonInstancedMeshActor
// 0x0050 (0x0278 - 0x0228)
class ADungeonInstancedMeshActor final : public AActor
{
public:
	uint8                                         Pad_228[0x50];                                     // 0x0228(0x0050)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DungeonInstancedMeshActor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DungeonInstancedMeshActor")
	}
	static class ADungeonInstancedMeshActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<ADungeonInstancedMeshActor>();
	}
};
DUMPER7_ASSERTS_ADungeonInstancedMeshActor;

// Class DungeonArchitectRuntime.DungeonLandscapeModifier
// 0x0040 (0x0068 - 0x0028)
class UDungeonLandscapeModifier final : public UDungeonEventListener
{
public:
	class ALandscape*                             Landscape;                                         // 0x0028(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         HeightBlurRadius;                                  // 0x0030(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         HeightBlurIterations;                              // 0x0034(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         HeightBlurWeight;                                  // 0x0038(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PaintBlurRadius;                                   // 0x003C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         PaintBlurIterations;                               // 0x0040(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PaintBlurWeight;                                   // 0x0044(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCurveFloat*                            PaintBlurWeightCurve;                              // 0x0048(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BaseHeight;                                        // 0x0050(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Rei-SdkDumper ])
	TArray<class ULandscapeLayerInfoObject*>      Layers;                                            // 0x0058(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DungeonLandscapeModifier")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DungeonLandscapeModifier")
	}
	static class UDungeonLandscapeModifier* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDungeonLandscapeModifier>();
	}
};
DUMPER7_ASSERTS_UDungeonLandscapeModifier;

// Class DungeonArchitectRuntime.DungeonStreamingLevel
// 0x0018 (0x0040 - 0x0028)
class UDungeonStreamingLevel : public UObject
{
public:
	class ULevelStreamingDynamic*                 LevelStreaming;                                    // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UPackage*                               LevelPackage;                                      // 0x0030(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_38[0x8];                                       // 0x0038(0x0008)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])

public:
	void HandleChunkHidden();
	void HandleChunkLoaded();
	void HandleChunkUnloaded();
	void HandleChunkVisible();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DungeonStreamingLevel")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DungeonStreamingLevel")
	}
	static class UDungeonStreamingLevel* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDungeonStreamingLevel>();
	}
};
DUMPER7_ASSERTS_UDungeonStreamingLevel;

// Class DungeonArchitectRuntime.DungeonLogicStreamingLevel
// 0x0000 (0x0040 - 0x0040)
class UDungeonLogicStreamingLevel final : public UDungeonStreamingLevel
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DungeonLogicStreamingLevel")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DungeonLogicStreamingLevel")
	}
	static class UDungeonLogicStreamingLevel* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDungeonLogicStreamingLevel>();
	}
};
DUMPER7_ASSERTS_UDungeonLogicStreamingLevel;

// Class DungeonArchitectRuntime.DungeonStreamingChunk
// 0x00D0 (0x00F8 - 0x0028)
class UDungeonStreamingChunk : public UObject
{
public:
	int32                                         OrderNum;                                          // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Rei-SdkDumper ])
	class FString                                 Category;                                          // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGuid                                  ID;                                                // 0x0040(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FBox                                   Bounds;                                            // 0x0050(0x001C)(ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Rei-SdkDumper ])
	TSet<class UDungeonStreamingChunk*>           Neighbors;                                         // 0x0070(0x0050)(NativeAccessSpecifierPublic)
	bool                                          bSpawnRoomChunk;                                   // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C1[0x17];                                      // 0x00C1(0x0017)(Fixing Size After Last Property [ Rei-SdkDumper ])
	class UDungeonStreamingLevel*                 ArtLevel;                                          // 0x00D8(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UDungeonLogicStreamingLevel*            LogicLevel;                                        // 0x00E0(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_E8[0x10];                                      // 0x00E8(0x0010)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])

public:
	void GetAllActorsOfClass(class UClass* InClass, TArray<class AActor*>* OutActors);
	void HandleChunkHidden();
	void HandleChunkLoaded();
	void HandleChunkUnloaded();
	void HandleChunkVisible();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DungeonStreamingChunk")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DungeonStreamingChunk")
	}
	static class UDungeonStreamingChunk* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDungeonStreamingChunk>();
	}
};
DUMPER7_ASSERTS_UDungeonStreamingChunk;

// Class DungeonArchitectRuntime.DungeonLevelStreamingModel
// 0x0090 (0x0140 - 0x00B0)
class UDungeonLevelStreamingModel final : public UActorComponent
{
public:
	TArray<class UDungeonStreamingChunk*>         Chunks;                                            // 0x00B0(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	class UDungeonLevelStreamingNavigation*       StreamingNavigation;                               // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class ADungeon* Dungeon)> OnInitialChunksLoaded;                   // 0x00C8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class ADungeon* Dungeon, class UDungeonStreamingChunk* Chunk)> OnChunkVisible; // 0x00D8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class ADungeon* Dungeon, class UDungeonStreamingChunk* Chunk)> OnChunkUnload; // 0x00E8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(int32 CorridorId)> OnNewCorridor;                                  // 0x00F8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	int32                                         StartRoomId;                                       // 0x0108(0x0004)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_10C[0x24];                                     // 0x010C(0x0024)(Fixing Size After Last Property [ Rei-SdkDumper ])
	TArray<struct FDungeonStreamingChunkParamRep> ChunkParamsToClient;                               // 0x0130(0x0010)(Net, ZeroConstructor, RepNotify, NativeAccessSpecifierPrivate)

public:
	void OnRep_ChunkParamsToClient();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DungeonLevelStreamingModel")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DungeonLevelStreamingModel")
	}
	static class UDungeonLevelStreamingModel* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDungeonLevelStreamingModel>();
	}
};
DUMPER7_ASSERTS_UDungeonLevelStreamingModel;

// Class DungeonArchitectRuntime.DungeonLevelStreamingNavigation
// 0x0010 (0x0038 - 0x0028)
class UDungeonLevelStreamingNavigation final : public UObject
{
public:
	bool                                          bEnabled;                                          // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAutoResizeNavVolume;                              // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2A[0xE];                                       // 0x002A(0x000E)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DungeonLevelStreamingNavigation")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DungeonLevelStreamingNavigation")
	}
	static class UDungeonLevelStreamingNavigation* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDungeonLevelStreamingNavigation>();
	}
};
DUMPER7_ASSERTS_UDungeonLevelStreamingNavigation;

// Class DungeonArchitectRuntime.DungeonMarkerEmitter
// 0x0000 (0x0028 - 0x0028)
class UDungeonMarkerEmitter final : public UObject
{
public:
	void EmitMarkers(class UDungeonBuilder* Builder, class UDungeonModel* Model, class UDungeonConfig* Config, class UDungeonQuery* Query);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DungeonMarkerEmitter")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DungeonMarkerEmitter")
	}
	static class UDungeonMarkerEmitter* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDungeonMarkerEmitter>();
	}
};
DUMPER7_ASSERTS_UDungeonMarkerEmitter;

// Class DungeonArchitectRuntime.DungeonVolume
// 0x0010 (0x0270 - 0x0260)
class ADungeonVolume : public AVolume
{
public:
	class ADungeon*                               Dungeon;                                           // 0x0260(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          RealtimeUpdate;                                    // 0x0268(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_269[0x7];                                      // 0x0269(0x0007)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DungeonVolume")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DungeonVolume")
	}
	static class ADungeonVolume* GetDefaultObj()
	{
		return GetDefaultObjImpl<ADungeonVolume>();
	}
};
DUMPER7_ASSERTS_ADungeonVolume;

// Class DungeonArchitectRuntime.DungeonMarkerReplaceVolume
// 0x0010 (0x0280 - 0x0270)
class ADungeonMarkerReplaceVolume final : public ADungeonVolume
{
public:
	TArray<struct FMarkerReplaceEntry>            Replacements;                                      // 0x0270(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DungeonMarkerReplaceVolume")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DungeonMarkerReplaceVolume")
	}
	static class ADungeonMarkerReplaceVolume* GetDefaultObj()
	{
		return GetDefaultObjImpl<ADungeonMarkerReplaceVolume>();
	}
};
DUMPER7_ASSERTS_ADungeonMarkerReplaceVolume;

// Class DungeonArchitectRuntime.DungeonMesh
// 0x0028 (0x0050 - 0x0028)
class UDungeonMesh final : public UObject
{
public:
	class UStaticMesh*                            StaticMesh;                                        // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FMaterialOverride>              MaterialOverrides;                                 // 0x0030(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	uint32                                        HashCode;                                          // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Rei-SdkDumper ])
	class UStaticMeshComponent*                   Template;                                          // 0x0048(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DungeonMesh")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DungeonMesh")
	}
	static class UDungeonMesh* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDungeonMesh>();
	}
};
DUMPER7_ASSERTS_UDungeonMesh;

// Class DungeonArchitectRuntime.DungeonMiniMap
// 0x00B8 (0x02E0 - 0x0228)
class ADungeonMiniMap : public AActor
{
public:
	int32                                         TextureSize;                                       // 0x0228(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         OutlineThickness;                                  // 0x022C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DoorThickness;                                     // 0x0230(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_234[0x4];                                      // 0x0234(0x0004)(Fixing Size After Last Property [ Rei-SdkDumper ])
	TArray<struct FDungeonMiniMapOverlayIcon>     OverlayIcons;                                      // 0x0238(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	class UMaterialInterface*                     MaterialTemplate;                                  // 0x0248(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FDungeonMiniMapOverlayTracking> DynamicTracking;                                   // 0x0250(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	float                                         BlurRadius;                                        // 0x0260(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         BlurIterations;                                    // 0x0264(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableFogOfWar;                                   // 0x0268(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_269[0x3];                                      // 0x0269(0x0003)(Fixing Size After Last Property [ Rei-SdkDumper ])
	float                                         FogOfWarTextureScale;                              // 0x026C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   FogOfWarTrackingItem;                              // 0x0270(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTexture2D*                             FogOfWarExploreTexture;                            // 0x0278(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FogOfWarVisiblityDistance;                         // 0x0280(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_284[0x4];                                      // 0x0284(0x0004)(Fixing Size After Last Property [ Rei-SdkDumper ])
	class UTexture*                               MaskTexture;                                       // 0x0288(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTextureRenderTarget2D*                 StaticOverlayTexture;                              // 0x0290(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTextureRenderTarget2D*                 DynamicOverlayTexture;                             // 0x0298(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTextureRenderTarget2D*                 FogOfWarTexture;                                   // 0x02A0(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2A8[0x8];                                      // 0x02A8(0x0008)(Fixing Size After Last Property [ Rei-SdkDumper ])
	struct FTransform                             WorldToScreen;                                     // 0x02B0(0x0030)(BlueprintVisible, BlueprintReadOnly, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)

public:
	void BuildLayout(class UDungeonModel* DungeonModel, class UDungeonConfig* DungeonConfig);
	class UMaterialInterface* CreateMaterialInstance();
	class UMaterialInterface* CreateMaterialInstanceFromTemplate(class UMaterialInterface* InMaterialTemplate);
	void UpdateMaterial(class UMaterialInterface* InMaterial);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DungeonMiniMap")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DungeonMiniMap")
	}
	static class ADungeonMiniMap* GetDefaultObj()
	{
		return GetDefaultObjImpl<ADungeonMiniMap>();
	}
};
DUMPER7_ASSERTS_ADungeonMiniMap;

// Class DungeonArchitectRuntime.DungeonMiniMapTrackedObject
// 0x0018 (0x00C8 - 0x00B0)
class UDungeonMiniMapTrackedObject final : public UActorComponent
{
public:
	class FName                                   ID;                                                // 0x00B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   IconName;                                          // 0x00B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOrientToRotation;                                 // 0x00C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DungeonMiniMapTrackedObject")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DungeonMiniMapTrackedObject")
	}
	static class UDungeonMiniMapTrackedObject* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDungeonMiniMapTrackedObject>();
	}
};
DUMPER7_ASSERTS_UDungeonMiniMapTrackedObject;

// Class DungeonArchitectRuntime.DungeonMirrorVolume
// 0x0000 (0x0270 - 0x0270)
class ADungeonMirrorVolume final : public ADungeonVolume
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DungeonMirrorVolume")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DungeonMirrorVolume")
	}
	static class ADungeonMirrorVolume* GetDefaultObj()
	{
		return GetDefaultObjImpl<ADungeonMirrorVolume>();
	}
};
DUMPER7_ASSERTS_ADungeonMirrorVolume;

// Class DungeonArchitectRuntime.DungeonModel
// 0x0000 (0x0028 - 0x0028)
class UDungeonModel : public UObject
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DungeonModel")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DungeonModel")
	}
	static class UDungeonModel* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDungeonModel>();
	}
};
DUMPER7_ASSERTS_UDungeonModel;

// Class DungeonArchitectRuntime.DungeonModelHelper
// 0x0000 (0x0028 - 0x0028)
class UDungeonModelHelper : public UObject
{
public:
	static void ExpandBounds(const struct FRectangle& Bounds, int32 Size, struct FRectangle* Result);
	static void GetCenterExtent(const struct FRectangle& Rectangle, struct FVector* Center, struct FVector* Extent);
	static void GetRectAreaPoints(const struct FRectangle& Rectangle, TArray<struct FIntVector>* BorderPoints);
	static void GetRectBorderPoints(const struct FRectangle& Rectangle, TArray<struct FIntVector>* BorderPoints);
	static struct FIntVector MakeIntVector(const struct FVector& In);
	static struct FVector MakeVector(const struct FIntVector& In, float Scale);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DungeonModelHelper")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DungeonModelHelper")
	}
	static class UDungeonModelHelper* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDungeonModelHelper>();
	}
};
DUMPER7_ASSERTS_UDungeonModelHelper;

// Class DungeonArchitectRuntime.SnapMapDungeonModel
// 0x0028 (0x0050 - 0x0028)
class USnapMapDungeonModel final : public UDungeonModel
{
public:
	TArray<struct FSnapConnectionInstance>        Connections;                                       // 0x0028(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FSnapMapModuleInstanceSerializedData> ModuleInstances;                             // 0x0038(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	class UGrammarScriptGraph*                    MissionGraph;                                      // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SnapMapDungeonModel")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SnapMapDungeonModel")
	}
	static class USnapMapDungeonModel* GetDefaultObj()
	{
		return GetDefaultObjImpl<USnapMapDungeonModel>();
	}
};
DUMPER7_ASSERTS_USnapMapDungeonModel;

// Class DungeonArchitectRuntime.DungeonNavLinkProxy
// 0x0000 (0x0278 - 0x0278)
class ADungeonNavLinkProxy final : public ANavLinkProxy
{
public:
	void SetupSmartLinkData(const struct FVector& Start, const struct FVector& End, ENavLinkDirection Direction);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DungeonNavLinkProxy")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DungeonNavLinkProxy")
	}
	static class ADungeonNavLinkProxy* GetDefaultObj()
	{
		return GetDefaultObjImpl<ADungeonNavLinkProxy>();
	}
};
DUMPER7_ASSERTS_ADungeonNavLinkProxy;

// Class DungeonArchitectRuntime.DungeonNegationVolume
// 0x0008 (0x0278 - 0x0270)
class ADungeonNegationVolume final : public ADungeonVolume
{
public:
	bool                                          Reversed;                                          // 0x0270(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          AffectsUserDefinedCells;                           // 0x0271(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_272[0x6];                                      // 0x0272(0x0006)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DungeonNegationVolume")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DungeonNegationVolume")
	}
	static class ADungeonNegationVolume* GetDefaultObj()
	{
		return GetDefaultObjImpl<ADungeonNegationVolume>();
	}
};
DUMPER7_ASSERTS_ADungeonNegationVolume;

// Class DungeonArchitectRuntime.DungeonQuery
// 0x0038 (0x0060 - 0x0028)
class alignas(0x10) UDungeonQuery : public UObject
{
public:
	class UDungeonQueryUserState*                 UserState;                                         // 0x0028(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_30[0x30];                                      // 0x0030(0x0030)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DungeonQuery")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DungeonQuery")
	}
	static class UDungeonQuery* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDungeonQuery>();
	}
};
DUMPER7_ASSERTS_UDungeonQuery;

// Class DungeonArchitectRuntime.SnapGridFlowQuery
// 0x0000 (0x0060 - 0x0060)
class USnapGridFlowQuery final : public UDungeonQuery
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SnapGridFlowQuery")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SnapGridFlowQuery")
	}
	static class USnapGridFlowQuery* GetDefaultObj()
	{
		return GetDefaultObjImpl<USnapGridFlowQuery>();
	}
};
DUMPER7_ASSERTS_USnapGridFlowQuery;

// Class DungeonArchitectRuntime.DungeonParticleSystem
// 0x0010 (0x0238 - 0x0228)
class ADungeonParticleSystem final : public AActor
{
public:
	uint8                                         Pad_228[0x10];                                     // 0x0228(0x0010)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DungeonParticleSystem")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DungeonParticleSystem")
	}
	static class ADungeonParticleSystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<ADungeonParticleSystem>();
	}
};
DUMPER7_ASSERTS_ADungeonParticleSystem;

// Class DungeonArchitectRuntime.DungeonQueryUserState
// 0x0050 (0x0078 - 0x0028)
class UDungeonQueryUserState final : public UObject
{
public:
	TMap<class FName, class FString>              UserData;                                          // 0x0028(0x0050)(NativeAccessSpecifierPrivate)

public:
	void ClearAllState();
	bool GetBool(const class FName& Name_0);
	float GetFloat(const class FName& Name_0);
	int32 GetInt(const class FName& Name_0);
	class FString GetString(const class FName& Name_0);
	struct FVector GetVector(const class FName& Name_0);
	void SetBool(const class FName& Name_0, bool Value);
	void SetFloat(const class FName& Name_0, float Value);
	void SetInt(const class FName& Name_0, int32 Value);
	void SetString(const class FName& Name_0, const class FString& Value);
	void SetVector(const class FName& Name_0, const struct FVector& Value);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DungeonQueryUserState")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DungeonQueryUserState")
	}
	static class UDungeonQueryUserState* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDungeonQueryUserState>();
	}
};
DUMPER7_ASSERTS_UDungeonQueryUserState;

// Class DungeonArchitectRuntime.DungeonTransformLogic
// 0x0000 (0x0028 - 0x0028)
class UDungeonTransformLogic : public UObject
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DungeonTransformLogic")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DungeonTransformLogic")
	}
	static class UDungeonTransformLogic* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDungeonTransformLogic>();
	}
};
DUMPER7_ASSERTS_UDungeonTransformLogic;

// Class DungeonArchitectRuntime.SnapMapDungeonTransformLogic
// 0x0000 (0x0028 - 0x0028)
class USnapMapDungeonTransformLogic final : public UDungeonTransformLogic
{
public:
	void GetNodeOffset(class USnapMapDungeonModel* Model, struct FTransform* Offset);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SnapMapDungeonTransformLogic")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SnapMapDungeonTransformLogic")
	}
	static class USnapMapDungeonTransformLogic* GetDefaultObj()
	{
		return GetDefaultObjImpl<USnapMapDungeonTransformLogic>();
	}
};
DUMPER7_ASSERTS_USnapMapDungeonTransformLogic;

// Class DungeonArchitectRuntime.DungeonSelectorLogic
// 0x0000 (0x0028 - 0x0028)
class UDungeonSelectorLogic : public UObject
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DungeonSelectorLogic")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DungeonSelectorLogic")
	}
	static class UDungeonSelectorLogic* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDungeonSelectorLogic>();
	}
};
DUMPER7_ASSERTS_UDungeonSelectorLogic;

// Class DungeonArchitectRuntime.DungeonSpatialConstraint
// 0x0008 (0x0030 - 0x0028)
class UDungeonSpatialConstraint : public UObject
{
public:
	bool                                          bApplyBaseRotation;                                // 0x0028(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bRotateToFitConstraint;                            // 0x0029(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DungeonSpatialConstraint")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DungeonSpatialConstraint")
	}
	static class UDungeonSpatialConstraint* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDungeonSpatialConstraint>();
	}
};
DUMPER7_ASSERTS_UDungeonSpatialConstraint;

// Class DungeonArchitectRuntime.DungeonSpawnLogic
// 0x0000 (0x0028 - 0x0028)
class UDungeonSpawnLogic final : public UObject
{
public:
	void OnItemSpawn(class AActor* Actor, class ADungeon* Dungeon);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DungeonSpawnLogic")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DungeonSpawnLogic")
	}
	static class UDungeonSpawnLogic* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDungeonSpawnLogic>();
	}
};
DUMPER7_ASSERTS_UDungeonSpawnLogic;

// Class DungeonArchitectRuntime.IsaacRoomLayoutBuilder
// 0x0000 (0x0028 - 0x0028)
class UIsaacRoomLayoutBuilder : public UObject
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("IsaacRoomLayoutBuilder")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"IsaacRoomLayoutBuilder")
	}
	static class UIsaacRoomLayoutBuilder* GetDefaultObj()
	{
		return GetDefaultObjImpl<UIsaacRoomLayoutBuilder>();
	}
};
DUMPER7_ASSERTS_UIsaacRoomLayoutBuilder;

// Class DungeonArchitectRuntime.StylizedIsaacRoomLayoutBuilder
// 0x0008 (0x0030 - 0x0028)
class UStylizedIsaacRoomLayoutBuilder final : public UIsaacRoomLayoutBuilder
{
public:
	int32                                         minBrushSize;                                      // 0x0028(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         maxBrushSize;                                      // 0x002C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("StylizedIsaacRoomLayoutBuilder")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"StylizedIsaacRoomLayoutBuilder")
	}
	static class UStylizedIsaacRoomLayoutBuilder* GetDefaultObj()
	{
		return GetDefaultObjImpl<UStylizedIsaacRoomLayoutBuilder>();
	}
};
DUMPER7_ASSERTS_UStylizedIsaacRoomLayoutBuilder;

// Class DungeonArchitectRuntime.DungeonThemeAsset
// 0x0018 (0x0040 - 0x0028)
class UDungeonThemeAsset final : public UObject
{
public:
	TArray<struct FPropTypeData>                  Props;                                             // 0x0028(0x0010)(ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	class UDungeonEditorViewportProperties*       PreviewViewportProperties;                         // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DungeonThemeAsset")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DungeonThemeAsset")
	}
	static class UDungeonThemeAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDungeonThemeAsset>();
	}
};
DUMPER7_ASSERTS_UDungeonThemeAsset;

// Class DungeonArchitectRuntime.DungeonThemeOverrideVolume
// 0x0018 (0x0288 - 0x0270)
class ADungeonThemeOverrideVolume final : public ADungeonVolume
{
public:
	bool                                          Reversed;                                          // 0x0270(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          FallbackOnMissingMarkers;                          // 0x0271(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_272[0x6];                                      // 0x0272(0x0006)(Fixing Size After Last Property [ Rei-SdkDumper ])
	class UDungeonThemeAsset*                     ThemeOverride;                                     // 0x0278(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         OverrideWeight;                                    // 0x0280(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_284[0x4];                                      // 0x0284(0x0004)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DungeonThemeOverrideVolume")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DungeonThemeOverrideVolume")
	}
	static class ADungeonThemeOverrideVolume* GetDefaultObj()
	{
		return GetDefaultObjImpl<ADungeonThemeOverrideVolume>();
	}
};
DUMPER7_ASSERTS_ADungeonThemeOverrideVolume;

// Class DungeonArchitectRuntime.SnapMapDungeonBuilder
// 0x0030 (0x00A0 - 0x0070)
class USnapMapDungeonBuilder final : public UDungeonBuilder
{
public:
	uint8                                         Pad_70[0x30];                                      // 0x0070(0x0030)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])

public:
	void BuildPreviewSnapLayout();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SnapMapDungeonBuilder")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SnapMapDungeonBuilder")
	}
	static class USnapMapDungeonBuilder* GetDefaultObj()
	{
		return GetDefaultObjImpl<USnapMapDungeonBuilder>();
	}
};
DUMPER7_ASSERTS_USnapMapDungeonBuilder;

// Class DungeonArchitectRuntime.DungeonToolData
// 0x0000 (0x0028 - 0x0028)
class UDungeonToolData : public UObject
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DungeonToolData")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DungeonToolData")
	}
	static class UDungeonToolData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDungeonToolData>();
	}
};
DUMPER7_ASSERTS_UDungeonToolData;

// Class DungeonArchitectRuntime.FloorPlanBuilder
// 0x0100 (0x0170 - 0x0070)
