#pragma once

/*
* SDK generated by Rei-SdkDumper
* Based on Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DungeonArchitectRuntime

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// Enum DungeonArchitectRuntime.EDungeonLevelStreamChunkSelection
// NumValues: 0x0003
enum class EDungeonLevelStreamChunkSelection : uint8
{
	PlayerLocations                          = 0,
	SpawnRoomLocations                       = 1,
	EDungeonLevelStreamChunkSelection_MAX    = 2,
};

// Enum DungeonArchitectRuntime.EDungeonLevelStreamUnloadMethod
// NumValues: 0x0003
enum class EDungeonLevelStreamUnloadMethod : uint8
{
	KeepHiddenChunksInMemory                 = 0,
	UnloadHiddenChunks                       = 1,
	EDungeonLevelStreamUnloadMethod_MAX      = 2,
};

// Enum DungeonArchitectRuntime.EDungeonLevelStreamLoadMethod
// NumValues: 0x0003
enum class EDungeonLevelStreamLoadMethod : uint8
{
	LoadOnDemand                             = 0,
	LoadEverythingInMemory                   = 1,
	EDungeonLevelStreamLoadMethod_MAX        = 2,
};

// Enum DungeonArchitectRuntime.EDungeonLevelStreamingStrategy
// NumValues: 0x0003
enum class EDungeonLevelStreamingStrategy : uint8
{
	LayoutDepth                              = 0,
	Distance                                 = 1,
	EDungeonLevelStreamingStrategy_MAX       = 2,
};

// Enum DungeonArchitectRuntime.EDungeonLevelStreamingLoadingStrategy
// NumValues: 0x0004
enum class EDungeonLevelStreamingLoadingStrategy : uint8
{
	PreloadEverything                        = 0,
	LoadOnDemand                             = 1,
	OnlyVisibleLoaded                        = 2,
	EDungeonLevelStreamingLoadingStrategy_MAX = 3,
};

// Enum DungeonArchitectRuntime.EDungeonMiniMapIconCoordinateSystem
// NumValues: 0x0003
enum class EDungeonMiniMapIconCoordinateSystem : uint8
{
	Pixels                                   = 0,
	WorldCoordinates                         = 1,
	EDungeonMiniMapIconCoordinateSystem_MAX  = 2,
};

// Enum DungeonArchitectRuntime.EFlowGraphItemType
// NumValues: 0x0009
enum class EFlowGraphItemType : uint8
{
	Enemy                                    = 0,
	Entrance                                 = 1,
	Exit                                     = 2,
	Treasure                                 = 3,
	Key                                      = 4,
	Lock                                     = 5,
	Teleporter                               = 6,
	Custom                                   = 7,
	EFlowGraphItemType_MAX                   = 8,
};

// Enum DungeonArchitectRuntime.EFlowAbstractLinkType
// NumValues: 0x0004
enum class EFlowAbstractLinkType : uint8
{
	Unconnected                              = 0,
	Connected                                = 1,
	OneWay                                   = 2,
	EFlowAbstractLinkType_MAX                = 3,
};

// Enum DungeonArchitectRuntime.EridFlowTask_SpawnItemsMethod
// NumValues: 0x0003
enum class EridFlowTask_SpawnItemsMethod : uint8
{
	RandomRange                              = 0,
	LinearDifficulty                         = 1,
	EridFlowTask_MAX                         = 2,
};

// Enum DungeonArchitectRuntime.ERuleNodeExecutionMode
// NumValues: 0x0005
enum class ERuleNodeExecutionMode : uint8
{
	RunOnce                                  = 0,
	RunWithProbability                       = 1,
	Iterate                                  = 2,
	IterateRange                             = 3,
	ERuleNodeExecutionMode_MAX               = 4,
};

// Enum DungeonArchitectRuntime.EGridDungeonWallType
// NumValues: 0x0003
enum class EGridDungeonWallType : uint8
{
	WallsAsEdges                             = 0,
	WallsAsTileBlocks                        = 1,
	EGridDungeonWallType_MAX                 = 2,
};

// Enum DungeonArchitectRuntime.FCellType
// NumValues: 0x0005
enum class EFCellType : uint8
{
	Room                                     = 0,
	Corridor                                 = 1,
	CorridorPadding                          = 2,
	Unknown                                  = 3,
	FCellType_MAX                            = 4,
};

// Enum DungeonArchitectRuntime.DungeonModelBuildState
// NumValues: 0x0007
enum class EDungeonModelBuildState : uint8
{
	Initial                                  = 0,
	Separation                               = 1,
	Triangulation                            = 2,
	SpanningTree                             = 3,
	Corridors                                = 4,
	Complete                                 = 5,
	DungeonModelBuildState_MAX               = 6,
};

// Enum DungeonArchitectRuntime.EGridPaintToolCellType
// NumValues: 0x0003
enum class EGridPaintToolCellType : uint8
{
	Corridor                                 = 0,
	Room                                     = 1,
	EGridPaintToolCellType_MAX               = 2,
};

// Enum DungeonArchitectRuntime.EGridFlowTilemapWallGenerationMethod
// NumValues: 0x0003
enum class EGridFlowTilemapWallGenerationMethod : uint8
{
	WallAsTiles                              = 0,
	WallAsEdges                              = 1,
	EGridFlowTilemapWallGenerationMethod_MAX = 2,
};

// Enum DungeonArchitectRuntime.EGridFlowAbstractNodeRoomType
// NumValues: 0x0005
enum class EGridFlowAbstractNodeRoomType : uint8
{
	Unknown                                  = 0,
	Room                                     = 1,
	Corridor                                 = 2,
	Cave                                     = 3,
	EGridFlowAbstractNodeRoomType_MAX        = 4,
};

// Enum DungeonArchitectRuntime.EGridFlowTilemapCellOverlayMergeWallOverlayRule
// NumValues: 0x0004
enum class EGridFlowTilemapCellOverlayMergeWallOverlayRule : uint8
{
	KeepWallAndOverlay                       = 0,
	KeepWallRemoveOverlay                    = 1,
	KeepOverlayRemoveWall                    = 2,
	EGridFlowTilemapCellOverlayMergeWallOverlayRule_MAX = 3,
};

// Enum DungeonArchitectRuntime.EGridFlowTilemapCellCategory
// NumValues: 0x0004
enum class EGridFlowTilemapCellCategory : uint8
{
	Layout                                   = 0,
	Biome                                    = 1,
	Elevation                                = 2,
	EGridFlowTilemapCellCategory_MAX         = 3,
};

// Enum DungeonArchitectRuntime.EGridFlowTilemapEdgeType
// NumValues: 0x0005
enum class EGridFlowTilemapEdgeType : uint8
{
	Empty                                    = 0,
	Wall                                     = 1,
	Fence                                    = 2,
	Door                                     = 3,
	EGridFlowTilemapEdgeType_MAX             = 4,
};

// Enum DungeonArchitectRuntime.EGridFlowTilemapCellType
// NumValues: 0x0006
enum class EGridFlowTilemapCellType : uint8
{
	Empty                                    = 0,
	Floor                                    = 1,
	Wall                                     = 2,
	Door                                     = 3,
	Custom                                   = 4,
	EGridFlowTilemapCellType_MAX             = 5,
};

// Enum DungeonArchitectRuntime.EGridSpatialCellOccupation
// NumValues: 0x0004
enum class EGridSpatialCellOccupation : uint8
{
	DontCare                                 = 0,
	Occupied                                 = 1,
	Empty                                    = 2,
	EGridSpatialCellOccupation_MAX           = 3,
};

// Enum DungeonArchitectRuntime.EIsaacRoomTileType
// NumValues: 0x0004
enum class EIsaacRoomTileType : uint8
{
	Floor                                    = 0,
	Door                                     = 1,
	Empty                                    = 2,
	EIsaacRoomTileType_MAX                   = 3,
};

// Enum DungeonArchitectRuntime.EIsaacRoomType
// NumValues: 0x0006
enum class EIsaacRoomType : uint8
{
	Normal                                   = 0,
	Spawn                                    = 1,
	Treasure                                 = 2,
	Boss                                     = 4,
	Exit                                     = 8,
	EIsaacRoomType_MAX                       = 9,
};

// Enum DungeonArchitectRuntime.ESimpleCityCellType
// NumValues: 0x0006
enum class ESimpleCityCellType : uint8
{
	Road                                     = 0,
	House                                    = 1,
	Park                                     = 2,
	UserDefined                              = 3,
	Empty                                    = 4,
	ESimpleCityCellType_MAX                  = 5,
};

// Enum DungeonArchitectRuntime.ESimpleCitySpatialCellOccupation
// NumValues: 0x0006
enum class ESimpleCitySpatialCellOccupation : uint8
{
	Ignore                                   = 0,
	Road                                     = 1,
	House                                    = 2,
	Park                                     = 3,
	Outskirts                                = 4,
	ESimpleCitySpatialCellOccupation_MAX     = 5,
};

// Enum DungeonArchitectRuntime.ESnapConnectionConstraint
// NumValues: 0x0004
enum class ESnapConnectionConstraint : uint8
{
	Magnet                                   = 0,
	PlugMale                                 = 1,
	PlugFemale                               = 2,
	ESnapConnectionConstraint_MAX            = 3,
};

// Enum DungeonArchitectRuntime.ESnapConnectionDoorType
// NumValues: 0x0008
enum class ESnapConnectionDoorType : uint8
{
	NotApplicable                            = 0,
	NormalDoor                               = 1,
	OneWayDoor                               = 2,
	OneWayDoorUp                             = 3,
	OneWayDoorDown                           = 4,
	LockedDoor                               = 5,
	CustomDoor                               = 6,
	ESnapConnectionDoorType_MAX              = 7,
};

// Enum DungeonArchitectRuntime.ESnapConnectionState
// NumValues: 0x0004
enum class ESnapConnectionState : uint8
{
	Unknown                                  = 0,
	Door                                     = 1,
	Wall                                     = 2,
	ESnapConnectionState_MAX                 = 3,
};

// Enum DungeonArchitectRuntime.ESnapFlowAGTaskModuleCategoryOverrideMethod
// NumValues: 0x0004
enum class ESnapFlowAGTaskModuleCategoryOverrideMethod : uint8
{
	None                                     = 0,
	StartEnd                                 = 1,
	Blueprint                                = 2,
	ESnapFlowAGTaskModuleCategoryOverrideMethod_MAX = 3,
};

// ScriptStruct DungeonArchitectRuntime.DungeonMiniMapOverlayIcon
// 0x0030 (0x0030 - 0x0000)
struct FDungeonMiniMapOverlayIcon final
{
public:
	class FName                                   Name;                                              // 0x0000(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTexture2D*                             Icon;                                              // 0x0008(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ScreenSize;                                        // 0x0010(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EDungeonMiniMapIconCoordinateSystem           ScreenSizeType;                                    // 0x0014(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Rei-SdkDumper ])
	struct FLinearColor                           Tint;                                              // 0x0018(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Rotation;                                          // 0x0028(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_FDungeonMiniMapOverlayIcon;

// ScriptStruct DungeonArchitectRuntime.SnapConnectionInstance
// 0x0090 (0x0090 - 0x0000)
struct FSnapConnectionInstance final
{
public:
	struct FGuid                                  ModuleA;                                           // 0x0000(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGuid                                  DoorA;                                             // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGuid                                  ModuleB;                                           // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGuid                                  DoorB;                                             // 0x0030(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FTransform                             WorldTransform;                                    // 0x0040(0x0030)(IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bHasSpawnedDoorActor;                              // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bReverse;                                          // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_72[0x6];                                       // 0x0072(0x0006)(Fixing Size After Last Property [ Rei-SdkDumper ])
	TArray<TWeakObjectPtr<class AActor>>          SpawnedDoorActors;                                 // 0x0078(0x0010)(ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
	uint8                                         Pad_88[0x8];                                       // 0x0088(0x0008)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_FSnapConnectionInstance;

// ScriptStruct DungeonArchitectRuntime.DungeonSchemaAction_NewNode
// 0x0008 (0x0108 - 0x0100)
struct FDungeonSchemaAction_NewNode final : public FEdGraphSchemaAction
{
public:
	class UEdGraphNode*                           NodeTemplate;                                      // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FDungeonSchemaAction_NewNode;

// ScriptStruct DungeonArchitectRuntime.DungeonLevelStreamingConfig
// 0x0018 (0x0018 - 0x0000)
struct FDungeonLevelStreamingConfig final
{
public:
	bool                                          bEnabledLevelStreaming;                            // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EDungeonLevelStreamChunkSelection             InitialLoadLocation;                               // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EDungeonLevelStreamingStrategy                StreamingStrategy;                                 // 0x0002(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3[0x1];                                        // 0x0003(0x0001)(Fixing Size After Last Property [ Rei-SdkDumper ])
	int32                                         VisibilityRoomDepth;                               // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                VisibilityDistance;                                // 0x0008(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EDungeonLevelStreamLoadMethod                 LoadMethod;                                        // 0x0014(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EDungeonLevelStreamUnloadMethod               UnloadMethod;                                      // 0x0015(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bProcessStreamingNavigation;                       // 0x0016(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_17[0x1];                                       // 0x0017(0x0001)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_FDungeonLevelStreamingConfig;

// ScriptStruct DungeonArchitectRuntime.DungeonStreamingChunkParamRep
// 0x0098 (0x0098 - 0x0000)
struct FDungeonStreamingChunkParamRep final
{
public:
	class FString                                 LevelLongPackageName;                              // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 LogicLevelLongPackageName;                         // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint32                                        InstanceId;                                        // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Location;                                          // 0x0024(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               Rotation;                                          // 0x0030(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	int32                                         OrderNum;                                          // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Category;                                          // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGuid                                  ID;                                                // 0x0050(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FBox                                   Bounds;                                            // 0x0060(0x001C)(ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Rei-SdkDumper ])
	TArray<struct FGuid>                          Neighbors;                                         // 0x0080(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          bSpawnRoomChunk;                                   // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_FDungeonStreamingChunkParamRep;

// ScriptStruct DungeonArchitectRuntime.MarkerReplaceEntry
// 0x0020 (0x0020 - 0x0000)
struct FMarkerReplaceEntry final
{
public:
	class FString                                 MarkerName;                                        // 0x0000(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ReplacementName;                                   // 0x0010(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FMarkerReplaceEntry;

// ScriptStruct DungeonArchitectRuntime.MaterialOverride
// 0x0010 (0x0010 - 0x0000)
struct FMaterialOverride final
{
public:
	int32                                         Index;                                             // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Rei-SdkDumper ])
	class UMaterialInterface*                     Material;                                          // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FMaterialOverride;

// ScriptStruct DungeonArchitectRuntime.DungeonMiniMapOverlayTracking
// 0x001C (0x001C - 0x0000)
struct FDungeonMiniMapOverlayTracking final
{
public:
	TWeakObjectPtr<class AActor>                  TrackedActor;                                      // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   ID;                                                // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   IconName;                                          // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOrientToRotation;                                 // 0x0018(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_FDungeonMiniMapOverlayTracking;

// ScriptStruct DungeonArchitectRuntime.DungeonMarkerInfo
// 0x0060 (0x0060 - 0x0000)
struct FDungeonMarkerInfo final
{
public:
	struct FTransform                             Transform;                                         // 0x0000(0x0030)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	class FName                                   NodeId;                                            // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UDungeonSpawnLogic*>             SpawnLogics;                                       // 0x0038(0x0010)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	class UObject*                                TemplateObject;                                    // 0x0048(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_50[0x10];                                      // 0x0050(0x0010)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_FDungeonMarkerInfo;

// ScriptStruct DungeonArchitectRuntime.PropChildSocketData
// 0x0040 (0x0040 - 0x0000)
struct FPropChildSocketData final
{
public:
	class FString                                 SocketType;                                        // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FTransform                             Offset;                                            // 0x0010(0x0030)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FPropChildSocketData;

// ScriptStruct DungeonArchitectRuntime.PropTypeData
// 0x00C0 (0x00C0 - 0x0000)
struct FPropTypeData final
{
public:
	class FName                                   NodeId;                                            // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                AssetObject;                                       // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 AttachToSocket;                                    // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Probability;                                       // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseSelectionLogic;                                // 0x0024(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bLogicOverridesAffinity;                           // 0x0025(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_26[0x2];                                       // 0x0026(0x0002)(Fixing Size After Last Property [ Rei-SdkDumper ])
	TArray<class UDungeonSelectorLogic*>          SelectionLogics;                                   // 0x0028(0x0010)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	bool                                          bUseTransformLogic;                                // 0x0038(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Rei-SdkDumper ])
	TArray<class UDungeonTransformLogic*>         TransformLogics;                                   // 0x0040(0x0010)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	bool                                          bUseSpawnLogic;                                    // 0x0050(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Rei-SdkDumper ])
	TArray<class UDungeonSpawnLogic*>             SpawnLogics;                                       // 0x0058(0x0010)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	bool                                          ConsumeOnAttach;                                   // 0x0068(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Rei-SdkDumper ])
	struct FTransform                             Offset;                                            // 0x0070(0x0030)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bUseSpatialConstraint;                             // 0x00A0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Rei-SdkDumper ])
	class UDungeonSpatialConstraint*              SpatialConstraint;                                 // 0x00A8(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FPropChildSocketData>           ChildSockets;                                      // 0x00B0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FPropTypeData;

// ScriptStruct DungeonArchitectRuntime.PropSocket
// 0x0080 (0x0080 - 0x0000)
struct FPropSocket final
{
public:
	int32                                         ID;                                                // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Rei-SdkDumper ])
	class FString                                 SocketType;                                        // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ClusterThemeOverride;                              // 0x0018(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Rei-SdkDumper ])
	struct FTransform                             Transform;                                         // 0x0030(0x0030)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          IsConsumed;                                        // 0x0060(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_61[0x1F];                                      // 0x0061(0x001F)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_FPropSocket;

// ScriptStruct DungeonArchitectRuntime.ClusterThemeInfo
// 0x0020 (0x0020 - 0x0000)
struct FClusterThemeInfo final
{
public:
	class FString                                 ClusterThemeName;                                  // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UDungeonThemeAsset*>             Themes;                                            // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FClusterThemeInfo;

// ScriptStruct DungeonArchitectRuntime.GridFlowItemCustomInfo
// 0x0038 (0x0038 - 0x0000)
struct FGridFlowItemCustomInfo final
{
public:
	class FString                                 PreviewText;                                       // 0x0000(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           PreviewTextColor;                                  // 0x0010(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           PreviewBackgroundColor;                            // 0x0020(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FontScale;                                         // 0x0030(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_FGridFlowItemCustomInfo;

// ScriptStruct DungeonArchitectRuntime.FlowAbstractNodeGroup
// 0x0020 (0x0020 - 0x0000)
struct FFlowAbstractNodeGroup final
{
public:
	struct FGuid                                  GroupId;                                           // 0x0000(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FGuid>                          GroupNodes;                                        // 0x0010(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FFlowAbstractNodeGroup;

// ScriptStruct DungeonArchitectRuntime.RuleNodeExecutionModeConfig
// 0x0010 (0x0010 - 0x0000)
struct FRuleNodeExecutionModeConfig final
{
public:
	float                                         RunProbability;                                    // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         IterationCount;                                    // 0x0004(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         IterationCountMin;                                 // 0x0008(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         IterationCountMax;                                 // 0x000C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FRuleNodeExecutionModeConfig;

// ScriptStruct DungeonArchitectRuntime.StairInfo
// 0x0040 (0x0040 - 0x0000)
struct FStairInfo final
{
public:
	int32                                         OwnerCell;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ConnectedToCell;                                   // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Position;                                          // 0x0008(0x000C)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0xC];                                       // 0x0014(0x000C)(Fixing Size After Last Property [ Rei-SdkDumper ])
	struct FQuat                                  Rotation;                                          // 0x0020(0x0010)(BlueprintVisible, BlueprintReadOnly, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FIntVector                             IPosition;                                         // 0x0030(0x000C)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_FStairInfo;

// ScriptStruct DungeonArchitectRuntime.GridCellInfo
// 0x0008 (0x0008 - 0x0000)
struct FGridCellInfo final
{
public:
	int32                                         CellId;                                            // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EFCellType                                    CellType;                                          // 0x0004(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ContainsDoor;                                      // 0x0005(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_FGridCellInfo;

// ScriptStruct DungeonArchitectRuntime.CellDoor
// 0x0024 (0x0024 - 0x0000)
struct alignas(0x04) FCellDoor final
{
public:
	uint8                                         Pad_0[0x24];                                       // 0x0000(0x0024)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_FCellDoor;

// ScriptStruct DungeonArchitectRuntime.Rectangle
// 0x0018 (0x0018 - 0x0000)
struct FRectangle final
{
public:
	struct FIntVector                             Location;                                          // 0x0000(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FIntVector                             Size;                                              // 0x000C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FRectangle;

// ScriptStruct DungeonArchitectRuntime.Cell
// 0x0058 (0x0058 - 0x0000)
struct FCell final
{
public:
	int32                                         ID;                                                // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRectangle                             Bounds;                                            // 0x0004(0x0018)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	EFCellType                                    CellType;                                          // 0x001C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          UserDefined;                                       // 0x001D(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1E[0x2];                                       // 0x001E(0x0002)(Fixing Size After Last Property [ Rei-SdkDumper ])
	int32                                         ClusterId;                                         // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Rei-SdkDumper ])
	TArray<int32>                                 ConnectedRooms;                                    // 0x0028(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<int32>                                 FixedRoomConnections;                              // 0x0038(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<int32>                                 AdjacentCells;                                     // 0x0048(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FCell;

// ScriptStruct DungeonArchitectRuntime.GridToolRectStrokeData
// 0x001C (0x001C - 0x0000)
struct FGridToolRectStrokeData final
{
public:
	struct FRectangle                             Rectangle;                                         // 0x0000(0x0018)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	EGridPaintToolCellType                        CellType;                                          // 0x0018(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_FGridToolRectStrokeData;

// ScriptStruct DungeonArchitectRuntime.GridToolPaintStrokeData
// 0x0010 (0x0010 - 0x0000)
struct FGridToolPaintStrokeData final
{
public:
	struct FIntVector                             Location;                                          // 0x0000(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EGridPaintToolCellType                        CellType;                                          // 0x000C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_FGridToolPaintStrokeData;

// ScriptStruct DungeonArchitectRuntime.GridFlowChunkQueryResult
// 0x0038 (0x0038 - 0x0000)
struct FGridFlowChunkQueryResult final
{
public:
	struct FIntPoint                              LayoutNodeCoord;                                   // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                TilemapCoordStart;                                 // 0x0008(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                TilemapCoordEnd;                                   // 0x0014(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FVector>                        TileCoords;                                        // 0x0020(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	EGridFlowAbstractNodeRoomType                 RoomType;                                          // 0x0030(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_FGridFlowChunkQueryResult;

// ScriptStruct DungeonArchitectRuntime.GridFlowExecNodeTilemapOverlayNoiseSettings
// 0x001C (0x001C - 0x0000)
struct FGridFlowExecNodeTilemapOverlayNoiseSettings final
{
public:
	int32                                         NoiseOctaves;                                      // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         NoiseFrequency;                                    // 0x0004(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         NoiseValuePower;                                   // 0x0008(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         NoiseMinValue;                                     // 0x000C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         NoiseMaxValue;                                     // 0x0010(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         NoiseThreshold;                                    // 0x0014(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MinDistFromMainPath;                               // 0x0018(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FGridFlowExecNodeTilemapOverlayNoiseSettings;

// ScriptStruct DungeonArchitectRuntime.GridFlowAbstractNodeTilemapMetadata
// 0x0020 (0x0020 - 0x0000)
struct FGridFlowAbstractNodeTilemapMetadata final
{
public:
	struct FIntPoint                              TileCoordStart;                                    // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FIntPoint                              TileCoordEnd;                                      // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FIntPoint>                      Tiles;                                             // 0x0010(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FGridFlowAbstractNodeTilemapMetadata;

// ScriptStruct DungeonArchitectRuntime.GridFlowTilemapCellWallInfo
// 0x0010 (0x0010 - 0x0000)
struct FGridFlowTilemapCellWallInfo final
{
public:
	TArray<struct FIntPoint>                      OwningTiles;                                       // 0x0000(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FGridFlowTilemapCellWallInfo;

// ScriptStruct DungeonArchitectRuntime.GridFlowTilemapCellDoorInfo
// 0x0020 (0x0020 - 0x0000)
struct FGridFlowTilemapCellDoorInfo final
{
public:
	bool                                          bLocked;                                           // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOneWay;                                           // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Rei-SdkDumper ])
	struct FIntVector                             ChunkA;                                            // 0x0004(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FIntVector                             ChunkB;                                            // 0x0010(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Angle;                                             // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FGridFlowTilemapCellDoorInfo;

// ScriptStruct DungeonArchitectRuntime.GridFlowTilemapCustomCellInfo
// 0x0020 (0x0020 - 0x0000)
struct FGridFlowTilemapCustomCellInfo final
{
public:
	class FString                                 MarkerName;                                        // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           DefaultColor;                                      // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FGridFlowTilemapCustomCellInfo;

// ScriptStruct DungeonArchitectRuntime.GridFlowTilemapCellOverlayMergeConfig
// 0x0018 (0x0018 - 0x0000)
struct FGridFlowTilemapCellOverlayMergeConfig final
{
public:
	float                                         MinHeight;                                         // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxHeight;                                         // 0x0004(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EGridFlowTilemapCellOverlayMergeWallOverlayRule WallOverlayRule;                                 // 0x0008(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Rei-SdkDumper ])
	float                                         MarkerHeightOffsetForLayoutTiles;                  // 0x000C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MarkerHeightOffsetForNonLayoutTiles;               // 0x0010(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          RemoveElevationMarker;                             // 0x0014(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_FGridFlowTilemapCellOverlayMergeConfig;

// ScriptStruct DungeonArchitectRuntime.GridFlowTilemapCellOverlay
// 0x0048 (0x0048 - 0x0000)
struct FGridFlowTilemapCellOverlay final
{
public:
	bool                                          bEnabled;                                          // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Rei-SdkDumper ])
	class FString                                 MarkerName;                                        // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           Color;                                             // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         NoiseValue;                                        // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bTileBlockingOverlay;                              // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Rei-SdkDumper ])
	struct FGridFlowTilemapCellOverlayMergeConfig MergeConfig;                                       // 0x0030(0x0018)(NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FGridFlowTilemapCellOverlay;

// ScriptStruct DungeonArchitectRuntime.GridFlowTilemapCell
// 0x00D8 (0x00D8 - 0x0000)
struct FGridFlowTilemapCell final
{
public:
	EGridFlowTilemapCellType                      CellType;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Rei-SdkDumper ])
	struct FGridFlowTilemapCustomCellInfo         CustomCellInfo;                                    // 0x0008(0x0020)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	bool                                          bHasItem;                                          // 0x0028(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Rei-SdkDumper ])
	struct FGuid                                  ItemId;                                            // 0x002C(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Rei-SdkDumper ])
	TArray<class FString>                         Tags;                                              // 0x0040(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          bHasOverlay;                                       // 0x0050(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Rei-SdkDumper ])
	struct FGridFlowTilemapCellOverlay            Overlay;                                           // 0x0058(0x0048)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	struct FVector                                ChunkCoord;                                        // 0x00A0(0x000C)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FIntPoint                              TileCoord;                                         // 0x00AC(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseCustomColor;                                   // 0x00B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B5[0x3];                                       // 0x00B5(0x0003)(Fixing Size After Last Property [ Rei-SdkDumper ])
	struct FLinearColor                           CustomColor;                                       // 0x00B8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bMainPath;                                         // 0x00C8(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bLayoutCell;                                       // 0x00C9(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUnreachable;                                      // 0x00CA(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_CB[0x1];                                       // 0x00CB(0x0001)(Fixing Size After Last Property [ Rei-SdkDumper ])
	int32                                         DistanceFromMainPath;                              // 0x00CC(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Height;                                            // 0x00D0(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D4[0x4];                                       // 0x00D4(0x0004)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_FGridFlowTilemapCell;

// ScriptStruct DungeonArchitectRuntime.GridFlowTilemapCoord
// 0x000C (0x000C - 0x0000)
struct FGridFlowTilemapCoord final
{
public:
	struct FIntPoint                              Coord;                                             // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsEdgeCoord;                                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bHorizontalEdge;                                   // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A[0x2];                                        // 0x000A(0x0002)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_FGridFlowTilemapCoord;

// ScriptStruct DungeonArchitectRuntime.GridFlowTilemapEdge
// 0x002C (0x002C - 0x0000)
struct FGridFlowTilemapEdge final
{
public:
	EGridFlowTilemapEdgeType                      EdgeType;                                          // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Rei-SdkDumper ])
	struct FGuid                                  ItemId;                                            // 0x0004(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         HeightCoord;                                       // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MarkerAngle;                                       // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bHasItem;                                          // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
