#pragma once

/*
* SDK generated by Rei-SdkDumper
* Based on Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EasyAR

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function EasyAR.EasyARCamera.AddShowActor
// 0x0008 (0x0008 - 0x0000)
struct EasyARCamera_AddShowActor final
{
public:
	class AActor*                                 InActor;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_EasyARCamera_AddShowActor;

// Function EasyAR.EasyARCamera.DelShowActor
// 0x0008 (0x0008 - 0x0000)
struct EasyARCamera_DelShowActor final
{
public:
	class AActor*                                 InActor;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_EasyARCamera_DelShowActor;

// Function EasyAR.EasyARCamera.GetFov
// 0x0004 (0x0004 - 0x0000)
struct EasyARCamera_GetFov final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_EasyARCamera_GetFov;

// Function EasyAR.EasyARCamera.GetSceneCapture
// 0x0008 (0x0008 - 0x0000)
struct EasyARCamera_GetSceneCapture final
{
public:
	class USceneCaptureComponent2D*               ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_EasyARCamera_GetSceneCapture;

// Function EasyAR.EasyARCamera.HitTest
// 0x0008 (0x0008 - 0x0000)
struct EasyARCamera_HitTest final
{
public:
	struct FVector2D                              InHitPixelPosition;                                // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_EasyARCamera_HitTest;

// Function EasyAR.EasyARCamera.SetAutoModeDis
// 0x0004 (0x0004 - 0x0000)
struct EasyARCamera_SetAutoModeDis final
{
public:
	int32                                         nAutoModeDis;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_EasyARCamera_SetAutoModeDis;

// Function EasyAR.EasyARCamera.SetFov
// 0x0004 (0x0004 - 0x0000)
struct EasyARCamera_SetFov final
{
public:
	float                                         fFov;                                              // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_EasyARCamera_SetFov;

// Function EasyAR.EasyARCamera.SetLevelRenderIsOpen
// 0x0001 (0x0001 - 0x0000)
struct EasyARCamera_SetLevelRenderIsOpen final
{
public:
	bool                                          bIsOpen;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_EasyARCamera_SetLevelRenderIsOpen;

// Function EasyAR.EasyARCamera.SetPreview
// 0x0010 (0x0010 - 0x0000)
struct EasyARCamera_SetPreview final
{
public:
	class AActor*                                 ShellActor;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 ShowActor;                                         // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_EasyARCamera_SetPreview;

// Function EasyAR.EasyARCamera.Start
// 0x0010 (0x0010 - 0x0000)
struct EasyARCamera_Start final
{
public:
	int32                                         nAutoModeDis;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOnlyCheckSupportAr;                               // 0x0004(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Rei-SdkDumper ])
	int32                                         nBuffCap;                                          // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bLowQuality;                                       // 0x000C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bRenderClose;                                      // 0x000D(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_E[0x2];                                        // 0x000E(0x0002)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_EasyARCamera_Start;

// Function EasyAR.EasyARCamera.GetPreviewActor
// 0x0008 (0x0008 - 0x0000)
struct EasyARCamera_GetPreviewActor final
{
public:
	class AActor*                                 ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_EasyARCamera_GetPreviewActor;

}

