#pragma once

/*
* SDK generated by Rei-SdkDumper
* Based on Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EasyAR

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class EasyAR.EasyARCamera
// 0x00A0 (0x02E0 - 0x0240)
class AEasyARCamera : public ASceneCapture2D
{
public:
	class UTextureRenderTarget2D*                 CameraImageRenderTarget;                           // 0x0240(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftClassPath                         PlaneIndicatorClassPath;                           // 0x0248(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bPortrait;                                         // 0x0260(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_261[0x3];                                      // 0x0261(0x0003)(Fixing Size After Last Property [ Rei-SdkDumper ])
	struct FVector                                ARWorldOrigin;                                     // 0x0264(0x000C)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(int32 ErrorCode)> OnInitializeResult;                              // 0x0270(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const struct FTransform& InTransform)> OnSpawnPreviewActor;        // 0x0280(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const struct FHitResult& HitResult)> OnHitPreviewActor;            // 0x0290(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(bool Started)>  OnStateChanged;                                    // 0x02A0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(bool Find)>     OnPlaneChanged;                                    // 0x02B0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class AEasyARPlaneIndicator*                  PlaneIndicatorActor;                               // 0x02C0(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2C8[0x18];                                     // 0x02C8(0x0018)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])

public:
	void AddShowActor(class AActor* InActor);
	void ClearPreviewActor();
	void DelShowActor(class AActor* InActor);
	float GetFov();
	class USceneCaptureComponent2D* GetSceneCapture();
	void HitTest(const struct FVector2D& InHitPixelPosition);
	void ResetHideActors2Visible();
	void SetAutoModeDis(int32 nAutoModeDis);
	void SetFov(float fFov);
	void SetLevelRenderIsOpen(bool bIsOpen);
	void SetPreview(class AActor* ShellActor, class AActor* ShowActor);
	void Start(int32 nAutoModeDis, bool bOnlyCheckSupportAr, int32 nBuffCap, bool bLowQuality, bool bRenderClose);

	class AActor* GetPreviewActor() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("EasyARCamera")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"EasyARCamera")
	}
	static class AEasyARCamera* GetDefaultObj()
	{
		return GetDefaultObjImpl<AEasyARCamera>();
	}
};
DUMPER7_ASSERTS_AEasyARCamera;

// Class EasyAR.EasyARPlaneIndicator
// 0x0010 (0x0238 - 0x0228)
class AEasyARPlaneIndicator final : public AActor
{
public:
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0228(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UHierarchicalInstancedStaticMeshComponent* HISMComponent;                                  // 0x0230(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("EasyARPlaneIndicator")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"EasyARPlaneIndicator")
	}
	static class AEasyARPlaneIndicator* GetDefaultObj()
	{
		return GetDefaultObjImpl<AEasyARPlaneIndicator>();
	}
};
DUMPER7_ASSERTS_AEasyARPlaneIndicator;

// Class EasyAR.EasyARSettings
// 0x0010 (0x0038 - 0x0028)
class UEasyARSettings final : public UObject
{
public:
	TArray<class FString>                         AppKeys;                                           // 0x0028(0x0010)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("EasyARSettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"EasyARSettings")
	}
	static class UEasyARSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEasyARSettings>();
	}
};
DUMPER7_ASSERTS_UEasyARSettings;

}

