#pragma once

/*
* SDK generated by Rei-SdkDumper
* Based on Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FCharOrderAnimseqs

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct FCharOrderAnimseqs.FCharOrderAnimseqs
// 0x00B0 (0x00B0 - 0x0000)
struct FFCharOrderAnimseqs final
{
public:
	class FName                                   Desc_20_C06E385249128E223ADE1EB39B24ABB4;          // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class USkeletalMesh>           FixedMesh_42_F8518DE14C29F5A86D3121BCD3A07531;     // 0x0008(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	class UClass*                                 AnimBP_31_ABE49C6B4F628B18B9CF949576660077;        // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                          OrderIdle_32_7F81237B4D0B07AD42DD3BB30B86DCA6;     // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                          Order_33_6B56F3B840D009A6A851DB92222F70A8;         // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                          Dialogue_34_68D3DD8C4D5737004A6C7093A3E5DDCE;      // 0x0048(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                          OrderAtoB_35_0438044B4A58C3682E662D80A0DD9CD2;     // 0x0050(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                          CatchIdle_37_F9EF308F4E03DD36EE4BAFA1924AD33D;     // 0x0058(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                          Victory_46_27AA19924F5B2C67E07D6393317886FA;       // 0x0060(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                          VictoryStand_47_0DF26DD548DB8FCD6D9F48AD419364E1;  // 0x0068(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                          Defeat_50_AAD242834F463EAFFC8612B6854A75D0;        // 0x0070(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                          DefeatStand_51_94A087C347C90E6A24968EAD2DA541BC;   // 0x0078(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                          ChallengeVictory_56_F82F0FB6482AD4CB4619348C5FABA54B; // 0x0080(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                          ChallengeVictorytand_57_71A036CD453FE43CCC8421AFA3952930; // 0x0088(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 FacePath_23_41D3509341EAEEA9DA40BE908B7B43FC;      // 0x0090(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	TArray<class UAnimSequence*>                  FaceMontages_38_1A3E8FE2448B4D35110BC09D54CD9FC9;  // 0x00A0(0x0010)(Edit, BlueprintVisible)
};
DUMPER7_ASSERTS_FFCharOrderAnimseqs;

}

