#pragma once

/*
* SDK generated by Rei-SdkDumper
* Based on Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FNiagaraParams

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// UserDefinedStruct FNiagaraParams.FNiagaraParams
// 0x0040 (0x0040 - 0x0000)
struct FFNiagaraParams final
{
public:
	class UNiagaraSystem*                         NiaSystem_2_4D0A8A094ACD15A7D5B80EA9F1CB6203;      // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                HitOffset_5_0485F9E04BFEFE5085C48EB21ED6AA4F;      // 0x0008(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                HitOffsetCenter_7_A554421D4669164992DE34B879D8CECF; // 0x0014(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Radius_12_B8FC6B804BE767A1A7015EA85DF4608C;        // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RadiusK_13_2D021691480E070D2037699E572EFBDF;       // 0x0024(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ColorIntensity_17_28D8471748A6503944ABFB8A28442C73; // 0x0028(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         OffsetAlongNormal_19_18201E2F425E2E8DB4B1019E457A5BB1; // 0x002C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                ParticleScale_22_1306C61E4F82641A091D94B572DE0EA2; // 0x0030(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_FFNiagaraParams;

}

