#pragma once

/*
* SDK generated by Rei-SdkDumper
* Based on Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GameTable

#include "Basic.hpp"

#include "CoreUObject_classes.hpp"
#include "GameTable_structs.hpp"
#include "DeveloperSettings_classes.hpp"


namespace SDK
{

// Class GameTable.GameTableHandlerBase
// 0x0020 (0x0048 - 0x0028)
class UGameTableHandlerBase : public UObject
{
public:
	uint8                                         Pad_28[0x20];                                      // 0x0028(0x0020)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GameTableHandlerBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GameTableHandlerBase")
	}
	static class UGameTableHandlerBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameTableHandlerBase>();
	}
};
DUMPER7_ASSERTS_UGameTableHandlerBase;

// Class GameTable.GameTableHelper
// 0x0058 (0x00A0 - 0x0048)
class UGameTableHelper final : public UGameTableHandlerBase
{
public:
	uint8                                         Pad_48[0x58];                                      // 0x0048(0x0058)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GameTableHelper")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GameTableHelper")
	}
	static class UGameTableHelper* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameTableHelper>();
	}
};
DUMPER7_ASSERTS_UGameTableHelper;

// Class GameTable.GameTableLoader
// 0x00B0 (0x00F8 - 0x0048)
class UGameTableLoader final : public UGameTableHandlerBase
{
public:
	uint8                                         Pad_48[0xB0];                                      // 0x0048(0x00B0)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GameTableLoader")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GameTableLoader")
	}
	static class UGameTableLoader* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameTableLoader>();
	}
};
DUMPER7_ASSERTS_UGameTableLoader;

// Class GameTable.GameTableManager
// 0x00B8 (0x00F0 - 0x0038)
class UGameTableManager final : public UDeveloperSettings
{
public:
	bool                                          bEnablePreload;                                    // 0x0038(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Rei-SdkDumper ])
	TArray<struct FDataTableItemConfig>           Configs;                                           // 0x0040(0x0010)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPrivate)
	TMap<EGameTableName, class UGameTableHandlerBase*> DataTableMap;                                 // 0x0050(0x0050)(NativeAccessSpecifierPrivate)
	TMap<class FString, class UGameTableHandlerBase*> DataTableByPathMap;                            // 0x00A0(0x0050)(NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GameTableManager")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GameTableManager")
	}
	static class UGameTableManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameTableManager>();
	}
};
DUMPER7_ASSERTS_UGameTableManager;

}

