#pragma once

/*
* SDK generated by Rei-SdkDumper
* Based on Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GameTask

#include "Basic.hpp"

#include "GameTask_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_classes.hpp"


namespace SDK
{

// Class GameTask.CustomTriggerComponent
// 0x0020 (0x04A0 - 0x0480)
class UCustomTriggerComponent final : public UBoxComponent
{
public:
	EBoxType                                      BoxType;                                           // 0x0480(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_481[0x7];                                      // 0x0481(0x0007)(Fixing Size After Last Property [ Rei-SdkDumper ])
	TMulticastInlineDelegate<void(bool bBeginOverlap, class UCustomTriggerComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex)> OnTrigger; // 0x0488(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_498[0x8];                                      // 0x0498(0x0008)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])

public:
	void OnEnter(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void OnLeave(class UPrimitiveComponent* InComponent, class AActor* InOther, class UPrimitiveComponent* InOtherComponent, int32 InBody);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CustomTriggerComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CustomTriggerComponent")
	}
	static class UCustomTriggerComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCustomTriggerComponent>();
	}
};
DUMPER7_ASSERTS_UCustomTriggerComponent;

// Class GameTask.GameTask
// 0x0198 (0x01C0 - 0x0028)
class UGameTask final : public UObject
{
public:
	int32                                         LevelCountDownTime;                                // 0x0028(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Rei-SdkDumper ])
	class UGameTaskComposite_Flow*                RootNode;                                          // 0x0030(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UGameTaskComposite_Flow*>        SubRootNodes;                                      // 0x0038(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class UGameTaskNode*>                  AllTaskNodes;                                      // 0x0048(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	class FName                                   Name_0;                                            // 0x0058(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Comment;                                           // 0x0060(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UEdGraph*                               TaskGraph;                                         // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnGameTaskStateChange;                             // 0x0078(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class UGameTaskComposite_Flow* Flow)> OnGameTaskFlowChange;        // 0x0088(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class UGameTask_Execute* Execute)> OnGameTaskExecuteChange;        // 0x0098(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class UGameTask_Execute* Execute)> OnGameTaskSuddenChange;         // 0x00A8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class UGameTaskEvent* Event)> OnGameTaskEventDeferFinish;          // 0x00B8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_C8[0x60];                                      // 0x00C8(0x0060)(Fixing Size After Last Property [ Rei-SdkDumper ])
	TMap<int32, class UGameTaskNode*>             NodeInnerIDMap;                                    // 0x0128(0x0050)(NativeAccessSpecifierPrivate)
	uint8                                         Pad_178[0x8];                                      // 0x0178(0x0008)(Fixing Size After Last Property [ Rei-SdkDumper ])
	TArray<class UGameTaskNode*>                  AllFindNodes;                                      // 0x0180(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	bool                                          bOpenMonsterReset;                                 // 0x0190(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_191[0x3];                                      // 0x0191(0x0003)(Fixing Size After Last Property [ Rei-SdkDumper ])
	struct FMonsterResetConfig                    MonsterResetConfig;                                // 0x0194(0x002C)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic)

public:
	static TArray<int32> GetPlotList(class UGameTask* InTask);

	void End(class AGameTaskActor* InOwner);
	bool EndSubRootNode(const class FString& SubRootNodeName);
	TArray<class UGameTaskNode*> FindAllTaskNode();
	bool FlowIsRoot(class UGameTaskComposite_Flow* Flow);
	bool FlowIsRootOrSubRoot(class UGameTaskComposite_Flow* Flow);
	bool FlowIsSubRoot(class UGameTaskComposite_Flow* Flow);
	bool ForceFinishSubRootNode(const class FString& SubRootNodeName);
	void GameTaskEventDeferFinish(class UGameTaskEvent* InGameTaskEvent);
	void GameTaskExecuteChange(class UGameTask_Execute* InGameTaskExecuteNode);
	void GameTaskFlowChange(class UGameTaskComposite_Flow* InGameTaskFlowNode);
	void GameTaskNodeStateChange(class UGameTaskNode* InGameTaskNode, ENodeState InNodeState);
	void GameTaskSuddenChange(class UGameTask_Execute* InGameTaskExecuteNode);
	TArray<class UGameTaskNode*> GetAllChildrenNodes(class UGameTaskComposite_Flow* FlowRootNode);
	TArray<class UGameTask_Execute*> GetAllExecuteNodes();
	TArray<class UGameTask_Execute*> GetAllInProgressExecuteNodes();
	TArray<class UGameTaskNode*> GetAllTaskNodes(bool bContainEvents);
	void GetCurrentExecuteNode(TArray<class UGameTask_Execute*>* OutNodes);
	class UGameTaskNode* GetTaskNode(int32 InnerID);
	class FName GetTaskTag();
	void Init(class AGameTaskActor* InOwner, bool Restore);
	void InitNodeInnerID(bool Restore);
	bool IsInitialized();
	void ResetAll();
	void Start(class AGameTaskActor* InOwner, bool bDontSetTime);
	bool StartSubRootNode(class FString* SubRootNodeName, int32 InLoop);
	void Stop();

	class UGameTaskComposite_Flow* GetCurrentFlowNode() const;
	class AGameTaskActor* GetTaskActor() const;
	class UWorld* GetWorld() const;
	bool InEnd() const;
	bool IsActive() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GameTask")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GameTask")
	}
	static class UGameTask* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameTask>();
	}
};
DUMPER7_ASSERTS_UGameTask;

// Class GameTask.GameTaskNode
// 0x0100 (0x0128 - 0x0028)
class UGameTaskNode : public UObject
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Rei-SdkDumper ])
	class FString                                 NodeName;                                          // 0x0030(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   NodeTag;                                           // 0x0040(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ActivityLogic;                                     // 0x0048(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<int32>                                 NeedConditionIDs;                                  // 0x0058(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FTriggerConditionConfig>        TriggerConditionIDs;                               // 0x0068(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<int32>                                 AbandonConditionIDs;                               // 0x0078(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TMap<class FName, int32>                      TaskDataConditions;                                // 0x0088(0x0050)(Edit, NativeAccessSpecifierPublic)
	TArray<class UGameTaskNode*>                  Children;                                          // 0x00D8(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_E8[0x18];                                      // 0x00E8(0x0018)(Fixing Size After Last Property [ Rei-SdkDumper ])
	int32                                         InnerID;                                           // 0x0100(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_104[0xC];                                      // 0x0104(0x000C)(Fixing Size After Last Property [ Rei-SdkDumper ])
	class UGameTask*                              GameTaskAsset;                                     // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UGameTaskNode*                          ParentNode;                                        // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_120[0x1];                                      // 0x0120(0x0001)(Fixing Size After Last Property [ Rei-SdkDumper ])
	bool                                          bIsTickEnable;                                     // 0x0121(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_122[0x6];                                      // 0x0122(0x0006)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])

public:
	void GetAllRecursiveChildren(TArray<class UGameTaskNode*>* inArray);
	int32 GetExecutionIndex();
	class UGameTaskComposite_Flow* GetRootFlowNode();
	class FString GetUIDescription();
	bool HasPreCondition();
	bool IsPreConditionTrigger();
	bool NeedIgnored();
	void OnUpdate_Client(int32 Param1, int32 Param2, int32 Param3, int32 Param4, int32 Param5);
	void TipToClient(const class FString& InKey, int32 InType);
	void TriggerPreConditions();
	void UpdateDataToClient(int32 Param1, int32 Param2, int32 Param3, int32 Param4, int32 Param5);

	class AGameTaskActor* GetGameTaskActor() const;
	class UGameTask* GetGameTaskAsset() const;
	ELevelType GetLevelType() const;
	ENodeState GetNodeState() const;
	class FString GetSpecialStaticDescription() const;
	class FString GetStaticDescription() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GameTaskNode")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GameTaskNode")
	}
	static class UGameTaskNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameTaskNode>();
	}
};
DUMPER7_ASSERTS_UGameTaskNode;

// Class GameTask.GameTaskFlowChild
// 0x0008 (0x0130 - 0x0128)
class UGameTaskFlowChild : public UGameTaskNode
{
public:
	class UGameTaskComposite_Flow*                ParentFlowNode;                                    // 0x0128(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GameTaskFlowChild")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GameTaskFlowChild")
	}
	static class UGameTaskFlowChild* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameTaskFlowChild>();
	}
};
DUMPER7_ASSERTS_UGameTaskFlowChild;

// Class GameTask.GameTask_Execute
// 0x00D0 (0x0200 - 0x0130)
class UGameTask_Execute : public UGameTaskFlowChild
{
public:
	int32                                         IconBG;                                            // 0x0130(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Icon;                                              // 0x0134(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         LevelPointsNum;                                    // 0x0138(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ExecuteDescriptionID;                              // 0x013C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         CountDown;                                         // 0x0140(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_144[0x4];                                      // 0x0144(0x0004)(Fixing Size After Last Property [ Rei-SdkDumper ])
	class FString                                 CountDownStr;                                      // 0x0148(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bHiddenExectue;                                    // 0x0158(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_159[0x7];                                      // 0x0159(0x0007)(Fixing Size After Last Property [ Rei-SdkDumper ])
	TArray<class UGameTaskEvent*>                 ActiveEvents;                                      // 0x0160(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class UGameTaskEvent*>                 FinishEvents;                                      // 0x0170(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	class FString                                 TaskItemDes;                                       // 0x0180(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class UGameTask_Execute* Execute)> OnExecuteChange;                // 0x0190(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class UGameTask_Execute* Execute)> OnSuddenChange;                 // 0x01A0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	EExecuteUIAnimType                            showUIAnimType;                                    // 0x01B0(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ShowCompleteTip;                                   // 0x01B1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          EndIsConsideredComplete;                           // 0x01B2(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1B3[0x5];                                      // 0x01B3(0x0005)(Fixing Size After Last Property [ Rei-SdkDumper ])
	TArray<int32>                                 DescArgs;                                          // 0x01B8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          PlayFinishVoice;                                   // 0x01C8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C9[0x17];                                     // 0x01C9(0x0017)(Fixing Size After Last Property [ Rei-SdkDumper ])
	class FString                                 ExecuteDes;                                        // 0x01E0(0x0010)(ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1F0[0x10];                                     // 0x01F0(0x0010)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])

public:
	void ActiveCountDown();
	void ClearCountDownTimer();
	void CountDownFinish();
	void Fail();
	void Finish();
	int32 GetCountDown();
	class FString GetDescription();
	class FString GetExecuteDescription(bool bIgnoreRichText);
	class FString GetFormatTitle();
	class FString GetTitleDescription();
	void InnerClearExecuteDescription();
	void InnerSetExecuteDescription();
	bool IsClient();
	bool IsPauseExecute();
	bool IsServer();
	bool IsTaskFinishExecute();
	void OnActive();
	void OnActive_Client();
	void OnCountDown_Client();
	void OnEnd();
	void OnEnd_Client();
	void OnFail();
	void OnFail_Client();
	void OnFinish();
	void OnFinish_Client();
	void OnTick(float DeltaTime);
	void SetCountDown(const int32 Count);
	void SetExecuteDescription(bool notAppend);
	void SetSuddenDescription();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GameTask_Execute")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GameTask_Execute")
	}
	static class UGameTask_Execute* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameTask_Execute>();
	}
};
DUMPER7_ASSERTS_UGameTask_Execute;

// Class GameTask.GameTask_SubRoot
// 0x0000 (0x0128 - 0x0128)
class UGameTask_SubRoot final : public UGameTaskNode
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GameTask_SubRoot")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GameTask_SubRoot")
	}
	static class UGameTask_SubRoot* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameTask_SubRoot>();
	}
};
DUMPER7_ASSERTS_UGameTask_SubRoot;

// Class GameTask.GameTaskActor
// 0x04E8 (0x0710 - 0x0228)
class AGameTaskActor : public AActor
{
public:
	class UTaskDataComponent*                     TaskDataComponent;                                 // 0x0228(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DelayFinishNotify_Failed;                          // 0x0230(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_234[0x4];                                      // 0x0234(0x0004)(Fixing Size After Last Property [ Rei-SdkDumper ])
	TSoftObjectPtr<class UGameTask>               CustomGameTask;                                    // 0x0238(0x0028)(Edit, BlueprintVisible, DisableEditOnTemplate, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ELevelType                                    LevelType;                                         // 0x0260(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShouldShowTimeUI;                                 // 0x0261(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_262[0x2];                                      // 0x0262(0x0002)(Fixing Size After Last Property [ Rei-SdkDumper ])
	int32                                         AIAIDirectorId;                                    // 0x0264(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          CanJump;                                           // 0x0268(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          CanHook;                                           // 0x0269(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          HidePauseAITips;                                   // 0x026A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_26B[0x1];                                      // 0x026B(0x0001)(Fixing Size After Last Property [ Rei-SdkDumper ])
	int32                                         NormalMonsterMoneyNum;                             // 0x026C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         EliteMonsterMoneyNum;                              // 0x0270(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         BossMonsterMoneyNum;                               // 0x0274(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bLeaveAIWhenFail;                                  // 0x0278(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bInfinitelyVigour;                                 // 0x0279(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_27A[0x6];                                      // 0x027A(0x0006)(Fixing Size After Last Property [ Rei-SdkDumper ])
	class FString                                 ActConditionName;                                  // 0x0280(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIgnoreDeathCheck;                                 // 0x0290(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_291[0x3];                                      // 0x0291(0x0003)(Fixing Size After Last Property [ Rei-SdkDumper ])
	int32                                         ForceLevelId;                                      // 0x0294(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         KillMonsterZ;                                      // 0x0298(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29C[0x4];                                      // 0x029C(0x0004)(Fixing Size After Last Property [ Rei-SdkDumper ])
	TMulticastInlineDelegate<void(ELevelFinishResult FinishResult, float UseTime, ELevelFailedReason FailedReason)> OnTaskFinish; // 0x02A0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, BlueprintCallable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(ELevelFinishResult FinishResult, float UseTime, ELevelFailedReason FailedReason)> OnRogue3DTaskFinish; // 0x02B0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, BlueprintCallable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(int32 UIID, int32 UITypeID)> OnLevelUINotify;                      // 0x02C0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, BlueprintCallable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnGameTaskStart;                                   // 0x02D0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, BlueprintCallable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnGameTaskSwitch;                                  // 0x02E0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, BlueprintCallable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class AGameTaskActor* InTaskActor)> OnTaskFinishSimple;            // 0x02F0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, BlueprintCallable, NativeAccessSpecifierPublic)
	uint8                                         Pad_300[0x10];                                     // 0x0300(0x0010)(Fixing Size After Last Property [ Rei-SdkDumper ])
	TMulticastInlineDelegate<void(class AGameTaskActor* InTaskActor)> OnTaskFailedSimple;            // 0x0310(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, BlueprintCallable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(int32 InTime)>  OnLevelTimeNotify;                                 // 0x0320(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, BlueprintCallable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(int32 InTime)>  OnLevelCountDown;                                  // 0x0330(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, BlueprintCallable, NativeAccessSpecifierPublic)
	uint8                                         Pad_340[0x10];                                     // 0x0340(0x0010)(Fixing Size After Last Property [ Rei-SdkDumper ])
	bool                                          bTaskInFight;                                      // 0x0350(0x0001)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_351[0x7];                                      // 0x0351(0x0007)(Fixing Size After Last Property [ Rei-SdkDumper ])
	class FString                                 MainTaskPath;                                      // 0x0358(0x0010)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, Transient, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TWeakObjectPtr<class UGameTask>               MainTaskCache;                                     // 0x0368(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ELevelFinishResult                            ChildResult;                                       // 0x0370(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_371[0x3];                                      // 0x0371(0x0003)(Fixing Size After Last Property [ Rei-SdkDumper ])
	int32                                         AreaId;                                            // 0x0374(0x0004)(BlueprintVisible, Net, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MonstarLevel;                                      // 0x0378(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_37C[0x4];                                      // 0x037C(0x0004)(Fixing Size After Last Property [ Rei-SdkDumper ])
	class UGameTaskComposite_Flow*                CurrentFlow;                                       // 0x0380(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<ENodeState>                            RepProp_NodesState;                                // 0x0388(0x0010)(Net, ZeroConstructor, RepNotify, NativeAccessSpecifierPublic)
	uint8                                         Pad_398[0x8];                                      // 0x0398(0x0008)(Fixing Size After Last Property [ Rei-SdkDumper ])
	TArray<struct FRepExecuteDes>                 RepProp_ExecuteDes;                                // 0x03A0(0x0010)(Net, ZeroConstructor, RepNotify, NativeAccessSpecifierPublic)
	struct FRepExecuteDes                         RepProp_SuddenDes;                                 // 0x03B0(0x0018)(Net, RepNotify, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(int32 InAreaId)> OnTaskPreLoad;                                    // 0x03C8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, BlueprintCallable, NativeAccessSpecifierPublic)
	bool                                          PlayKillBossVoice;                                 // 0x03D8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bForbidCharacterVoice;                             // 0x03D9(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3DA[0x6E];                                     // 0x03DA(0x006E)(Fixing Size After Last Property [ Rei-SdkDumper ])
	TArray<int32>                                 NotifyTimes;                                       // 0x0448(0x0010)(BlueprintVisible, ZeroConstructor, Transient, NativeAccessSpecifierPublic)
	uint8                                         Pad_458[0x50];                                     // 0x0458(0x0050)(Fixing Size After Last Property [ Rei-SdkDumper ])
	class UGameTask*                              GameTask;                                          // 0x04A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_4B0[0xC];                                      // 0x04B0(0x000C)(Fixing Size After Last Property [ Rei-SdkDumper ])
	int32                                         LevelCountDownTime;                                // 0x04BC(0x0004)(Net, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FString                                 OptionTaskPath;                                    // 0x04C0(0x0010)(Net, ZeroConstructor, Transient, RepNotify, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bUIIsState;                                        // 0x04D0(0x0001)(Net, ZeroConstructor, Transient, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_4D1[0xAB];                                     // 0x04D1(0x00AB)(Fixing Size After Last Property [ Rei-SdkDumper ])
	bool                                          bOptimizeMonsterTick;                              // 0x057C(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          PlayLevelBeginSound;                               // 0x057D(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	ELevelFinishResult                            FinishResultCache;                                 // 0x057E(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_57F[0x9];                                      // 0x057F(0x0009)(Fixing Size After Last Property [ Rei-SdkDumper ])
	TArray<ENodeState>                            StateTemp;                                         // 0x0588(0x0010)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, Transient, NativeAccessSpecifierPublic)
	uint8                                         Pad_598[0x2D];                                     // 0x0598(0x002D)(Fixing Size After Last Property [ Rei-SdkDumper ])
	bool                                          bHasBegunPlayed;                                   // 0x05C5(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bHasDebugInit;                                     // 0x05C6(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsMain;                                            // 0x05C7(0x0001)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftClassPtr<class UClass>                   ParallelTemplate;                                  // 0x05C8(0x0028)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5F0[0x18];                                     // 0x05F0(0x0018)(Fixing Size After Last Property [ Rei-SdkDumper ])
	TMap<class FString, class UGameTask*>         TaskTemplateCaches;                                // 0x0608(0x0050)(NativeAccessSpecifierPrivate)
	TSet<int32>                                   HiddenMonsterTipsFilter;                           // 0x0658(0x0050)(Edit, BlueprintVisible, DisableEditOnTemplate, NativeAccessSpecifierPublic)
	uint8                                         Pad_6A8[0x40];                                     // 0x06A8(0x0040)(Fixing Size After Last Property [ Rei-SdkDumper ])
	class ACameraActor*                           CameraActor;                                       // 0x06E8(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class AActor*                                 CacheViewTarget;                                   // 0x06F0(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class APlayerController*                      CachePlayerController;                             // 0x06F8(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class APlayerCameraManager*                   PlayerCameraManager;                               // 0x0700(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         NowSpawnNodeId;                                    // 0x0708(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          MonsMoveIgnoreCollisionOnClient;                   // 0x070C(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_70D[0x3];                                      // 0x070D(0x0003)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])

public:
	static class AGameTaskActor* GetGameTaskActor(const class UObject* WorldContext);

	void ApplyMoveCamera(float InFieldOfView, const struct FVector& InDestPosition, const struct FRotator& InDestRotator, float InMaxMoveTime);
	void BeginOpenWorldTask();
	void BeginParallelTask(const struct FSoftObjectPath& InGameTaskPath, int32 InAreaId);
	void CallTowerFinish();
	bool CheckPreCondition(int32 ConditionID, const class FString& ActivityName);
	bool CheckTemporarilyPreCondition(int32 ConditionID);
	void ChildGameTaskFinish(ELevelFinishResult FinishResult, bool InRestartParent);
	void Clean();
	void ClearLevelCountDownTimer();
	void ClosePreCondition(int32 ConditionID, const class FString& ActivityName);
	void CloseTemporarilyPreCondition(int32 ConditionID);
	class AGameTaskActor* CreateParallelTask();
	void DarkZoneDestroyTaskSpawnActor(class AActor* InActor);
	void DestroyParallelTask(class AGameTaskActor* InTaskActor);
	void DestroyTaskSpawnActor(class AActor* InActor);
	void DoSceneOnOff();
	class UGameTask_Execute* ExecuteDesUpdate(struct FRepExecuteDes* ExecuteDes);
	class UGameTask* FastLoadGameTask(const class FString& Path);
	void FightTip(const class FString& InKey, int32 InType, bool IsNodeId, const struct FRepExecuteDes& ExecuteData);
	TArray<class AActor*> GetAllProtectItems();
	int32 GetBossChallengeCountDownTime();
	int32 GetExactLevelCountDownTotalTime();
	class FString GetFightLog_ExecuteFightTime();
	class FString GetFightLog_ExecuteTime();
	int32 GetFightLog_FlowTime(const class FString& Tag);
	class FString GetFightLog_FPSDetail();
	int32 GetFightLog_LevelFinishType();
	int32 GetFightLog_PlotCompleteType();
	int32 GetFightLog_PlotID();
	class UGameTask* GetGameTask();
	int32 GetLevelConfigTime(const class UGameTask* Cur);
	int32 GetLevelCountDownTime();
	int32 GetLevelCountDownTotalTime();
	float GetLevelFightTime();
	ELevelFinishResult GetLevelFinishResult();
	float GetLevelTime();
	class AGameTaskActor* GetParallelTask(int32 InAreaId);
	int32 GetSpawnNodeId();
	float GetSpecializationId(bool bIsNormal);
	class FString GetTaskDesByID(int32 ID);
	void GM_LevelFinishSuccess();
	bool IsMultiLevel();
	bool IsPlotLevel();
	void LeaveAllAI();
	void LevelFinishBroadCast(ELevelFinishResult FinishResult, ELevelFailedReason FailedReason, bool bEndMatch);
	void LevelUINotify(int32 UIIndex, int32 UITypeID);
	void LoadChildGameTask(const class FString& TaskPath, int32 Index_0);
	void LoadGameTask();
	void Multicast_DisplayTaskSceneOnOff();
	void MulticastUnBindGameTaskUIEvent();
	void MultiDoSpawn(int32 InMonsterId, class FName InTag, class FName PointName);
	void NotifyGameModeTaskFailed(ELevelFailedReason FailedReason);
	void NotifyMoveCameraComplete();
	void NotifyStartMultiSubTask(const struct FMultiSubTask& InSubTask);
	void OnDebugInit();
	void OnLevelFailed(ELevelFailedReason FailedReason);
	void OnLevelSuccess();
	void OnMultiKill(class AActor* Killer, class AActor* Deceased);
	void OnMultiKillInfoUpdate();
	void OnPlayerMove();
	void OnRep_ExecuteDesUpdate();
	void OnRep_NodesStateUpdate();
	void OnRep_OptionTaskPath();
	void OnRep_ShowUI();
	void OnRep_SuddenDesUpdate();
	void OnStartPlayVoice();
	void OnStartTask();
	void OpenPreCondition(int32 ConditionID, const class FString& ActivityName);
	void OpenTemporarilyPreCondition(int32 ConditionID);
	void PauseLevelTime(bool bPause, ELevelPauseReason InReason);
	void PlayCharacterVoice(const class FString& VoiceID, bool bPlayWithoutWorld, int32 TemplateId);
	void ReCastActiveEvent();
	void RecordTaskState(int32 InLastNodeIndex);
	void RequestTaskDataValueSync();
	void ResetPlayerViewTarget();
	void RestartGameTask();
	void RPC_ExecuteOnActive_Client(int32 ExecuteNodeInnerID);
	void RPC_ExecuteOnCountDown_Client(int32 ExecuteNodeInnerID);
	void RPC_ExecuteOnEnd_Client(int32 ExecuteNodeInnerID);
	void RPC_ExecuteOnFail_Client(int32 ExecuteNodeInnerID);
	void RPC_ExecuteOnFinish_Client(int32 ExecuteNodeInnerID);
	void RPC_ExecuteOnUpdate_Client(int32 ExecuteNodeInnerID, int32 Param1, int32 Param2, int32 Param3, int32 Param4, int32 Param5);
	void RPC_LevelFinishDataUpdate(ELevelFinishResult FinishResult, ELevelFailedReason FailedReason, float Time);
	void RPC_PlayCharacterVoice(const class FString& VoiceID, bool bPlayWithoutWorld, int32 TemplateId);
	void RPC_PostEvent(const class FString& InEventName, bool b2DEvent, class AActor* InActor, const struct FVector& InLocation, const struct FRotator& InRotator);
	void RPC_Task_PreLoad_Client(int32 nAreaId);
	void RPC_TaskFinish(ELevelFinishResult FinishResult, ELevelFailedReason FailedReason, float Time);
	void RPC_TaskStart();
	void RPC_TaskSwitch_Client(const class FString& TaskPath);
	void RPC_TipToClient(const class FString& InKey, int32 InType, bool IsNodeId, const struct FRepExecuteDes& ExecuteDes);
	void SetCustomCameraAnim(bool InValue);
	void SetFightUIState(bool InFlag);
	void SetGameTask();
	void SetLevelCountDownTime(int32 Time);
	void SetSpecialization(const int32& NormalId, const int32& EliteId);
	void SetTaskFinishSimple();
	void SetTaskPause(bool Flag);
	bool ShouldCalcOnlineBehaviorPoint();
	bool ShouldCalcOnlineDesignation();
	bool ShouldShowFightTimeUI();
	void SpawnTaskSubActor();
	void StartLevelCountDown(bool bDontCountDown);
	void StartTask(bool bDontCountDown);
	void StopTask(bool bResetAll);
	void SwitchTask(const struct FSoftObjectPath& InGameTaskPath, int32 InAreaId);
	void SwitchTaskByObject(class UObject* InGameTaskObject, int32 InAreaId);
	void TaskActor_PostEvent(const class FString& InEventName, bool bIs2DEvent, class AActor* InActor, const struct FVector& InLocation, const struct FRotator& InRotator);
	void TaskFinishExecute(const bool bDestroyAI, const bool bPlayFinishAnim, const float PlayerPerformDelay, const class FName IgnoreDestroyAITag);
	bool TaskIsSync();
	void TriggerClientEvent(int32 NodeInnerID);
	void TryStartTask(bool bOpenUI);
	void UnBindGameTaskUIEvent();
	void UpdateFightLog_PlotLevel(int32 PlotID, int32 CompleteType);

	int32 GetExactLevelTotalTime() const;
	int32 GetLevelTotalTime() const;
	int32 GetLevelTypeMonsLevel() const;
	bool GetTaskPause() const;
	bool IsForbidZone() const;
	bool IsForbidZoneHard() const;
	bool IsMassWaves() const;
	bool IsMultiConstLevel() const;
	bool IsMultiCoopBoss() const;
	bool IsMultiDynamicLevel() const;
	bool IsMultiNM() const;
	bool IsMultiSpecificLevel() const;
	bool IsMultiTD() const;
	bool IsMultiWave() const;
	bool IsMultiWaveEasy() const;
	bool IsMultiWaveHard() const;
	bool IsOnlinePurge() const;
	bool IsOnlinePurgeEndless() const;
	bool IsOnlineSea() const;
	bool IsPal() const;
	bool IsTowerRush() const;
	bool IsTowerRushHard() const;
	bool IsWaveControlLevel() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GameTaskActor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GameTaskActor")
	}
	static class AGameTaskActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGameTaskActor>();
	}
};
DUMPER7_ASSERTS_AGameTaskActor;

// Class GameTask.GameTaskAuxiliaryNode
// 0x0000 (0x0128 - 0x0128)
class UGameTaskAuxiliaryNode : public UGameTaskNode
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GameTaskAuxiliaryNode")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GameTaskAuxiliaryNode")
	}
	static class UGameTaskAuxiliaryNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameTaskAuxiliaryNode>();
	}
};
DUMPER7_ASSERTS_UGameTaskAuxiliaryNode;

// Class GameTask.GameTaskCacheSubsystem
// 0x0008 (0x0038 - 0x0030)
class UGameTaskCacheSubsystem final : public UWorldSubsystem
{
public:
	TWeakObjectPtr<class AGameTaskActor>          MainTaskActorCache;                                // 0x0030(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GameTaskCacheSubsystem")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GameTaskCacheSubsystem")
	}
	static class UGameTaskCacheSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameTaskCacheSubsystem>();
	}
};
DUMPER7_ASSERTS_UGameTaskCacheSubsystem;

// Class GameTask.GameTaskComposite_Flow
// 0x0058 (0x0180 - 0x0128)
class UGameTaskComposite_Flow final : public UGameTaskNode
{
public:
	int32                                         FlowDescriptionID;                                 // 0x0128(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bHiddenFlow;                                       // 0x012C(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_12D[0x3];                                      // 0x012D(0x0003)(Fixing Size After Last Property [ Rei-SdkDumper ])
	TArray<class UGameTaskEvent*>                 EnterEvents;                                       // 0x0130(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class UGameTaskEvent*>                 ExitEvents;                                        // 0x0140(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	class UGameTaskComposite_Flow*                Next;                                              // 0x0150(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class UGameTaskComposite_Flow* Flow)> OnFlowChange;                // 0x0158(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	int32                                         Loop;                                              // 0x0168(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_16C[0x4];                                      // 0x016C(0x0004)(Fixing Size After Last Property [ Rei-SdkDumper ])
	class UGameTaskComposite_Flow*                RootNodePtr;                                       // 0x0170(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_178[0x8];                                      // 0x0178(0x0008)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])

public:
	void Exit();
	void ForceFinish();
	TArray<class UGameTask_Execute*> GetAllExecuteNodes(bool bContainsHiddenExecute);
	TArray<class UGameTask_Execute*> GetAllInProgressExecuteNodes();
	void OnEnter();
	void OnExit();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GameTaskComposite_Flow")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GameTaskComposite_Flow")
	}
	static class UGameTaskComposite_Flow* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameTaskComposite_Flow>();
	}
};
DUMPER7_ASSERTS_UGameTaskComposite_Flow;

// Class GameTask.GameTaskComposite_Or
// 0x0008 (0x0138 - 0x0130)
class UGameTaskComposite_Or final : public UGameTaskFlowChild
{
public:
	int32                                         SuccessRequestNum;                                 // 0x0130(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_134[0x4];                                      // 0x0134(0x0004)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GameTaskComposite_Or")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GameTaskComposite_Or")
	}
	static class UGameTaskComposite_Or* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameTaskComposite_Or>();
	}
};
DUMPER7_ASSERTS_UGameTaskComposite_Or;

// Class GameTask.GameTaskComposite_Parallel
// 0x0000 (0x0130 - 0x0130)
class UGameTaskComposite_Parallel final : public UGameTaskFlowChild
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GameTaskComposite_Parallel")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GameTaskComposite_Parallel")
	}
	static class UGameTaskComposite_Parallel* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameTaskComposite_Parallel>();
	}
};
DUMPER7_ASSERTS_UGameTaskComposite_Parallel;

// Class GameTask.GameTaskComposite_Sequence
// 0x0008 (0x0138 - 0x0130)
class UGameTaskComposite_Sequence final : public UGameTaskFlowChild
{
public:
	uint8                                         Pad_130[0x8];                                      // 0x0130(0x0008)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GameTaskComposite_Sequence")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GameTaskComposite_Sequence")
	}
	static class UGameTaskComposite_Sequence* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameTaskComposite_Sequence>();
	}
};
DUMPER7_ASSERTS_UGameTaskComposite_Sequence;

// Class GameTask.GameTaskCondition
// 0x0000 (0x0028 - 0x0028)
class UGameTaskCondition final : public UObject
{
public:
	bool ConditionMet(class UObject* InOuter);
	void OnInit();

	class UWorld* GetWorld() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GameTaskCondition")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GameTaskCondition")
	}
	static class UGameTaskCondition* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameTaskCondition>();
	}
};
DUMPER7_ASSERTS_UGameTaskCondition;

// Class GameTask.GameTaskEvent
// 0x0030 (0x0158 - 0x0128)
class UGameTaskEvent : public UGameTaskAuxiliaryNode
{
public:
	EEventNetMode                                 NetMode;                                           // 0x0128(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_129[0x7];                                      // 0x0129(0x0007)(Fixing Size After Last Property [ Rei-SdkDumper ])
	class FString                                 TaskEventTag;                                      // 0x0130(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class UGameTaskEvent* TaskNode)> OnEventDeferFinish;               // 0x0140(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, BlueprintCallable, NativeAccessSpecifierPublic)
	bool                                          IsTaskFinishEvent;                                 // 0x0150(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          UnreactiveWhenReconnect;                           // 0x0151(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_152[0x6];                                      // 0x0152(0x0006)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])

public:
	bool OnTrigger();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GameTaskEvent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GameTaskEvent")
	}
	static class UGameTaskEvent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameTaskEvent>();
	}
};
DUMPER7_ASSERTS_UGameTaskEvent;

// Class GameTask.GameTaskEvent_FinishNodeByTag
// 0x0008 (0x0160 - 0x0158)
class UGameTaskEvent_FinishNodeByTag final : public UGameTaskEvent
{
public:
	class FName                                   FinishNodeTag;                                     // 0x0158(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GameTaskEvent_FinishNodeByTag")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GameTaskEvent_FinishNodeByTag")
	}
	static class UGameTaskEvent_FinishNodeByTag* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameTaskEvent_FinishNodeByTag>();
	}
};
DUMPER7_ASSERTS_UGameTaskEvent_FinishNodeByTag;

// Class GameTask.GameTaskEvent_PlayPlot
// 0x0008 (0x0160 - 0x0158)
class UGameTaskEvent_PlayPlot final : public UGameTaskEvent
{
public:
	int32                                         PlotID;                                            // 0x0158(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15C[0x4];                                      // 0x015C(0x0004)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GameTaskEvent_PlayPlot")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GameTaskEvent_PlayPlot")
	}
	static class UGameTaskEvent_PlayPlot* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameTaskEvent_PlayPlot>();
	}
};
DUMPER7_ASSERTS_UGameTaskEvent_PlayPlot;

// Class GameTask.GameTaskEvent_SpawnMonsterBase
// 0x0000 (0x0158 - 0x0158)
class UGameTaskEvent_SpawnMonsterBase : public UGameTaskEvent
{
public:
	void AddTag(class AActor* InActor, const class FString& TagStr);
	bool TrySpawn();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GameTaskEvent_SpawnMonsterBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GameTaskEvent_SpawnMonsterBase")
	}
	static class UGameTaskEvent_SpawnMonsterBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameTaskEvent_SpawnMonsterBase>();
	}
};
DUMPER7_ASSERTS_UGameTaskEvent_SpawnMonsterBase;

// Class GameTask.GameTaskEvent_SpawnMonByPoint
// 0x0030 (0x0188 - 0x0158)
class UGameTaskEvent_SpawnMonByPoint final : public UGameTaskEvent_SpawnMonsterBase
{
public:
	int32                                         TableID;                                           // 0x0158(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15C[0x4];                                      // 0x015C(0x0004)(Fixing Size After Last Property [ Rei-SdkDumper ])
	class FString                                 Tag;                                               // 0x0160(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Team;                                              // 0x0170(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSummon;                                           // 0x0180(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bMulti;                                            // 0x0181(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_182[0x2];                                      // 0x0182(0x0002)(Fixing Size After Last Property [ Rei-SdkDumper ])
	int32                                         SpawnStartIndex;                                   // 0x0184(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	int32 GetSpawnNum();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GameTaskEvent_SpawnMonByPoint")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GameTaskEvent_SpawnMonByPoint")
	}
	static class UGameTaskEvent_SpawnMonByPoint* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameTaskEvent_SpawnMonByPoint>();
	}
};
DUMPER7_ASSERTS_UGameTaskEvent_SpawnMonByPoint;

// Class GameTask.GameTaskEvent_SpawnMonByStruct
// 0x0008 (0x0160 - 0x0158)
class UGameTaskEvent_SpawnMonByStruct final : public UGameTaskEvent_SpawnMonsterBase
{
public:
	int32                                         SpawnStartIndex;                                   // 0x0158(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15C[0x4];                                      // 0x015C(0x0004)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])

public:
	int32 GetSpawnNum();
	void GetTagArray(TArray<class FString>* TagArray, TArray<bool>* BSpArray, TArray<int32>* FirstIDArray);
