#pragma once

/*
* SDK generated by Rei-SdkDumper
* Based on Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GameEx

#include "Basic.hpp"

#include "GameCore_classes.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "GameEx_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "AIModule_structs.hpp"
#include "AIModule_classes.hpp"
#include "UMG_classes.hpp"
#include "GameplayTags_structs.hpp"
#include "GameLogicTree_structs.hpp"
#include "GameLogicTree_classes.hpp"


namespace SDK
{

// Class GameEx.GEDrop
// 0x0008 (0x0230 - 0x0228)
class AGEDrop : public AActor
{
public:
	int32                                         DropId;                                            // 0x0228(0x0004)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_22C[0x4];                                      // 0x022C(0x0004)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])

public:
	void MgrNotifyChangeMat();
	void MgrNotifyDestroy();
	void MgrNotifyReset();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GEDrop")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GEDrop")
	}
	static class AGEDrop* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGEDrop>();
	}
};
DUMPER7_ASSERTS_AGEDrop;

// Class GameEx.GERotateBrick
// 0x0060 (0x0290 - 0x0230)
class AGERotateBrick final : public AGEDrop
{
public:
	int32                                         SmoothMaxCount;                                    // 0x0230(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EGERotateBrickState                           BrickState;                                        // 0x0234(0x0001)(Edit, Net, ZeroConstructor, EditConst, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_235[0x3];                                      // 0x0235(0x0003)(Fixing Size After Last Property [ Rei-SdkDumper ])
	struct FVector2D                              NormalStateDurRange;                               // 0x0238(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              CurNormalStateDurRange;                            // 0x0240(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Timer;                                             // 0x0248(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         NextActionTime;                                    // 0x024C(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RotateSpeed;                                       // 0x0250(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RotateAngle;                                       // 0x0254(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CumuRotateAngle;                                   // 0x0258(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ChangeMatTime;                                     // 0x025C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EGEBrickRotateType                            RotateType;                                        // 0x0260(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          isRepByMgr;                                        // 0x0261(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_262[0x2];                                      // 0x0262(0x0002)(Fixing Size After Last Property [ Rei-SdkDumper ])
	float                                         SyncCurveTimeToClientDur;                          // 0x0264(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               Client_TargetRot;                                  // 0x0268(0x000C)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	TWeakObjectPtr<class AGERotateBrickManager>   Mgr;                                               // 0x0274(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          isClientFinishRotate;                              // 0x027C(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_27D[0x13];                                     // 0x027D(0x0013)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])

public:
	void OnRep_BrickState();
	void SetBrickState(EGERotateBrickState InState);
	void SetEffectMat(int32 EffectType);
	void SyncRotateFinish(float CurAngle);
	void SyncStartRotateTime(float CurTime);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GERotateBrick")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GERotateBrick")
	}
	static class AGERotateBrick* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGERotateBrick>();
	}
};
DUMPER7_ASSERTS_AGERotateBrick;

// Class GameEx.AnimNtf_GECharTiming
// 0x0008 (0x0040 - 0x0038)
class UAnimNtf_GECharTiming final : public UAnimNotify
{
public:
	int32                                         TimingId;                                          // 0x0038(0x0004)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AnimNtf_GECharTiming")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AnimNtf_GECharTiming")
	}
	static class UAnimNtf_GECharTiming* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAnimNtf_GECharTiming>();
	}
};
DUMPER7_ASSERTS_UAnimNtf_GECharTiming;

// Class GameEx.GEScripteEventMgr
// 0x01E8 (0x0210 - 0x0028)
class UGEScripteEventMgr final : public UObject
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Rei-SdkDumper ])
	float                                         TickTSDur;                                         // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_34[0x88];                                      // 0x0034(0x0088)(Fixing Size After Last Property [ Rei-SdkDumper ])
	TDelegate<void(class UWorld* InWorld, ETravelFailure FailureType, const class FString& ErrorString)> TravelFailureMessagesDelegate; // 0x00BC(0x0010)(Edit, ZeroConstructor, EditConst, InstancedReference, NoDestructor, NativeAccessSpecifierPublic)
	TDelegate<void(class UWorld* InWorld, ENetworkFailure FailureType, const class FString& ErrorString)> NetworkFailureMessagesDelegate; // 0x00CC(0x0010)(Edit, ZeroConstructor, EditConst, InstancedReference, NoDestructor, NativeAccessSpecifierPublic)
	TDelegate<void(class UWorld* InWorld, class UNetDriver* NetDriver)> HandleDisconnectDelegate;    // 0x00DC(0x0010)(Edit, ZeroConstructor, EditConst, InstancedReference, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_EC[0x4];                                       // 0x00EC(0x0004)(Fixing Size After Last Property [ Rei-SdkDumper ])
	TMulticastInlineDelegate<void(float deatl)>   EngineTickDelegate;                                // 0x00F0(0x0010)(ZeroConstructor, InstancedReference, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(float deatl)>   GameTickDelegate;                                  // 0x0100(0x0010)(ZeroConstructor, InstancedReference, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              GameShutDownDelegate;                              // 0x0110(0x0010)(ZeroConstructor, InstancedReference, NativeAccessSpecifierPublic)
	TDelegate<void(const class FString& A)>       MapLoadBeginDelegate;                              // 0x0120(0x0010)(ZeroConstructor, InstancedReference, NoDestructor, NativeAccessSpecifierPublic)
	TDelegate<void(class UWorld* A)>              MapLoadCompleteDelegate;                           // 0x0130(0x0010)(ZeroConstructor, InstancedReference, NoDestructor, NativeAccessSpecifierPublic)
	TDelegate<void(float loadTime, const class FString& MapName)> GameInstanceLoadCompleteDelegate;  // 0x0140(0x0010)(ZeroConstructor, InstancedReference, NoDestructor, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const class FString& EventCmd, const class FString& Params)> EventToTsDelegate; // 0x0150(0x0010)(ZeroConstructor, InstancedReference, NativeAccessSpecifierPublic)
	TArray<class UObject*>                        TempArr;                                           // 0x0160(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FVector>                        TempVectorArray;                                   // 0x0170(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class AActor*>                         TempActorArray;                                    // 0x0180(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const class AActor* Actor)> OnActorBeginPlayToTsDelegate;          // 0x0190(0x0010)(ZeroConstructor, InstancedReference, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const class AActor* Actor, const EEndPlayReason EndPlayReason)> OnActorEndPlayToTsDelegate; // 0x01A0(0x0010)(ZeroConstructor, InstancedReference, NativeAccessSpecifierPublic)
	TDelegate<void(class AGEGameModeBase* GameModeBase, const class FString& MapName, const class FString& Options, class FString* ErrorMessage)> InitGameDelegate; // 0x01B0(0x0010)(Edit, ZeroConstructor, EditConst, InstancedReference, NoDestructor, NativeAccessSpecifierPublic)
	TMap<int32, class AActor*>                    GEActorExComActors;                                // 0x01C0(0x0050)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)

public:
	static void DelInstance();
	static class FString GetActorExComLuaTableName();
	static class FString GetGameModeLuaTableName();
	static class UGEScripteEventMgr* GetInstance();
	static class FString GetScripMgrLuaTableName();
	static void SetScripMgrLuaTableName(const class FString& Name_0);

	void AddGEActor(int32 ServerID, class AActor* Actor);
	class UGameInstance* GetGameInstance();
	class AActor* GetGEActorByServerID(int32 ServerID, class UWorld* World);
	void NotifyToTSEvent(const class FString& Cmd, const class FString& Param);
	void OnActorBeginPlay(class AActor* Actor);
	void OnActorEndPlay(class AActor* Actor, const EEndPlayReason EndPlayReason);
	void OnStart(class UGameInstance* ins);
	void RemoveGEActor(int32 ServerID, class UWorld* World);
	void RemoveLuaTable(const class FString& TableName);
	void SetDebugWaiting();
	void SetLuaTable(const class FString& TableName, const class FString& GetFunName);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GEScripteEventMgr")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GEScripteEventMgr")
	}
	static class UGEScripteEventMgr* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGEScripteEventMgr>();
	}
};
DUMPER7_ASSERTS_UGEScripteEventMgr;

// Class GameEx.GEAbilityAttributeSettings
// 0x0198 (0x01C0 - 0x0028)
class UGEAbilityAttributeSettings final : public UObject
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Rei-SdkDumper ])
	TMap<class FString, struct FGEAbilityAttribute> DefaultAbilityAttributes;                        // 0x0030(0x0050)(Edit, DisableEditOnTemplate, Transient, EditConst, AdvancedDisplay, NativeAccessSpecifierPrivate)
	TMap<struct FGECharLevelAttributeTemplateKey, struct FGECharLevelAttributeTemplate> CharLevelAttributesTemplates; // 0x0080(0x0050)(Edit, DisableEditOnTemplate, Transient, EditConst, AdvancedDisplay, NativeAccessSpecifierPrivate)
	TMap<int32, struct FGEWeaponAttributeTemplate> WeaponAttributesTemplates;                        // 0x00D0(0x0050)(Edit, DisableEditOnTemplate, Transient, EditConst, AdvancedDisplay, NativeAccessSpecifierPrivate)
	uint8                                         Pad_120[0xA0];                                     // 0x0120(0x00A0)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GEAbilityAttributeSettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GEAbilityAttributeSettings")
	}
	static class UGEAbilityAttributeSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGEAbilityAttributeSettings>();
	}
};
DUMPER7_ASSERTS_UGEAbilityAttributeSettings;

// Class GameEx.GESideBySideActor
// 0x0028 (0x0250 - 0x0228)
class AGESideBySideActor final : public AActor
{
public:
	uint8                                         Pad_228[0x8];                                      // 0x0228(0x0008)(Fixing Size After Last Property [ Rei-SdkDumper ])
	class FName                                   ActorTag;                                          // 0x0230(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<float>                                 CustomDataArr;                                     // 0x0238(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	EGESideBySideType                             ActionType;                                        // 0x0248(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_249[0x7];                                      // 0x0249(0x0007)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])

public:
	void LuaImpl_DoSideBySideAction();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GESideBySideActor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GESideBySideActor")
	}
	static class AGESideBySideActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGESideBySideActor>();
	}
};
DUMPER7_ASSERTS_AGESideBySideActor;

// Class GameEx.GETrapBase
// 0x0020 (0x0248 - 0x0228)
class AGETrapBase : public AActor
{
public:
	uint8                                         Pad_228[0x10];                                     // 0x0228(0x0010)(Fixing Size After Last Property [ Rei-SdkDumper ])
	bool                                          isActivate;                                        // 0x0238(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_239[0x3];                                      // 0x0239(0x0003)(Fixing Size After Last Property [ Rei-SdkDumper ])
	TWeakObjectPtr<class AActor>                  SpawnedBy;                                         // 0x023C(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_244[0x4];                                      // 0x0244(0x0004)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])

public:
	void LuaImpl_Activate();
	void LuaImpl_DeActive();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GETrapBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GETrapBase")
	}
	static class AGETrapBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGETrapBase>();
	}
};
DUMPER7_ASSERTS_AGETrapBase;

// Class GameEx.GESkillLibrary
// 0x0000 (0x0028 - 0x0028)
class UGESkillLibrary final : public UBlueprintFunctionLibrary
{
public:
	static bool CanAddStoreCount(class AController* InController, int32 InIndex);
	static TArray<int32> GetAllBuffIdByCharTeam(class APawn* InPawn);
	static void GetAllSkillInfo(TArray<struct FGESkillInfo>* InArr);
	static TArray<float> GetBuffDesParam(int32 BuffId, int32 Level);
	static TArray<int32> GetBuffFromCount(int32 Count, class APawn* InPawn, bool isHero);
	static struct FGEBuffInfo GetBuffInfoByID(int32 InId);
	static TArray<int32> GetBuffLevelParam(int32 BuffId, int32 Level);
	static struct FSoftObjectPath GetBuffPath(int32 InId);
	static int32 GetOwnBuffLevel(int32 InBuffId, class APawn* InPawn);
	static struct FGESkillEquipInfo GetSkillEquipData(class AController* InController, int32 InIndex);
	static struct FGESkillInfo GetSkillInfo(int32 InId);
	static struct FSoftObjectPath GetSkillPath(int32 InId);
	static bool IsUseable(class AController* InController, int32 InIndex);
	static void ModifySkillReduceCD(class AGEPlayerState* Ps, int32 InIndex, float InReduceValue);
	static void ModifySkillStoreCount(class AGEGameCharacter* Char, int32 InIndex, int32 InAddCount);
	static void SetIsUsed(class AController* InController, int32 InIndex);
	static void SetSkillEquipData(class AController* InController, int32 InIndex, const struct FGESkillEquipInfo& Info);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GESkillLibrary")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GESkillLibrary")
	}
	static class UGESkillLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGESkillLibrary>();
	}
};
DUMPER7_ASSERTS_UGESkillLibrary;

// Class GameEx.GEAccelerateTrap
// 0x0008 (0x0250 - 0x0248)
class AGEAccelerateTrap final : public AGETrapBase
{
public:
	float                                         AcceleRate;                                        // 0x0248(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24C[0x4];                                      // 0x024C(0x0004)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GEAccelerateTrap")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GEAccelerateTrap")
	}
	static class AGEAccelerateTrap* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGEAccelerateTrap>();
	}
};
DUMPER7_ASSERTS_AGEAccelerateTrap;

// Class GameEx.GESplineConveyorComponent
// 0x0180 (0x0230 - 0x00B0)
class UGESplineConveyorComponent final : public UActorComponent
{
public:
	uint8                                         Pad_B0[0x18];                                      // 0x00B0(0x0018)(Fixing Size After Last Property [ Rei-SdkDumper ])
	bool                                          bShowLog;                                          // 0x00C8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Rei-SdkDumper ])
	class USplineComponent*                       SplineComponent;                                   // 0x00D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USceneComponent*                        SceneComponent;                                    // 0x00D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SplineLength;                                      // 0x00E0(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnable;                                           // 0x00E4(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_E5[0x3];                                       // 0x00E5(0x0003)(Fixing Size After Last Property [ Rei-SdkDumper ])
	float                                         StartMoveCD;                                       // 0x00E8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MoveCompleteTime;                                  // 0x00EC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         VisibleDes;                                        // 0x00F0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseSmooth;                                        // 0x00F4(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_F5[0x3];                                       // 0x00F5(0x0003)(Fixing Size After Last Property [ Rei-SdkDumper ])
	int32                                         SmoothMaxCount;                                    // 0x00F8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSweep;                                            // 0x00FC(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bTeleport;                                         // 0x00FD(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_FE[0x2];                                       // 0x00FE(0x0002)(Fixing Size After Last Property [ Rei-SdkDumper ])
	class FString                                 SplineComponentName;                               // 0x0100(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 SceneComponentName;                                // 0x0110(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SyncCurveTimeToClientDur;                          // 0x0120(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CurTime;                                           // 0x0124(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TotalTime;                                         // 0x0128(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          canMove;                                           // 0x012C(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_12D[0x3];                                      // 0x012D(0x0003)(Fixing Size After Last Property [ Rei-SdkDumper ])
	TMap<class AActor*, float>                    MoveActors;                                        // 0x0130(0x0050)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	TArray<class AActor*>                         AttachedActors;                                    // 0x0180(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_190[0x8C];                                     // 0x0190(0x008C)(Fixing Size After Last Property [ Rei-SdkDumper ])
	TDelegate<void(class AActor* Actor)>          StartmoveDelegate;                                 // 0x021C(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_22C[0x4];                                      // 0x022C(0x0004)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])

public:
	void AddMoveActor(class AActor* Actor, float StartLen, bool bCheckRepeat);
	void SetMoveValue(float Time, int64 servertimeMilli);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GESplineConveyorComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GESplineConveyorComponent")
	}
	static class UGESplineConveyorComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGESplineConveyorComponent>();
	}
};
DUMPER7_ASSERTS_UGESplineConveyorComponent;

// Class GameEx.GEActorExComponent
// 0x0168 (0x0218 - 0x00B0)
class UGEActorExComponent final : public UActorComponent
{
public:
	TDelegate<void()>                             BeginPlayDelegate;                                 // 0x00B0(0x0010)(Edit, ZeroConstructor, DisableEditOnTemplate, EditConst, InstancedReference, NoDestructor, NativeAccessSpecifierPublic)
	TDelegate<void(const EEndPlayReason Reason)>  EndPlayDelegate;                                   // 0x00C0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, EditConst, InstancedReference, NoDestructor, NativeAccessSpecifierPublic)
	TDelegate<void(float dt)>                     TickDelegate;                                      // 0x00D0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, EditConst, InstancedReference, NoDestructor, NativeAccessSpecifierPublic)
	TDelegate<void(const class FString& funName, const class FString& Param)> OnCallTSFunDelegate;   // 0x00E0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, EditConst, InstancedReference, NoDestructor, NativeAccessSpecifierPublic)
	int32                                         ServerID;                                          // 0x00F0(0x0004)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_F4[0x4];                                       // 0x00F4(0x0004)(Fixing Size After Last Property [ Rei-SdkDumper ])
	TMap<class FString, class FString>            CustomDataString;                                  // 0x00F8(0x0050)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	TMap<class FString, int32>                    CustomDataNumber;                                  // 0x0148(0x0050)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	int32                                         UserID;                                            // 0x0198(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void()>                             UserIDChangeDelegate;                              // 0x019C(0x0010)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, NativeAccessSpecifierPublic)
	int32                                         CharID;                                            // 0x01AC(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void()>                             CharIDChangeDelegate;                              // 0x01B0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, NativeAccessSpecifierPublic)
	int32                                         EntityType;                                        // 0x01C0(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ConfID;                                            // 0x01C4(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void()>                             ConfIDChangeDelegate;                              // 0x01C8(0x0010)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, NativeAccessSpecifierPublic)
	TDelegate<void(int32 mainID, int32 SubId, const class FString& Data)> FNotifyMsgDelegate;        // 0x01D8(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, NativeAccessSpecifierPublic)
	TDelegate<void(int32 TypeId, int32 SubId)>    FNotifyActorMsgDelegate;                           // 0x01E8(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, NativeAccessSpecifierPublic)
	TDelegate<void(int32 DataIndex, int32 DataValue)> FNotifyActorCustomDataDelegate;                // 0x01F8(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, NativeAccessSpecifierPublic)
	int32                                         CustomRepData1;                                    // 0x0208(0x0004)(Net, ZeroConstructor, Transient, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         CustomRepData2;                                    // 0x020C(0x0004)(Net, ZeroConstructor, Transient, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         CustomRepData3;                                    // 0x0210(0x0004)(Net, ZeroConstructor, Transient, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_214[0x4];                                      // 0x0214(0x0004)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])

public:
	static void SetAllServerID(int32 ID);

	void CallLuaFun(const class FString& fucName, const class FString& funParam);
	void CallLuaFunByDelegate(const class FString& funName, const class FString& Param);
	int32 GetCharID();
	int32 GetConfID();
	int32 GetDataInt(const class FString& Key);
	class FString GetDataString(const class FString& Key);
	int32 GetEntityType();
	int32 GetServerID();
	int32 GetUserID();
	void NotifyActorMsg_Client(int32 TypeId, int32 SubId);
	void NotifyActorMsg_Client_Unreliable(int32 TypeId, int32 SubId);
	void NotifyActorMsg_NetMulticast(int32 TypeId, int32 SubId);
	void NotifyActorMsg_NetMulticast_Unreliable(int32 TypeId, int32 SubId);
	void NotifyActorMsg_Server(int32 TypeId, int32 SubId);
	void NotifyActorMsg_Server_Unreliable(int32 TypeId, int32 SubId);
	void NotifyMsg_Client(int32 mainID, int32 SubId, const class FString& Data);
	void NotifyMsg_Client_Unreliable(int32 mainID, int32 SubId, const class FString& Data);
	void NotifyMsg_NetMulticast(int32 mainID, int32 SubId, const class FString& Value);
	void NotifyMsg_NetMulticast_Unreliable(int32 mainID, int32 SubId, const class FString& Value);
	void NotifyMsg_Server(int32 mainID, int32 SubId, const class FString& Data);
	void NotifyMsg_Server_Unreliable(int32 mainID, int32 SubId, const class FString& Data);
	void OnCustomChanged1();
	void OnCustomChanged2();
	void OnCustomChanged3();
	void OnRep_CharID();
	void OnRep_ConfID();
	void OnRep_ServerID();
	void OnRep_UserID();
	void PrintID(class FString* Tag);
	void SetCharID(int32 iCharid);
	void SetConfID(int32 iConfID);
	void SetCustomRepData(int32 DataIndex, int32 DataValue);
	void SetDataInt(const class FString& Key, int32 Value);
	void SetDataString(const class FString& Key, const class FString& Value);
	void SetEntityType(int32 ientityType);
	void SetUserID(int32 iUserid);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GEActorExComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GEActorExComponent")
	}
	static class UGEActorExComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGEActorExComponent>();
	}
};
DUMPER7_ASSERTS_UGEActorExComponent;

// Class GameEx.GESplineMoveComponent
// 0x01A0 (0x0250 - 0x00B0)
class UGESplineMoveComponent final : public UActorComponent
{
public:
	uint8                                         Pad_B0[0x4];                                       // 0x00B0(0x0004)(Fixing Size After Last Property [ Rei-SdkDumper ])
	bool                                          bShowLog;                                          // 0x00B4(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B5[0x3];                                       // 0x00B5(0x0003)(Fixing Size After Last Property [ Rei-SdkDumper ])
	class USplineComponent*                       SplineComponent;                                   // 0x00B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class USplineComponent*>               SplineComponents;                                  // 0x00C0(0x0010)(BlueprintVisible, ExportObject, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	class USceneComponent*                        Mesh;                                              // 0x00D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 FocusActor;                                        // 0x00D8(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SplineLength;                                      // 0x00E0(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(class AActor* Actor)>          MoveCompleteDelegate;                              // 0x00E4(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, NativeAccessSpecifierPublic)
	TDelegate<void()>                             SelfMoveCompleteDelegate;                          // 0x00F4(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, NativeAccessSpecifierPublic)
	float                                         MoveSpeed;                                         // 0x0104(0x0004)(Edit, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          LoopMove;                                          // 0x0108(0x0001)(Edit, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          isSelfMove;                                        // 0x0109(0x0001)(Edit, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_10A[0x2];                                      // 0x010A(0x0002)(Fixing Size After Last Property [ Rei-SdkDumper ])
	float                                         LoopDelay;                                         // 0x010C(0x0004)(Edit, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SynThreshold;                                      // 0x0110(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          UpdateRotate;                                      // 0x0114(0x0001)(Edit, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_115[0x3];                                      // 0x0115(0x0003)(Fixing Size After Last Property [ Rei-SdkDumper ])
	struct FRotator                               ForceRotation;                                     // 0x0118(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	int32                                         NetWokrDelayOptimize;                              // 0x0124(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          UseScale;                                          // 0x0128(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSweep;                                            // 0x0129(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bTeleport;                                         // 0x012A(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_12B[0x5];                                      // 0x012B(0x0005)(Fixing Size After Last Property [ Rei-SdkDumper ])
	class FString                                 SplineComponentName;                               // 0x0130(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FString>                         SplineComponentNames;                              // 0x0140(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	class FString                                 MoveComponentName;                                 // 0x0150(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SyncCurveTimeToClientDur;                          // 0x0160(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsForward;                                         // 0x0164(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_165[0x3];                                      // 0x0165(0x0003)(Fixing Size After Last Property [ Rei-SdkDumper ])
	float                                         LoopDelayTimer;                                    // 0x0168(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MoveValue;                                         // 0x016C(0x0004)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<class AActor*, float>                    MoveActors;                                        // 0x0170(0x0050)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C0[0x90];                                     // 0x01C0(0x0090)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])

public:
	void AddMoveActor(class AActor* Actor, float StartLen, bool bCheckRepeat);
	void OnRep_MoveValue();
	void SetisSelfMove(bool selfmove);
	void SetMoveValue(float Time, int64 servertimeMilli);
	void UpdateSelfMeshLocation();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GESplineMoveComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GESplineMoveComponent")
	}
	static class UGESplineMoveComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGESplineMoveComponent>();
	}
};
DUMPER7_ASSERTS_UGESplineMoveComponent;

// Class GameEx.WaterParkCollectAIModifyCom
// 0x0020 (0x04A0 - 0x0480)
#pragma pack(push, 0x1)
class alignas(0x10) UWaterParkCollectAIModifyCom : public UBoxComponent
{
public:
	int32                                         AreaId;                                            // 0x0480(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         CalOrder;                                          // 0x0484(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bActive;                                           // 0x0488(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_489[0xF];                                      // 0x0489(0x000F)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])

public:
	bool IsOverLap(struct FVector* Pos);
	void ModifyMoveVec_Bp(struct FVector* MoveVec, struct FVector* NowPos, bool* CanJump, bool* ShouldJump, float DeltaTime, class AGEAIController* TargetAIController);
	void SetIsValid(bool InNewState);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("WaterParkCollectAIModifyCom")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WaterParkCollectAIModifyCom")
	}
	static class UWaterParkCollectAIModifyCom* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWaterParkCollectAIModifyCom>();
	}
};
#pragma pack(pop)
DUMPER7_ASSERTS_UWaterParkCollectAIModifyCom;

// Class GameEx.GESystem
// 0x0018 (0x0048 - 0x0030)
class UGESystem final : public UWorldSubsystem
{
public:
	TWeakObjectPtr<class AGEItemMgr>              ItemMgr;                                           // 0x0030(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TWeakObjectPtr<class AGEHideAndSeekMgr>       HASMgr;                                            // 0x0038(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TWeakObjectPtr<class AGEZBugRunMgr>           ZBugRunMgr;                                        // 0x0040(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UGESystem* Get(const class UObject* WorldContextObject);

	class AGEHideAndSeekMgr* GetHideAndSeekMgr();
	class AGEItemMgr* GetItemMgr();
	class AGEZBugRunMgr* GetZBugRunMgr();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GESystem")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GESystem")
	}
	static class UGESystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGESystem>();
	}
};
DUMPER7_ASSERTS_UGESystem;

// Class GameEx.WaterPark_AIModifyEscape
// 0x0000 (0x04A0 - 0x04A0)
class UWaterPark_AIModifyEscape final : public UWaterParkCollectAIModifyCom
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("WaterPark_AIModifyEscape")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WaterPark_AIModifyEscape")
	}
	static class UWaterPark_AIModifyEscape* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWaterPark_AIModifyEscape>();
	}
};
DUMPER7_ASSERTS_UWaterPark_AIModifyEscape;

// Class GameEx.GEWPLibrary
// 0x0000 (0x0028 - 0x0028)
class UGEWPLibrary final : public UBlueprintFunctionLibrary
{
public:
	static struct FVector GetSettlementCamOffsetByTemplateID(int32 InTemplateID, bool IsSuccess);
	static void SetPerformanceMode(bool bOpen);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GEWPLibrary")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GEWPLibrary")
	}
	static class UGEWPLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGEWPLibrary>();
	}
};
DUMPER7_ASSERTS_UGEWPLibrary;

// Class GameEx.WaterPark_AIModifyWait
// 0x0000 (0x04A0 - 0x04A0)
class UWaterPark_AIModifyWait final : public UWaterParkCollectAIModifyCom
{
public:
	bool                                          CanJumpInBox;                                      // 0x0498(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_499[0x7];                                      // 0x0499(0x0007)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("WaterPark_AIModifyWait")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WaterPark_AIModifyWait")
	}
	static class UWaterPark_AIModifyWait* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWaterPark_AIModifyWait>();
	}
};
DUMPER7_ASSERTS_UWaterPark_AIModifyWait;

// Class GameEx.WaterPark_AIModify_LeaveCenter
// 0x0000 (0x04A0 - 0x04A0)
class UWaterPark_AIModify_LeaveCenter final : public UWaterParkCollectAIModifyCom
{
public:
	bool                                          CanJumpInBox;                                      // 0x0498(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_499[0x7];                                      // 0x0499(0x0007)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("WaterPark_AIModify_LeaveCenter")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WaterPark_AIModify_LeaveCenter")
	}
	static class UWaterPark_AIModify_LeaveCenter* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWaterPark_AIModify_LeaveCenter>();
	}
};
DUMPER7_ASSERTS_UWaterPark_AIModify_LeaveCenter;

// Class GameEx.WaterPark_AIModify_CustomVel
// 0x0020 (0x04C0 - 0x04A0)
class UWaterPark_AIModify_CustomVel final : public UWaterParkCollectAIModifyCom
{
public:
	bool                                          CanJumpInBox;                                      // 0x0498(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_499[0x3];                                      // 0x0499(0x0003)(Fixing Size After Last Property [ Rei-SdkDumper ])
	struct FVector                                CustomVel;                                         // 0x049C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          UseTargetPos;                                      // 0x04A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4A9[0x3];                                      // 0x04A9(0x0003)(Fixing Size After Last Property [ Rei-SdkDumper ])
	struct FVector                                TargetWorldPos;                                    // 0x04AC(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4B8[0x8];                                      // 0x04B8(0x0008)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("WaterPark_AIModify_CustomVel")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WaterPark_AIModify_CustomVel")
	}
	static class UWaterPark_AIModify_CustomVel* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWaterPark_AIModify_CustomVel>();
	}
};
DUMPER7_ASSERTS_UWaterPark_AIModify_CustomVel;

// Class GameEx.WaterPark_AIModify_JumpMove
// 0x0000 (0x04A0 - 0x04A0)
class UWaterPark_AIModify_JumpMove final : public UWaterParkCollectAIModifyCom
{
public:
	bool                                          CanJumpInBox;                                      // 0x0498(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_499[0x7];                                      // 0x0499(0x0007)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("WaterPark_AIModify_JumpMove")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WaterPark_AIModify_JumpMove")
	}
	static class UWaterPark_AIModify_JumpMove* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWaterPark_AIModify_JumpMove>();
	}
};
DUMPER7_ASSERTS_UWaterPark_AIModify_JumpMove;

// Class GameEx.WaterPark_AIModify_CenterLineMove
// 0x0010 (0x04B0 - 0x04A0)
class UWaterPark_AIModify_CenterLineMove final : public UWaterParkCollectAIModifyCom
{
public:
	struct FVector                                LineDir;                                           // 0x0498(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         LineLength;                                        // 0x04A4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         OffsetScale;                                       // 0x04A8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_4AC[0x4];                                      // 0x04AC(0x0004)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("WaterPark_AIModify_CenterLineMove")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WaterPark_AIModify_CenterLineMove")
	}
	static class UWaterPark_AIModify_CenterLineMove* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWaterPark_AIModify_CenterLineMove>();
	}
};
DUMPER7_ASSERTS_UWaterPark_AIModify_CenterLineMove;

// Class GameEx.WaterPark_AIModify_MoveToRandomPos
// 0x0030 (0x04D0 - 0x04A0)
class UWaterPark_AIModify_MoveToRandomPos final : public UWaterParkCollectAIModifyCom
{
public:
	bool                                          UseRandomTargetPos;                                // 0x0498(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_499[0x3];                                      // 0x0499(0x0003)(Fixing Size After Last Property [ Rei-SdkDumper ])
	float                                         UpdateTargetCD;                                    // 0x049C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          UseRandomTargetActor;                              // 0x04A0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4A1[0x3];                                      // 0x04A1(0x0003)(Fixing Size After Last Property [ Rei-SdkDumper ])
	float                                         EndMoveDis;                                        // 0x04A4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class AActor>                     TargetActorClass;                                  // 0x04A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class AActor*>                         TargetActorsCache;                                 // 0x04B0(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPublic)
	float                                         ResetTargetCD;                                     // 0x04C0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4C4[0xC];                                      // 0x04C4(0x000C)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("WaterPark_AIModify_MoveToRandomPos")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WaterPark_AIModify_MoveToRandomPos")
	}
	static class UWaterPark_AIModify_MoveToRandomPos* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWaterPark_AIModify_MoveToRandomPos>();
	}
};
DUMPER7_ASSERTS_UWaterPark_AIModify_MoveToRandomPos;

// Class GameEx.WP_AIAreaModifyActor
// 0x0010 (0x0238 - 0x0228)
class AWP_AIAreaModifyActor final : public AActor
{
public:
	class UBoxComponent*                          Box;                                               // 0x0228(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         AreaId;                                            // 0x0230(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         EndDisToTarget;                                    // 0x0234(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("WP_AIAreaModifyActor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WP_AIAreaModifyActor")
	}
	static class AWP_AIAreaModifyActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AWP_AIAreaModifyActor>();
	}
};
DUMPER7_ASSERTS_AWP_AIAreaModifyActor;

// Class GameEx.WP_AITargetModifyActor
// 0x0020 (0x0248 - 0x0228)
class AWP_AITargetModifyActor final : public AActor
{
public:
	class UBoxComponent*                          Box;                                               // 0x0228(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         AreaId;                                            // 0x0230(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          UseTargetCenter;                                   // 0x0234(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_235[0x3];                                      // 0x0235(0x0003)(Fixing Size After Last Property [ Rei-SdkDumper ])
	struct FVector                                TendencyMoveDir;                                   // 0x0238(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_244[0x4];                                      // 0x0244(0x0004)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("WP_AITargetModifyActor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WP_AITargetModifyActor")
	}
	static class AWP_AITargetModifyActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AWP_AITargetModifyActor>();
	}
};
DUMPER7_ASSERTS_AWP_AITargetModifyActor;

// Class GameEx.GECustomPathFollowingComponent
// 0x0000 (0x0250 - 0x0250)
class UGECustomPathFollowingComponent final : public UPathFollowingComponent
{
public:
	bool CheckReachProxyMidPoint(const struct FVector& CurrentLocation, const struct FVector& StartLocation, const struct FVector& TargetLocation);
	void ForceCurLinkFromLua();
	bool UsingCustomLink();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GECustomPathFollowingComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GECustomPathFollowingComponent")
	}
	static class UGECustomPathFollowingComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGECustomPathFollowingComponent>();
	}
};
DUMPER7_ASSERTS_UGECustomPathFollowingComponent;

// Class GameEx.GEAIController
// 0x02B0 (0x05E0 - 0x0330)
class AGEAIController final : public AAIController
{
public:
	TDelegate<void(const class FString& NotifyName, const class FString& NotifyParam)> EventNotifyDelegate; // 0x0330(0x0010)(ZeroConstructor, InstancedReference, NoDestructor, NativeAccessSpecifierPublic)
	TMap<class FString, float>                    FloatValueMap;                                     // 0x0340(0x0050)(Edit, BlueprintVisible, BlueprintReadOnly, Transient, EditConst, NativeAccessSpecifierPublic)
	TMap<class FString, bool>                     BoolValueMap;                                      // 0x0390(0x0050)(Edit, BlueprintVisible, BlueprintReadOnly, Transient, EditConst, NativeAccessSpecifierPublic)
