#pragma once

/*
* SDK generated by Rei-SdkDumper
* Based on Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GameWebBrowser

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// Class GameWebBrowser.GameWebBrowser
// 0x0088 (0x01B0 - 0x0128)
class UGameWebBrowser final : public UWidget
{
public:
	bool                                          bDisable3DSupports;                                // 0x0128(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_129[0x7];                                      // 0x0129(0x0007)(Fixing Size After Last Property [ Rei-SdkDumper ])
	TMulticastInlineDelegate<void(const class FString& URL)> OnCommunicateWithGame;                  // 0x0130(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const class FText& Text)> OnUrlChanged;                            // 0x0140(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const class FString& URL, const class FString& Frame)> OnBeforePopup; // 0x0150(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class FString                                 InitialURL;                                        // 0x0160(0x0010)(Edit, ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bSupportsTransparency;                             // 0x0170(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_171[0x3];                                      // 0x0171(0x0003)(Fixing Size After Last Property [ Rei-SdkDumper ])
	struct FIntPoint                              ViewportSize;                                      // 0x0174(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_17C[0x34];                                     // 0x017C(0x0034)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])

public:
	void ExecuteJavascript(const class FString& ScriptText);
	void LoadString(const class FString& Contents, const class FString& DummyURL);
	void LoadURL(const class FString& NewURL);

	class FText GetTitleText() const;
	class FString GetUrl() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GameWebBrowser")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GameWebBrowser")
	}
	static class UGameWebBrowser* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameWebBrowser>();
	}
};
DUMPER7_ASSERTS_UGameWebBrowser;

// Class GameWebBrowser.GameWebBrowserAssetManager
// 0x0050 (0x0078 - 0x0028)
class UGameWebBrowserAssetManager final : public UObject
{
public:
	TSoftObjectPtr<class UMaterial>               DefaultMaterial;                                   // 0x0028(0x0028)(Transient, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSoftObjectPtr<class UMaterial>               DefaultTranslucentMaterial;                        // 0x0050(0x0028)(Transient, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GameWebBrowserAssetManager")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GameWebBrowserAssetManager")
	}
	static class UGameWebBrowserAssetManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameWebBrowserAssetManager>();
	}
};
DUMPER7_ASSERTS_UGameWebBrowserAssetManager;

}

