#pragma once

/*
* SDK generated by Rei-SdkDumper
* Based on Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GameWebBrowser

#include "Basic.hpp"


namespace SDK::Params
{

// Function GameWebBrowser.GameWebBrowser.ExecuteJavascript
// 0x0010 (0x0010 - 0x0000)
struct GameWebBrowser_ExecuteJavascript final
{
public:
	class FString                                 ScriptText;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GameWebBrowser_ExecuteJavascript;

// Function GameWebBrowser.GameWebBrowser.LoadString
// 0x0020 (0x0020 - 0x0000)
struct GameWebBrowser_LoadString final
{
public:
	class FString                                 Contents;                                          // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 DummyURL;                                          // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GameWebBrowser_LoadString;

// Function GameWebBrowser.GameWebBrowser.LoadURL
// 0x0010 (0x0010 - 0x0000)
struct GameWebBrowser_LoadURL final
{
public:
	class FString                                 NewURL;                                            // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GameWebBrowser_LoadURL;

// Function GameWebBrowser.GameWebBrowser.GetTitleText
// 0x0018 (0x0018 - 0x0000)
struct GameWebBrowser_GetTitleText final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GameWebBrowser_GetTitleText;

// Function GameWebBrowser.GameWebBrowser.GetUrl
// 0x0010 (0x0010 - 0x0000)
struct GameWebBrowser_GetUrl final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GameWebBrowser_GetUrl;

}

