#pragma once

/*
* SDK generated by Rei-SdkDumper
* Based on Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GameTask

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// Enum GameTask.ELevelFailedReason
// NumValues: 0x0006
enum class ELevelFailedReason : uint8
{
	Dead                                     = 0,
	OverTime                                 = 1,
	ManualExit                               = 2,
	OffLine                                  = 3,
	Success                                  = 4,
	ELevelFailedReason_MAX                   = 5,
};

// Enum GameTask.ELevelFinishResult
// NumValues: 0x0003
enum class ELevelFinishResult : uint8
{
	Failed                                   = 0,
	Success                                  = 1,
	MAX                                      = 2,
};

// Enum GameTask.EBoxType
// NumValues: 0x0004
enum class EBoxType : uint8
{
	Active                                   = 0,
	Entry                                    = 1,
	Exit                                     = 2,
	Max                                      = 3,
};

// Enum GameTask.EMonsterResetType
// NumValues: 0x0003
enum class EMonsterResetType : uint8
{
	FarFromSpawnPoint                        = 0,
	FarFromPlayer                            = 1,
	EMonsterResetType_MAX                    = 2,
};

// Enum GameTask.EMonsterResetLocationType
// NumValues: 0x0003
enum class EMonsterResetLocationType : uint8
{
	AtSpawnPoint                             = 0,
	AroundPlayer                             = 1,
	EMonsterResetLocationType_MAX            = 2,
};

// Enum GameTask.EExecuteUIAnimType
// NumValues: 0x0004
enum class EExecuteUIAnimType : uint8
{
	Disable                                  = 0,
	Little                                   = 1,
	Big                                      = 2,
	EExecuteUIAnimType_MAX                   = 3,
};

// Enum GameTask.ESubGameTaskType
// NumValues: 0x0004
enum class ESubGameTaskType : uint8
{
	Normal                                   = 0,
	GirlRush                                 = 1,
	LevelType_MAX                            = 2,
	ESubGameTaskType_MAX                     = 3,
};

// Enum GameTask.ELevelType
// NumValues: 0x0027
enum class ELevelType : uint8
{
	Normal                                   = 0,
	Daily                                    = 1,
	Tower                                    = 2,
	Fragments                                = 3,
	BossChallenge                            = 4,
	Multi                                    = 5,
	OpenWorld                                = 6,
	Defend                                   = 7,
	Chess                                    = 8,
	DLC1                                     = 9,
	DLC1_ROGUE                               = 10,
	Multi_Defend                             = 11,
	Multi_Defend_Easy                        = 12,
	Multi_CoopBoss                           = 13,
	Rogue                                    = 14,
	Multi_TD_Base                            = 15,
	Multi_TD_Base_Hard                       = 16,
	Pal                                      = 17,
	PalChapter                               = 18,
	Multi_NightMare                          = 19,
	ForbidZone_Easy                          = 20,
	ForbidZone_Hard                          = 21,
	CoopBoss                                 = 22,
	BagRogue                                 = 23,
	MassWaves                                = 24,
	GirlRush                                 = 25,
	TowerRush_Easy                           = 26,
	TowerRush_Hard                           = 27,
	FarmWar                                  = 28,
	OnlineSea_Easy                           = 29,
	OnlineSea_Hard                           = 30,
	OnlineSea_Challenge                      = 31,
	OnlineSea_Tutorial                       = 32,
	OnlinePurge_Race                         = 33,
	OnlinePurge_Endless                      = 34,
	WorldBoss                                = 35,
	HellDivers                               = 200,
	LevelType_MAX                            = 201,
	ELevelType_MAX                           = 202,
};

// Enum GameTask.ELevelPauseReason
// NumValues: 0x0005
enum class ELevelPauseReason : uint8
{
	None                                     = 0,
	Default                                  = 1,
	LevelTask                                = 2,
	Skill                                    = 3,
	ELevelPauseReason_MAX                    = 4,
};

// Enum GameTask.EEventNetMode
// NumValues: 0x0003
enum class EEventNetMode : uint8
{
	Client                                   = 0,
	Server                                   = 1,
	EEventNetMode_MAX                        = 2,
};

// Enum GameTask.ENodeState
// NumValues: 0x0005
enum class ENodeState : uint8
{
	Normal                                   = 0,
	InProgress                               = 1,
	Succeeded                                = 2,
	Failed                                   = 3,
	ENodeState_MAX                           = 4,
};

// Enum GameTask.EChallengeBuffType
// NumValues: 0x0004
enum class EChallengeBuffType : uint8
{
	Monster                                  = 0,
	Player                                   = 1,
	Max_Type                                 = 2,
	EChallengeBuffType_MAX                   = 3,
};

// Enum GameTask.EChallangeType
// NumValues: 0x000A
enum class EChallangeType : uint8
{
	InvalidType                              = 0,
	TimeLimited                              = 1,
	Kill1                                    = 2,
	Kill2                                    = 3,
	Blood                                    = 4,
	Death                                    = 5,
	Partial                                  = 6,
	Negative                                 = 7,
	Max_State                                = 8,
	EChallangeType_MAX                       = 9,
};

// Enum GameTask.ETaskType
// NumValues: 0x0007
enum class ETaskType : uint8
{
	InvalidType                              = 0,
	Annihilate                               = 1,
	Defend                                   = 2,
	Destory                                  = 3,
	Boss                                     = 4,
	Max_State                                = 5,
	ETaskType_MAX                            = 6,
};

// ScriptStruct GameTask.MonsterResetSpecialConfig
// 0x0010 (0x0010 - 0x0000)
struct FMonsterResetSpecialConfig final
{
public:
	EMonsterResetLocationType                     ResetLocationType;                                 // 0x0000(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Rei-SdkDumper ])
	int32                                         ResetRadius;                                       // 0x0004(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CheckTime;                                         // 0x0008(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         EffectId;                                          // 0x000C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FMonsterResetSpecialConfig;

// ScriptStruct GameTask.MonsterResetConfig
// 0x002C (0x002C - 0x0000)
struct FMonsterResetConfig final
{
public:
	struct FMonsterResetSpecialConfig             MonsterResetSpecialConfig;                         // 0x0000(0x0010)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic)
	EMonsterResetType                             ResetType;                                         // 0x0010(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Rei-SdkDumper ])
	int32                                         MinPlayerHDistance;                                // 0x0014(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MinPlayerVDistance;                                // 0x0018(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MinMonsterSpawnHDistance;                          // 0x001C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MinMonsterSpawnVDistance;                          // 0x0020(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         HDistanceFromNavMesh;                              // 0x0024(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         VDistanceFromNavMesh;                              // 0x0028(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FMonsterResetConfig;

// ScriptStruct GameTask.RepExecuteDes
// 0x0018 (0x0018 - 0x0000)
struct FRepExecuteDes final
{
public:
	int32                                         ExecuteNodeInnerID;                                // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Rei-SdkDumper ])
	TArray<int32>                                 DescArgs;                                          // 0x0008(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FRepExecuteDes;

// ScriptStruct GameTask.ItemDropByTag
// 0x0018 (0x0018 - 0x0000)
struct FItemDropByTag final
{
public:
	class FName                                   Tag;                                               // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 DropItems;                                         // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FItemDropByTag;

// ScriptStruct GameTask.TriggerCondition
// 0x0018 (0x0018 - 0x0000)
struct FTriggerCondition final
{
public:
	int32                                         ID;                                                // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Rei-SdkDumper ])
	class FString                                 ActivityLogic;                                     // 0x0008(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FTriggerCondition;

// ScriptStruct GameTask.MultiSubTask
// 0x0038 (0x0040 - 0x0008)
struct FMultiSubTask final : public FTableRowBase
{
public:
	int32                                         ID;                                                // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Count;                                             // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Score;                                             // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Rei-SdkDumper ])
	TArray<class FString>                         BlockManagerNames;                                 // 0x0018(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class FName>                           Tags;                                              // 0x0028(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	class FName                                   Desc;                                              // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FMultiSubTask;

// ScriptStruct GameTask.TriggerConditionConfig
// 0x0008 (0x0008 - 0x0000)
struct FTriggerConditionConfig final
{
public:
	int32                                         ID;                                                // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOpenWhenLevelFinish;                              // 0x0004(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bTemporarily;                                      // 0x0005(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_FTriggerConditionConfig;

// ScriptStruct GameTask.RandomMonster
// 0x0048 (0x0050 - 0x0008)
struct FRandomMonster final : public FTableRowBase
{
public:
	int32                                         RandomMonsterId;                                   // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Rei-SdkDumper ])
	class FString                                 Desc;                                              // 0x0010(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 BufferName;                                        // 0x0020(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 BufferDesc;                                        // 0x0030(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MonsterId;                                         // 0x0040(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         KillTime;                                          // 0x0044(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         BufferId;                                          // 0x0048(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EChallengeBuffType                            BufferType;                                        // 0x004C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4D[0x3];                                       // 0x004D(0x0003)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_FRandomMonster;

// ScriptStruct GameTask.TaskChallange
// 0x0058 (0x0060 - 0x0008)
struct FTaskChallange final : public FTableRowBase
{
public:
	int32                                         ChallangeId;                                       // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EChallangeType                                TaskType;                                          // 0x000C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Rei-SdkDumper ])
	class FString                                 Icon;                                              // 0x0010(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Name;                                              // 0x0020(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Desc;                                              // 0x0030(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Reward;                                            // 0x0040(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Time;                                              // 0x0044(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         TimeKill;                                          // 0x0048(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Health;                                            // 0x004C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         DeathCount;                                        // 0x0050(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         PartialCount;                                      // 0x0054(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         BufferId;                                          // 0x0058(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EChallengeBuffType                            BufferType;                                        // 0x005C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5D[0x3];                                       // 0x005D(0x0003)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_FTaskChallange;

// ScriptStruct GameTask.TrapSetting
// 0x0018 (0x0018 - 0x0000)
struct FTrapSetting final
{
public:
	int32                                         ID;                                                // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Rei-SdkDumper ])
	class FString                                 Position;                                          // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FTrapSetting;

// ScriptStruct GameTask.TaskSetting
// 0x0058 (0x0060 - 0x0008)
struct FTaskSetting final : public FTableRowBase
{
public:
	int32                                         TaskId;                                            // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Rei-SdkDumper ])
	class FString                                 Desc;                                              // 0x0010(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftObjectPath                        SubTask;                                           // 0x0020(0x0018)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ETaskType                                     TaskType;                                          // 0x0038(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Rei-SdkDumper ])
	TArray<int32>                                 BattleMonsteres;                                   // 0x0040(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FTrapSetting>                   Trapes;                                            // 0x0050(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FTaskSetting;

// ScriptStruct GameTask.RandomSetting
// 0x0008 (0x0008 - 0x0000)
struct FRandomSetting final
{
public:
	int32                                         ID;                                                // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TaskRatio;                                         // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FRandomSetting;

// ScriptStruct GameTask.RandomTask
// 0x0048 (0x0050 - 0x0008)
struct FRandomTask final : public FTableRowBase
{
public:
	int32                                         TaskId;                                            // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Rei-SdkDumper ])
	class FString                                 Desc;                                              // 0x0010(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FRandomSetting>                 RandomTasks;                                       // 0x0020(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FRandomSetting>                 RandomChallenges;                                  // 0x0030(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FRandomSetting>                 SpecialMonsteres;                                  // 0x0040(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FRandomTask;

// ScriptStruct GameTask.RandomTaskGroup
// 0x0018 (0x0018 - 0x0000)
struct FRandomTaskGroup final
{
public:
	int32                                         TaskCount;                                         // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Rei-SdkDumper ])
	TArray<int32>                                 RandomTask;                                        // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FRandomTaskGroup;

// ScriptStruct GameTask.LevelAreaTask
// 0x0060 (0x0068 - 0x0008)
struct FLevelAreaTask final : public FTableRowBase
{
public:
	int32                                         LevelID;                                           // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Rei-SdkDumper ])
	class FString                                 Desc;                                              // 0x0010(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<int32>                                 AreaTaskIdes;                                      // 0x0020(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FRandomTaskGroup>               ChallengeGroup;                                    // 0x0030(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FRandomTaskGroup>               SpecialMonsterGroup;                               // 0x0040(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<int32>                                 SpecialMonsterSkilles;                             // 0x0050(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	int32                                         SubTaskId;                                         // 0x0060(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_FLevelAreaTask;

}

