#pragma once

/*
* SDK generated by Rei-SdkDumper
* Based on Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GameLogicTree

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// Enum GameLogicTree.ELogicTreeEntity_State
// NumValues: 0x0005
enum class ELogicTreeEntity_State : uint8
{
	None                                     = 0,
	Installed                                = 1,
	Active                                   = 2,
	Running                                  = 3,
	ELogicTreeEntity_MAX                     = 4,
};

// Enum GameLogicTree.EGameLogicTreeEvent
// NumValues: 0x0003
enum class EGameLogicTreeEvent : uint8
{
	None                                     = 0,
	AddBuff                                  = 1,
	EGameLogicTreeEvent_MAX                  = 2,
};

// Enum GameLogicTree.EGameLogicTreeAction
// NumValues: 0x0007
enum class EGameLogicTreeAction : uint8
{
	None                                     = 0,
	DataAdd                                  = 1,
	DataSubtraction                          = 2,
	DataMultiply                             = 3,
	DataDivision                             = 4,
	DataCover                                = 5,
	EGameLogicTreeAction_MAX                 = 6,
};

// Enum GameLogicTree.ELogicTreeBBUnionType
// NumValues: 0x0004
enum class ELogicTreeBBUnionType : uint8
{
	IntType                                  = 0,
	FloatType                                = 1,
	BoolType                                 = 2,
	ELogicTreeBBUnionType_MAX                = 3,
};

// Enum GameLogicTree.ESetAttributeType
// NumValues: 0x0003
enum class ESetAttributeType : uint8
{
	Float                                    = 0,
	Int                                      = 1,
	ESetAttributeType_MAX                    = 2,
};

// Enum GameLogicTree.EChangeAttributeType
// NumValues: 0x0004
enum class EChangeAttributeType : uint8
{
	OnlyDataAccessor                         = 0,
	OnlyValue                                = 1,
	Mixed                                    = 2,
	EChangeAttributeType_MAX                 = 3,
};

// Enum GameLogicTree.ELogicTreeDecoratorAbortType
// NumValues: 0x0005
enum class ELogicTreeDecoratorAbortType : uint8
{
	None                                     = 0,
	LowerPriority                            = 1,
	Self                                     = 2,
	Both                                     = 3,
	ELogicTreeDecoratorAbortType_MAX         = 4,
};

// Enum GameLogicTree.ELogicTree_NodeExecuteNet
// NumValues: 0x0006
enum class ELogicTree_NodeExecuteNet : uint8
{
	Both                                     = 0,
	HasAuthority                             = 1,
	Client                                   = 2,
	ClientOrStandAlone                       = 3,
	ClientAndLocalControlOrStandAlone        = 4,
	ELogicTree_MAX                           = 5,
};

// Enum GameLogicTree.ELogicTree_ExecuteMsg
// NumValues: 0x0003
enum class ELogicTree_ExecuteMsg : uint8
{
	None                                     = 0,
	TryAbort                                 = 1,
	ELogicTree_MAX                           = 2,
};

// Enum GameLogicTree.EGameLogic_NodeBBContextType
// NumValues: 0x0005
enum class EGameLogic_NodeBBContextType : uint8
{
	Object                                   = 0,
	ObjectArray                              = 1,
	Int                                      = 2,
	Vector                                   = 3,
	EGameLogic_MAX                           = 4,
};

// Enum GameLogicTree.EGameLogic_NodeDataOwner
// NumValues: 0x0007
enum class EGameLogic_NodeDataOwner : uint8
{
	UseBB                                    = 0,
	UseOwner                                 = 1,
	UseCustom                                = 2,
	UseBBContext                             = 3,
	UseEntityBB                              = 4,
	UseContext_OwnerData                     = 5,
	EGameLogic_MAX                           = 6,
};

// Enum GameLogicTree.EGameLogic_NodeBlackBoardOwner
// NumValues: 0x0005
enum class EGameLogic_NodeBlackBoardOwner : uint8
{
	None                                     = 0,
	UseParent                                = 1,
	UseSelf                                  = 2,
	UseOwner                                 = 3,
	EGameLogic_MAX                           = 4,
};

// Enum GameLogicTree.ELogicTreeNodeStatus
// NumValues: 0x0006
enum class ELogicTreeNodeStatus : uint8
{
	NotStarted                               = 0,
	Running                                  = 1,
	Success                                  = 2,
	Aborted                                  = 3,
	Failed                                   = 4,
	ELogicTreeNodeStatus_MAX                 = 5,
};

// Enum GameLogicTree.ELTDecorator_CompareOperation
// NumValues: 0x0007
enum class ELTDecorator_CompareOperation : uint8
{
	Equal                                    = 0,
	NotEqual                                 = 1,
	Greater                                  = 2,
	GreaterOrEqual                           = 3,
	Less                                     = 4,
	LessOrEqual                              = 5,
	ELTDecorator_MAX                         = 6,
};

// ScriptStruct GameLogicTree.LogicTree_BBContext
// 0x0040 (0x0040 - 0x0000)
struct FLogicTree_BBContext final
{
public:
	class UObject*                                Object;                                            // 0x0000(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UObject*>                        ObjectArray;                                       // 0x0008(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPublic)
	int32                                         IntValue;                                          // 0x0018(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FloatValue;                                        // 0x001C(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Vector;                                            // 0x0020(0x000C)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Rei-SdkDumper ])
	struct FQuat                                  Rotation;                                          // 0x0030(0x0010)(Transient, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FLogicTree_BBContext;

// ScriptStruct GameLogicTree.LogicTree_LogicHandleItem
// 0x0008 (0x0014 - 0x000C)
struct FLogicTree_LogicHandleItem final : public FFastArraySerializerItem
{
public:
	int32                                         LogicId;                                           // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bActive;                                           // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_FLogicTree_LogicHandleItem;

// ScriptStruct GameLogicTree.LogicTree_MsgContext
// 0x0058 (0x0058 - 0x0000)
struct FLogicTree_MsgContext final
{
public:
	struct FGameplayTag                           MsgTag;                                            // 0x0000(0x0008)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TWeakObjectPtr<class AActor>                  Launcher;                                          // 0x0008(0x0008)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                CustomObj1;                                        // 0x0010(0x0008)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<int32>                                 CustomIntArr;                                      // 0x0018(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FVector_NetQuantize>            CustomVecArr;                                      // 0x0028(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	class ULogicTree_CustomContext*               CustomContext;                                     // 0x0038(0x0008)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FQuat>                          CustomRotArr;                                      // 0x0040(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_50[0x8];                                       // 0x0050(0x0008)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_FLogicTree_MsgContext;

// ScriptStruct GameLogicTree.LogicTreeActionBindData
// 0x0010 (0x0010 - 0x0000)
struct FLogicTreeActionBindData final
{
public:
	EGameLogicTreeEvent                           TargetEvent;                                       // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Rei-SdkDumper ])
	class ULogicTree_ActionBase*                  ActionInfo;                                        // 0x0008(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FLogicTreeActionBindData;

// ScriptStruct GameLogicTree.LogicTreeBBValue
// 0x0010 (0x0010 - 0x0000)
struct FLogicTreeBBValue final
{
public:
	ELogicTreeBBUnionType                         ValueType;                                         // 0x0000(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Rei-SdkDumper ])
	int32                                         IntValue;                                          // 0x0004(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FloatValue;                                        // 0x0008(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          BoolValue;                                         // 0x000C(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ClearOnReEnter;                                    // 0x000D(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_E[0x2];                                        // 0x000E(0x0002)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_FLogicTreeBBValue;

// ScriptStruct GameLogicTree.LogicTree_DataAccessor
// 0x0038 (0x0038 - 0x0000)
struct FLogicTree_DataAccessor final
{
public:
	EGameLogic_NodeDataOwner                      DataOwner;                                         // 0x0000(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EGameLogic_NodeBBContextType                  ContextType;                                       // 0x0001(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Rei-SdkDumper ])
	class FName                                   DataName;                                          // 0x0004(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLogicTreeBBValue                      CacheValue;                                        // 0x000C(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	class FName                                   OwnerNameInContext;                                // 0x001C(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Rei-SdkDumper ])
	class ULogicTree_BlackBoard*                  TargetBB;                                          // 0x0028(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ULogicTree_EntityDataCom*               TargetDataCom;                                     // 0x0030(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FLogicTree_DataAccessor;

// ScriptStruct GameLogicTree.GameLogicTree_AttributeAccessor
// 0x0050 (0x0050 - 0x0000)
struct FGameLogicTree_AttributeAccessor final
{
public:
	EChangeAttributeType                          AttributeType;                                     // 0x0000(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Rei-SdkDumper ])
	struct FLogicTree_DataAccessor                DataAccessor;                                      // 0x0008(0x0038)(Edit, DisableEditOnInstance, ContainsInstancedReference, NativeAccessSpecifierPublic)
	EGameLogicTreeAction                          Action;                                            // 0x0040(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Rei-SdkDumper ])
	float                                         Param;                                             // 0x0044(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          NeedChangePercent;                                 // 0x0048(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_FGameLogicTree_AttributeAccessor;

// ScriptStruct GameLogicTree.LogicTree_FloatData
// 0x0094 (0x00A0 - 0x000C)
struct alignas(0x08) FLogicTree_FloatData final : public FFastArraySerializerItem
{
public:
	class FName                                   DataName;                                          // 0x000C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BaseValue;                                         // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CurrentValue;                                      // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x84];                                      // 0x001C(0x0084)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_FLogicTree_FloatData;

// ScriptStruct GameLogicTree.LogicTree_EntityDataContainer
// 0x0060 (0x0168 - 0x0108)
struct FLogicTree_EntityDataContainer final : public FFastArraySerializer
{
public:
	TArray<struct FLogicTree_FloatData>           Items;                                             // 0x0108(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TMap<class FName, int32>                      NameToIndexMap;                                    // 0x0118(0x0050)(Transient, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FLogicTree_EntityDataContainer;

// ScriptStruct GameLogicTree.LogicTree_LogicHandle
// 0x000C (0x000C - 0x0000)
struct FLogicTree_LogicHandle final
{
public:
	TWeakObjectPtr<class ULogicTree_LogicHandleCom> OwnerComponent;                                  // 0x0000(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         LogicId;                                           // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FLogicTree_LogicHandle;

// ScriptStruct GameLogicTree.LogicTree_LogicHandleContainer
// 0x0078 (0x0180 - 0x0108)
struct FLogicTree_LogicHandleContainer final : public FFastArraySerializer
{
public:
	TArray<struct FLogicTree_LogicHandleItem>     Items;                                             // 0x0108(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_118[0x68];                                     // 0x0118(0x0068)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_FLogicTree_LogicHandleContainer;

// ScriptStruct GameLogicTree.LogicTree_MsgConditionCheck
// 0x0018 (0x0018 - 0x0000)
struct FLogicTree_MsgConditionCheck final
{
public:
	int32                                         CustomIntIndex;                                    // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         CompareIntVal;                                     // 0x0004(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<int32>                                 OrCompareIntVal;                                   // 0x0008(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FLogicTree_MsgConditionCheck;

// ScriptStruct GameLogicTree.LogicTree_NodeExecutionData
// 0x0038 (0x0038 - 0x0000)
struct FLogicTree_NodeExecutionData final
{
public:
	int32                                         NodeId;                                            // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           DataTag;                                           // 0x0004(0x0008)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector_NetQuantize                    PosParam;                                          // 0x000C(0x000C)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector_NetQuantize                    DirParam;                                          // 0x0018(0x000C)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Rei-SdkDumper ])
	TArray<int32>                                 CustomInsArr;                                      // 0x0028(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FLogicTree_NodeExecutionData;

// ScriptStruct GameLogicTree.LogicTree_BindActionToMsg
// 0x0020 (0x0020 - 0x0000)
struct FLogicTree_BindActionToMsg final
{
public:
	struct FGameplayTag                           TargetTag;                                         // 0x0000(0x0008)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ULogicTree_ActionBase*                  Action;                                            // 0x0008(0x0008)(Edit, ExportObject, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class ULogicTree_ActionBase*>          OtherActions;                                      // 0x0010(0x0010)(Edit, ExportObject, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FLogicTree_BindActionToMsg;

}

