#pragma once

/*
* SDK generated by Rei-SdkDumper
* Based on Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GameEx

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "AIModule_structs.hpp"
#include "Engine_structs.hpp"
#include "GameLogicTree_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "GameEx_structs.hpp"


namespace SDK::Params
{

// Function GameEx.GERotateBrick.SetBrickState
// 0x0001 (0x0001 - 0x0000)
struct GERotateBrick_SetBrickState final
{
public:
	EGERotateBrickState                           InState;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GERotateBrick_SetBrickState;

// Function GameEx.GERotateBrick.SetEffectMat
// 0x0004 (0x0004 - 0x0000)
struct GERotateBrick_SetEffectMat final
{
public:
	int32                                         EffectType;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GERotateBrick_SetEffectMat;

// Function GameEx.GERotateBrick.SyncRotateFinish
// 0x0004 (0x0004 - 0x0000)
struct GERotateBrick_SyncRotateFinish final
{
public:
	float                                         CurAngle;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GERotateBrick_SyncRotateFinish;

// Function GameEx.GERotateBrick.SyncStartRotateTime
// 0x0004 (0x0004 - 0x0000)
struct GERotateBrick_SyncStartRotateTime final
{
public:
	float                                         CurTime;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GERotateBrick_SyncStartRotateTime;

// Function GameEx.GEScripteEventMgr.GetActorExComLuaTableName
// 0x0010 (0x0010 - 0x0000)
struct GEScripteEventMgr_GetActorExComLuaTableName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GEScripteEventMgr_GetActorExComLuaTableName;

// Function GameEx.GEScripteEventMgr.GetGameModeLuaTableName
// 0x0010 (0x0010 - 0x0000)
struct GEScripteEventMgr_GetGameModeLuaTableName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GEScripteEventMgr_GetGameModeLuaTableName;

// Function GameEx.GEScripteEventMgr.GetInstance
// 0x0008 (0x0008 - 0x0000)
struct GEScripteEventMgr_GetInstance final
{
public:
	class UGEScripteEventMgr*                     ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GEScripteEventMgr_GetInstance;

// Function GameEx.GEScripteEventMgr.GetScripMgrLuaTableName
// 0x0010 (0x0010 - 0x0000)
struct GEScripteEventMgr_GetScripMgrLuaTableName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GEScripteEventMgr_GetScripMgrLuaTableName;

// Function GameEx.GEScripteEventMgr.SetScripMgrLuaTableName
// 0x0010 (0x0010 - 0x0000)
struct GEScripteEventMgr_SetScripMgrLuaTableName final
{
public:
	class FString                                 Name_0;                                            // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GEScripteEventMgr_SetScripMgrLuaTableName;

// Function GameEx.GEScripteEventMgr.AddGEActor
// 0x0010 (0x0010 - 0x0000)
struct GEScripteEventMgr_AddGEActor final
{
public:
	int32                                         ServerID;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Rei-SdkDumper ])
	class AActor*                                 Actor;                                             // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GEScripteEventMgr_AddGEActor;

// Function GameEx.GEScripteEventMgr.GetGameInstance
// 0x0008 (0x0008 - 0x0000)
struct GEScripteEventMgr_GetGameInstance final
{
public:
	class UGameInstance*                          ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GEScripteEventMgr_GetGameInstance;

// Function GameEx.GEScripteEventMgr.GetGEActorByServerID
// 0x0018 (0x0018 - 0x0000)
struct GEScripteEventMgr_GetGEActorByServerID final
{
public:
	int32                                         ServerID;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Rei-SdkDumper ])
	class UWorld*                                 World;                                             // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GEScripteEventMgr_GetGEActorByServerID;

// Function GameEx.GEScripteEventMgr.NotifyToTSEvent
// 0x0020 (0x0020 - 0x0000)
struct GEScripteEventMgr_NotifyToTSEvent final
{
public:
	class FString                                 Cmd;                                               // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Param;                                             // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GEScripteEventMgr_NotifyToTSEvent;

// Function GameEx.GEScripteEventMgr.OnActorBeginPlay
// 0x0008 (0x0008 - 0x0000)
struct GEScripteEventMgr_OnActorBeginPlay final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GEScripteEventMgr_OnActorBeginPlay;

// Function GameEx.GEScripteEventMgr.OnActorEndPlay
// 0x0010 (0x0010 - 0x0000)
struct GEScripteEventMgr_OnActorEndPlay final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EEndPlayReason                                EndPlayReason;                                     // 0x0008(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_GEScripteEventMgr_OnActorEndPlay;

// Function GameEx.GEScripteEventMgr.OnStart
// 0x0008 (0x0008 - 0x0000)
struct GEScripteEventMgr_OnStart final
{
public:
	class UGameInstance*                          ins;                                               // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GEScripteEventMgr_OnStart;

// Function GameEx.GEScripteEventMgr.RemoveGEActor
// 0x0010 (0x0010 - 0x0000)
struct GEScripteEventMgr_RemoveGEActor final
{
public:
	int32                                         ServerID;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Rei-SdkDumper ])
	class UWorld*                                 World;                                             // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GEScripteEventMgr_RemoveGEActor;

// Function GameEx.GEScripteEventMgr.RemoveLuaTable
// 0x0010 (0x0010 - 0x0000)
struct GEScripteEventMgr_RemoveLuaTable final
{
public:
	class FString                                 TableName;                                         // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GEScripteEventMgr_RemoveLuaTable;

// Function GameEx.GEScripteEventMgr.SetLuaTable
// 0x0020 (0x0020 - 0x0000)
struct GEScripteEventMgr_SetLuaTable final
{
public:
	class FString                                 TableName;                                         // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 GetFunName;                                        // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GEScripteEventMgr_SetLuaTable;

// Function GameEx.GESkillLibrary.CanAddStoreCount
// 0x0010 (0x0010 - 0x0000)
struct GESkillLibrary_CanAddStoreCount final
{
public:
	class AController*                            InController;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         InIndex;                                           // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x000C(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_GESkillLibrary_CanAddStoreCount;

// Function GameEx.GESkillLibrary.GetAllBuffIdByCharTeam
// 0x0018 (0x0018 - 0x0000)
struct GESkillLibrary_GetAllBuffIdByCharTeam final
{
public:
	class APawn*                                  InPawn;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<int32>                                 ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GESkillLibrary_GetAllBuffIdByCharTeam;

// Function GameEx.GESkillLibrary.GetAllSkillInfo
// 0x0010 (0x0010 - 0x0000)
struct GESkillLibrary_GetAllSkillInfo final
{
public:
	TArray<struct FGESkillInfo>                   InArr;                                             // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GESkillLibrary_GetAllSkillInfo;

// Function GameEx.GESkillLibrary.GetBuffDesParam
// 0x0018 (0x0018 - 0x0000)
struct GESkillLibrary_GetBuffDesParam final
{
public:
	int32                                         BuffId;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Level;                                             // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<float>                                 ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GESkillLibrary_GetBuffDesParam;

// Function GameEx.GESkillLibrary.GetBuffFromCount
// 0x0028 (0x0028 - 0x0000)
struct GESkillLibrary_GetBuffFromCount final
{
public:
	int32                                         Count;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Rei-SdkDumper ])
	class APawn*                                  InPawn;                                            // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          isHero;                                            // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Rei-SdkDumper ])
	TArray<int32>                                 ReturnValue;                                       // 0x0018(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GESkillLibrary_GetBuffFromCount;

// Function GameEx.GESkillLibrary.GetBuffInfoByID
// 0x0120 (0x0120 - 0x0000)
struct GESkillLibrary_GetBuffInfoByID final
{
public:
	int32                                         InId;                                              // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Rei-SdkDumper ])
	struct FGEBuffInfo                            ReturnValue;                                       // 0x0008(0x0118)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GESkillLibrary_GetBuffInfoByID;

// Function GameEx.GESkillLibrary.GetBuffLevelParam
// 0x0018 (0x0018 - 0x0000)
struct GESkillLibrary_GetBuffLevelParam final
{
public:
	int32                                         BuffId;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Level;                                             // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<int32>                                 ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GESkillLibrary_GetBuffLevelParam;

// Function GameEx.GESkillLibrary.GetBuffPath
// 0x0020 (0x0020 - 0x0000)
struct GESkillLibrary_GetBuffPath final
{
public:
	int32                                         InId;                                              // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Rei-SdkDumper ])
	struct FSoftObjectPath                        ReturnValue;                                       // 0x0008(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GESkillLibrary_GetBuffPath;

// Function GameEx.GESkillLibrary.GetOwnBuffLevel
// 0x0018 (0x0018 - 0x0000)
struct GESkillLibrary_GetOwnBuffLevel final
{
public:
	int32                                         InBuffId;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Rei-SdkDumper ])
	class APawn*                                  InPawn;                                            // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_GESkillLibrary_GetOwnBuffLevel;

// Function GameEx.GESkillLibrary.GetSkillEquipData
// 0x0040 (0x0040 - 0x0000)
struct GESkillLibrary_GetSkillEquipData final
{
public:
	class AController*                            InController;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         InIndex;                                           // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGESkillEquipInfo                      ReturnValue;                                       // 0x000C(0x0034)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GESkillLibrary_GetSkillEquipData;

// Function GameEx.GESkillLibrary.GetSkillInfo
// 0x00B0 (0x00B0 - 0x0000)
struct GESkillLibrary_GetSkillInfo final
{
public:
	int32                                         InId;                                              // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Rei-SdkDumper ])
	struct FGESkillInfo                           ReturnValue;                                       // 0x0008(0x00A8)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GESkillLibrary_GetSkillInfo;

// Function GameEx.GESkillLibrary.GetSkillPath
// 0x0020 (0x0020 - 0x0000)
struct GESkillLibrary_GetSkillPath final
{
public:
	int32                                         InId;                                              // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Rei-SdkDumper ])
	struct FSoftObjectPath                        ReturnValue;                                       // 0x0008(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GESkillLibrary_GetSkillPath;

// Function GameEx.GESkillLibrary.IsUseable
// 0x0010 (0x0010 - 0x0000)
struct GESkillLibrary_IsUseable final
{
public:
	class AController*                            InController;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         InIndex;                                           // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x000C(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_GESkillLibrary_IsUseable;

// Function GameEx.GESkillLibrary.ModifySkillReduceCD
// 0x0010 (0x0010 - 0x0000)
struct GESkillLibrary_ModifySkillReduceCD final
{
public:
	class AGEPlayerState*                         Ps;                                                // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         InIndex;                                           // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InReduceValue;                                     // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GESkillLibrary_ModifySkillReduceCD;

// Function GameEx.GESkillLibrary.ModifySkillStoreCount
// 0x0010 (0x0010 - 0x0000)
struct GESkillLibrary_ModifySkillStoreCount final
{
public:
	class AGEGameCharacter*                       Char;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         InIndex;                                           // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         InAddCount;                                        // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GESkillLibrary_ModifySkillStoreCount;

// Function GameEx.GESkillLibrary.SetIsUsed
// 0x0010 (0x0010 - 0x0000)
struct GESkillLibrary_SetIsUsed final
{
public:
	class AController*                            InController;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         InIndex;                                           // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_GESkillLibrary_SetIsUsed;

// Function GameEx.GESkillLibrary.SetSkillEquipData
// 0x0040 (0x0040 - 0x0000)
struct GESkillLibrary_SetSkillEquipData final
{
public:
	class AController*                            InController;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         InIndex;                                           // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGESkillEquipInfo                      Info;                                              // 0x000C(0x0034)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GESkillLibrary_SetSkillEquipData;

// Function GameEx.GESplineConveyorComponent.AddMoveActor
// 0x0010 (0x0010 - 0x0000)
struct GESplineConveyorComponent_AddMoveActor final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         StartLen;                                          // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCheckRepeat;                                      // 0x000C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_GESplineConveyorComponent_AddMoveActor;

// Function GameEx.GESplineConveyorComponent.SetMoveValue
// 0x0010 (0x0010 - 0x0000)
struct GESplineConveyorComponent_SetMoveValue final
{
public:
	float                                         Time;                                              // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Rei-SdkDumper ])
	int64                                         servertimeMilli;                                   // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GESplineConveyorComponent_SetMoveValue;

// Function GameEx.GEActorExComponent.SetAllServerID
// 0x0004 (0x0004 - 0x0000)
struct GEActorExComponent_SetAllServerID final
{
public:
	int32                                         ID;                                                // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GEActorExComponent_SetAllServerID;

// Function GameEx.GEActorExComponent.CallLuaFun
// 0x0020 (0x0020 - 0x0000)
struct GEActorExComponent_CallLuaFun final
{
public:
	class FString                                 fucName;                                           // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 funParam;                                          // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GEActorExComponent_CallLuaFun;

// Function GameEx.GEActorExComponent.CallLuaFunByDelegate
// 0x0020 (0x0020 - 0x0000)
struct GEActorExComponent_CallLuaFunByDelegate final
{
public:
	class FString                                 funName;                                           // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Param;                                             // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GEActorExComponent_CallLuaFunByDelegate;

// Function GameEx.GEActorExComponent.GetCharID
// 0x0004 (0x0004 - 0x0000)
struct GEActorExComponent_GetCharID final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GEActorExComponent_GetCharID;

// Function GameEx.GEActorExComponent.GetConfID
// 0x0004 (0x0004 - 0x0000)
struct GEActorExComponent_GetConfID final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GEActorExComponent_GetConfID;

// Function GameEx.GEActorExComponent.GetDataInt
// 0x0018 (0x0018 - 0x0000)
struct GEActorExComponent_GetDataInt final
{
public:
	class FString                                 Key;                                               // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_GEActorExComponent_GetDataInt;

// Function GameEx.GEActorExComponent.GetDataString
// 0x0020 (0x0020 - 0x0000)
struct GEActorExComponent_GetDataString final
{
public:
	class FString                                 Key;                                               // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GEActorExComponent_GetDataString;

// Function GameEx.GEActorExComponent.GetEntityType
// 0x0004 (0x0004 - 0x0000)
struct GEActorExComponent_GetEntityType final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GEActorExComponent_GetEntityType;

// Function GameEx.GEActorExComponent.GetServerID
// 0x0004 (0x0004 - 0x0000)
struct GEActorExComponent_GetServerID final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GEActorExComponent_GetServerID;

// Function GameEx.GEActorExComponent.GetUserID
// 0x0004 (0x0004 - 0x0000)
struct GEActorExComponent_GetUserID final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GEActorExComponent_GetUserID;

// Function GameEx.GEActorExComponent.NotifyActorMsg_Client
// 0x0008 (0x0008 - 0x0000)
struct GEActorExComponent_NotifyActorMsg_Client final
{
public:
	int32                                         TypeId;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SubId;                                             // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GEActorExComponent_NotifyActorMsg_Client;

// Function GameEx.GEActorExComponent.NotifyActorMsg_Client_Unreliable
// 0x0008 (0x0008 - 0x0000)
struct GEActorExComponent_NotifyActorMsg_Client_Unreliable final
{
public:
	int32                                         TypeId;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SubId;                                             // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GEActorExComponent_NotifyActorMsg_Client_Unreliable;

// Function GameEx.GEActorExComponent.NotifyActorMsg_NetMulticast
// 0x0008 (0x0008 - 0x0000)
struct GEActorExComponent_NotifyActorMsg_NetMulticast final
{
public:
	int32                                         TypeId;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SubId;                                             // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GEActorExComponent_NotifyActorMsg_NetMulticast;

// Function GameEx.GEActorExComponent.NotifyActorMsg_NetMulticast_Unreliable
// 0x0008 (0x0008 - 0x0000)
struct GEActorExComponent_NotifyActorMsg_NetMulticast_Unreliable final
{
public:
	int32                                         TypeId;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SubId;                                             // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GEActorExComponent_NotifyActorMsg_NetMulticast_Unreliable;

// Function GameEx.GEActorExComponent.NotifyActorMsg_Server
// 0x0008 (0x0008 - 0x0000)
struct GEActorExComponent_NotifyActorMsg_Server final
{
public:
	int32                                         TypeId;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SubId;                                             // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GEActorExComponent_NotifyActorMsg_Server;

// Function GameEx.GEActorExComponent.NotifyActorMsg_Server_Unreliable
// 0x0008 (0x0008 - 0x0000)
struct GEActorExComponent_NotifyActorMsg_Server_Unreliable final
{
public:
	int32                                         TypeId;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SubId;                                             // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GEActorExComponent_NotifyActorMsg_Server_Unreliable;

// Function GameEx.GEActorExComponent.NotifyMsg_Client
// 0x0018 (0x0018 - 0x0000)
struct GEActorExComponent_NotifyMsg_Client final
{
public:
	int32                                         mainID;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SubId;                                             // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Data;                                              // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GEActorExComponent_NotifyMsg_Client;

// Function GameEx.GEActorExComponent.NotifyMsg_Client_Unreliable
// 0x0018 (0x0018 - 0x0000)
struct GEActorExComponent_NotifyMsg_Client_Unreliable final
{
public:
	int32                                         mainID;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SubId;                                             // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Data;                                              // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GEActorExComponent_NotifyMsg_Client_Unreliable;

// Function GameEx.GEActorExComponent.NotifyMsg_NetMulticast
// 0x0018 (0x0018 - 0x0000)
struct GEActorExComponent_NotifyMsg_NetMulticast final
{
public:
	int32                                         mainID;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SubId;                                             // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Value;                                             // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GEActorExComponent_NotifyMsg_NetMulticast;

// Function GameEx.GEActorExComponent.NotifyMsg_NetMulticast_Unreliable
// 0x0018 (0x0018 - 0x0000)
struct GEActorExComponent_NotifyMsg_NetMulticast_Unreliable final
{
public:
	int32                                         mainID;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SubId;                                             // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Value;                                             // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GEActorExComponent_NotifyMsg_NetMulticast_Unreliable;

// Function GameEx.GEActorExComponent.NotifyMsg_Server
// 0x0018 (0x0018 - 0x0000)
struct GEActorExComponent_NotifyMsg_Server final
{
public:
	int32                                         mainID;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SubId;                                             // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Data;                                              // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GEActorExComponent_NotifyMsg_Server;

// Function GameEx.GEActorExComponent.NotifyMsg_Server_Unreliable
// 0x0018 (0x0018 - 0x0000)
struct GEActorExComponent_NotifyMsg_Server_Unreliable final
{
public:
	int32                                         mainID;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SubId;                                             // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Data;                                              // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GEActorExComponent_NotifyMsg_Server_Unreliable;

// Function GameEx.GEActorExComponent.PrintID
// 0x0010 (0x0010 - 0x0000)
struct GEActorExComponent_PrintID final
{
public:
	class FString                                 Tag;                                               // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GEActorExComponent_PrintID;

// Function GameEx.GEActorExComponent.SetCharID
// 0x0004 (0x0004 - 0x0000)
struct GEActorExComponent_SetCharID final
{
public:
	int32                                         iCharid;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GEActorExComponent_SetCharID;

// Function GameEx.GEActorExComponent.SetConfID
// 0x0004 (0x0004 - 0x0000)
struct GEActorExComponent_SetConfID final
{
public:
	int32                                         iConfID;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GEActorExComponent_SetConfID;

// Function GameEx.GEActorExComponent.SetCustomRepData
// 0x0008 (0x0008 - 0x0000)
struct GEActorExComponent_SetCustomRepData final
{
public:
	int32                                         DataIndex;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         DataValue;                                         // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GEActorExComponent_SetCustomRepData;

// Function GameEx.GEActorExComponent.SetDataInt
// 0x0018 (0x0018 - 0x0000)
struct GEActorExComponent_SetDataInt final
{
public:
	class FString                                 Key;                                               // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Value;                                             // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_GEActorExComponent_SetDataInt;

// Function GameEx.GEActorExComponent.SetDataString
// 0x0020 (0x0020 - 0x0000)
struct GEActorExComponent_SetDataString final
{
public:
	class FString                                 Key;                                               // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Value;                                             // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GEActorExComponent_SetDataString;

// Function GameEx.GEActorExComponent.SetEntityType
// 0x0004 (0x0004 - 0x0000)
struct GEActorExComponent_SetEntityType final
{
public:
	int32                                         ientityType;                                       // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GEActorExComponent_SetEntityType;

// Function GameEx.GEActorExComponent.SetUserID
// 0x0004 (0x0004 - 0x0000)
struct GEActorExComponent_SetUserID final
{
public:
	int32                                         iUserid;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GEActorExComponent_SetUserID;

// Function GameEx.GESplineMoveComponent.AddMoveActor
// 0x0010 (0x0010 - 0x0000)
struct GESplineMoveComponent_AddMoveActor final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         StartLen;                                          // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCheckRepeat;                                      // 0x000C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_GESplineMoveComponent_AddMoveActor;

// Function GameEx.GESplineMoveComponent.SetisSelfMove
// 0x0001 (0x0001 - 0x0000)
struct GESplineMoveComponent_SetisSelfMove final
{
public:
	bool                                          selfmove;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GESplineMoveComponent_SetisSelfMove;

// Function GameEx.GESplineMoveComponent.SetMoveValue
// 0x0010 (0x0010 - 0x0000)
struct GESplineMoveComponent_SetMoveValue final
{
public:
	float                                         Time;                                              // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Rei-SdkDumper ])
	int64                                         servertimeMilli;                                   // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GESplineMoveComponent_SetMoveValue;

// Function GameEx.WaterParkCollectAIModifyCom.IsOverLap
// 0x0010 (0x0010 - 0x0000)
struct WaterParkCollectAIModifyCom_IsOverLap final
{
public:
	struct FVector                                Pos;                                               // 0x0000(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x000C(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_WaterParkCollectAIModifyCom_IsOverLap;

// Function GameEx.WaterParkCollectAIModifyCom.ModifyMoveVec_Bp
// 0x0028 (0x0028 - 0x0000)
struct WaterParkCollectAIModifyCom_ModifyMoveVec_Bp final
{
public:
	struct FVector                                MoveVec;                                           // 0x0000(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                NowPos;                                            // 0x000C(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          CanJump;                                           // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ShouldJump;                                        // 0x0019(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1A[0x2];                                       // 0x001A(0x0002)(Fixing Size After Last Property [ Rei-SdkDumper ])
	float                                         DeltaTime;                                         // 0x001C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AGEAIController*                        TargetAIController;                                // 0x0020(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_WaterParkCollectAIModifyCom_ModifyMoveVec_Bp;

// Function GameEx.WaterParkCollectAIModifyCom.SetIsValid
// 0x0001 (0x0001 - 0x0000)
struct WaterParkCollectAIModifyCom_SetIsValid final
{
public:
	bool                                          InNewState;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_WaterParkCollectAIModifyCom_SetIsValid;

// Function GameEx.GESystem.Get
// 0x0010 (0x0010 - 0x0000)
struct GESystem_Get final
{
public:
	const class UObject*                          WorldContextObject;                                // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UGESystem*                              ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GESystem_Get;

// Function GameEx.GESystem.GetHideAndSeekMgr
// 0x0008 (0x0008 - 0x0000)
struct GESystem_GetHideAndSeekMgr final
{
public:
	class AGEHideAndSeekMgr*                      ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GESystem_GetHideAndSeekMgr;

// Function GameEx.GESystem.GetItemMgr
// 0x0008 (0x0008 - 0x0000)
struct GESystem_GetItemMgr final
{
public:
	class AGEItemMgr*                             ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GESystem_GetItemMgr;

// Function GameEx.GESystem.GetZBugRunMgr
// 0x0008 (0x0008 - 0x0000)
struct GESystem_GetZBugRunMgr final
{
public:
	class AGEZBugRunMgr*                          ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GESystem_GetZBugRunMgr;

// Function GameEx.GEWPLibrary.GetSettlementCamOffsetByTemplateID
// 0x0014 (0x0014 - 0x0000)
struct GEWPLibrary_GetSettlementCamOffsetByTemplateID final
{
public:
	int32                                         InTemplateID;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsSuccess;                                         // 0x0004(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Rei-SdkDumper ])
	struct FVector                                ReturnValue;                                       // 0x0008(0x000C)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GEWPLibrary_GetSettlementCamOffsetByTemplateID;

// Function GameEx.GEWPLibrary.SetPerformanceMode
// 0x0001 (0x0001 - 0x0000)
struct GEWPLibrary_SetPerformanceMode final
{
public:
	bool                                          bOpen;                                             // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GEWPLibrary_SetPerformanceMode;

// Function GameEx.GECustomPathFollowingComponent.CheckReachProxyMidPoint
// 0x0028 (0x0028 - 0x0000)
struct GECustomPathFollowingComponent_CheckReachProxyMidPoint final
{
public:
	struct FVector                                CurrentLocation;                                   // 0x0000(0x000C)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                StartLocation;                                     // 0x000C(0x000C)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                TargetLocation;                                    // 0x0018(0x000C)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0024(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_GECustomPathFollowingComponent_CheckReachProxyMidPoint;

// Function GameEx.GECustomPathFollowingComponent.UsingCustomLink
// 0x0001 (0x0001 - 0x0000)
struct GECustomPathFollowingComponent_UsingCustomLink final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GECustomPathFollowingComponent_UsingCustomLink;

// Function GameEx.GEAIController.AbortMoveToAsync
// 0x0004 (0x0004 - 0x0000)
struct GEAIController_AbortMoveToAsync final
{
public:
	uint32                                        AsyncQueryID;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GEAIController_AbortMoveToAsync;

// Function GameEx.GEAIController.GetBoolValue
// 0x0018 (0x0018 - 0x0000)
struct GEAIController_GetBoolValue final
{
public:
	class FString                                 Key;                                               // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_GEAIController_GetBoolValue;

// Function GameEx.GEAIController.GetFloatValue
// 0x0018 (0x0018 - 0x0000)
struct GEAIController_GetFloatValue final
{
public:
	class FString                                 Key;                                               // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_GEAIController_GetFloatValue;

// Function GameEx.GEAIController.GetIntValue
// 0x0018 (0x0018 - 0x0000)
struct GEAIController_GetIntValue final
{
public:
	class FString                                 Key;                                               // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_GEAIController_GetIntValue;

// Function GameEx.GEAIController.GetMoveDir
// 0x0014 (0x0014 - 0x0000)
struct GEAIController_GetMoveDir final
{
public:
	bool                                          CanJump;                                           // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ShouldJump;                                        // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Rei-SdkDumper ])
	float                                         DeltaSeconds;                                      // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                ReturnValue;                                       // 0x0008(0x000C)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GEAIController_GetMoveDir;

