#pragma once

/*
* SDK generated by Rei-SdkDumper
* Based on Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GameLogicTree

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "GameplayTags_structs.hpp"
#include "GameLogicTree_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class GameLogicTree.GameLogic_DataHandler
// 0x0038 (0x0060 - 0x0028)
class UGameLogic_DataHandler : public UObject
{
public:
	class ULogicTree_BlackBoard*                  TargetBlackBoard;                                  // 0x0028(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           HandlerTag;                                        // 0x0030(0x0008)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   TargetKey;                                         // 0x0038(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ExecuteInterval;                                   // 0x0040(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_44[0xC];                                       // 0x0044(0x000C)(Fixing Size After Last Property [ Rei-SdkDumper ])
	class UGameLogicTreeEntity*                   OwnEntity;                                         // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ULogicTreeNode*                         OwnerNode;                                         // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GameLogic_DataHandler")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GameLogic_DataHandler")
	}
	static class UGameLogic_DataHandler* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameLogic_DataHandler>();
	}
};
DUMPER7_ASSERTS_UGameLogic_DataHandler;

// Class GameLogicTree.LT_DataHandler_AccumulateTime
// 0x0048 (0x00A8 - 0x0060)
class ULT_DataHandler_AccumulateTime final : public UGameLogic_DataHandler
{
public:
	struct FLogicTree_DataAccessor                Timeout;                                           // 0x0060(0x0038)(Edit, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	uint8                                         Pad_98[0x8];                                       // 0x0098(0x0008)(Fixing Size After Last Property [ Rei-SdkDumper ])
	class ULogicTreeNode*                         CacheNode;                                         // 0x00A0(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("LT_DataHandler_AccumulateTime")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"LT_DataHandler_AccumulateTime")
	}
	static class ULT_DataHandler_AccumulateTime* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULT_DataHandler_AccumulateTime>();
	}
};
DUMPER7_ASSERTS_ULT_DataHandler_AccumulateTime;

// Class GameLogicTree.LogicTree_Decorator
// 0x0010 (0x0038 - 0x0028)
class ULogicTree_Decorator : public UObject
{
public:
	uint8                                         Pad_28[0x2];                                       // 0x0028(0x0002)(Fixing Size After Last Property [ Rei-SdkDumper ])
	ELogicTreeDecoratorAbortType                  AbortType;                                         // 0x002A(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          IsInverse;                                         // 0x002B(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          CanBreakChild;                                     // 0x002C(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Rei-SdkDumper ])
	class ULogicTreeNode*                         OwnerNode;                                         // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	void ReCheckAndBreakChild();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("LogicTree_Decorator")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"LogicTree_Decorator")
	}
	static class ULogicTree_Decorator* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULogicTree_Decorator>();
	}
};
DUMPER7_ASSERTS_ULogicTree_Decorator;

// Class GameLogicTree.LogicTree_Decorator_BP
// 0x0000 (0x0038 - 0x0038)
class ULogicTree_Decorator_BP final : public ULogicTree_Decorator
{
public:
	bool CheckCondition_BP();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("LogicTree_Decorator_BP")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"LogicTree_Decorator_BP")
	}
	static class ULogicTree_Decorator_BP* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULogicTree_Decorator_BP>();
	}
};
DUMPER7_ASSERTS_ULogicTree_Decorator_BP;

// Class GameLogicTree.LogicTreeNode
// 0x0078 (0x00A0 - 0x0028)
class ULogicTreeNode : public UObject
{
public:
	class UGameLogicTreeEntity*                   OwnEntity;                                         // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UNodeExecuteHelper>         ExecuteHelperClass;                                // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EGameLogic_NodeBlackBoardOwner                BlackBoardOwner;                                   // 0x0038(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Rei-SdkDumper ])
	class ULogicTree_BlackBoard*                  NodeBlackBoard;                                    // 0x0040(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, PersistentInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ULogicTreeNode*                         Parent;                                            // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         IndexInParent;                                     // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Rei-SdkDumper ])
	class UGameLogicTreeRoot*                     Root;                                              // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ULogicTree_BlackBoard*                  ExecuteParentBBCache;                              // 0x0060(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class ULogicTree_Decorator*>           Decorators;                                        // 0x0068(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_78[0x8];                                       // 0x0078(0x0008)(Fixing Size After Last Property [ Rei-SdkDumper ])
	TArray<class UGameLogic_DataHandler*>         Services;                                          // 0x0080(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_90[0x5];                                       // 0x0090(0x0005)(Fixing Size After Last Property [ Rei-SdkDumper ])
	ELogicTree_NodeExecuteNet                     ExecuteNetMode;                                    // 0x0095(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_96[0x2];                                       // 0x0096(0x0002)(Fixing Size After Last Property [ Rei-SdkDumper ])
	class ULogicTree_BlackBoard*                  RuntimeBlackBoard;                                 // 0x0098(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("LogicTreeNode")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"LogicTreeNode")
	}
	static class ULogicTreeNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULogicTreeNode>();
	}
};
DUMPER7_ASSERTS_ULogicTreeNode;

// Class GameLogicTree.LogicTree_CompositeNode
// 0x0018 (0x00B8 - 0x00A0)
class ULogicTree_CompositeNode : public ULogicTreeNode
{
public:
	TArray<class ULogicTreeNode*>                 Children;                                          // 0x00A0(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_B0[0x8];                                       // 0x00B0(0x0008)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("LogicTree_CompositeNode")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"LogicTree_CompositeNode")
	}
	static class ULogicTree_CompositeNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULogicTree_CompositeNode>();
	}
};
DUMPER7_ASSERTS_ULogicTree_CompositeNode;

// Class GameLogicTree.LogicTree_SelectorNode
// 0x0008 (0x00C0 - 0x00B8)
class ULogicTree_SelectorNode final : public ULogicTree_CompositeNode
{
public:
	class ULogicTreeNode*                         JumpTickNode;                                      // 0x00B8(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("LogicTree_SelectorNode")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"LogicTree_SelectorNode")
	}
	static class ULogicTree_SelectorNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULogicTree_SelectorNode>();
	}
};
DUMPER7_ASSERTS_ULogicTree_SelectorNode;

// Class GameLogicTree.LogicTree_DataFormula
// 0x0018 (0x0040 - 0x0028)
class ULogicTree_DataFormula : public UObject
{
public:
	uint8                                         Pad_28[0x18];                                      // 0x0028(0x0018)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("LogicTree_DataFormula")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"LogicTree_DataFormula")
	}
	static class ULogicTree_DataFormula* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULogicTree_DataFormula>();
	}
};
DUMPER7_ASSERTS_ULogicTree_DataFormula;

// Class GameLogicTree.LogicTree_ActionBase
// 0x0008 (0x0030 - 0x0028)
class ULogicTree_ActionBase : public UObject
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("LogicTree_ActionBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"LogicTree_ActionBase")
	}
	static class ULogicTree_ActionBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULogicTree_ActionBase>();
	}
};
DUMPER7_ASSERTS_ULogicTree_ActionBase;

// Class GameLogicTree.LogicTree_DestroyAction
// 0x0040 (0x0070 - 0x0030)
class ULogicTree_DestroyAction final : public ULogicTree_ActionBase
{
public:
	class FName                                   Key;                                               // 0x0030(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLogicTree_DataAccessor                DataAccessor;                                      // 0x0038(0x0038)(Edit, ContainsInstancedReference, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("LogicTree_DestroyAction")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"LogicTree_DestroyAction")
	}
	static class ULogicTree_DestroyAction* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULogicTree_DestroyAction>();
	}
};
DUMPER7_ASSERTS_ULogicTree_DestroyAction;

// Class GameLogicTree.LogicTree_TaskNode
// 0x0000 (0x00A0 - 0x00A0)
class ULogicTree_TaskNode : public ULogicTreeNode
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("LogicTree_TaskNode")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"LogicTree_TaskNode")
	}
	static class ULogicTree_TaskNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULogicTree_TaskNode>();
	}
};
DUMPER7_ASSERTS_ULogicTree_TaskNode;

// Class GameLogicTree.LogicTree_EntityDataCom
// 0x0408 (0x04B8 - 0x00B0)
class ULogicTree_EntityDataCom final : public UActorComponent
{
public:
	struct FLogicTree_EntityDataContainer         ReplicatedData;                                    // 0x00B0(0x0168)(Net, RepNotify, NativeAccessSpecifierPublic)
	uint8                                         Pad_218[0x1B8];                                    // 0x0218(0x01B8)(Fixing Size After Last Property [ Rei-SdkDumper ])
	struct FGameplayTagContainer                  ReplicatedTags;                                    // 0x03D0(0x0020)(Net, RepNotify, NativeAccessSpecifierPublic)
	uint8                                         Pad_3F0[0x70];                                     // 0x03F0(0x0070)(Fixing Size After Last Property [ Rei-SdkDumper ])
	class ULogicTreeMessageBus*                   MsgBus;                                            // 0x0460(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PosLagRecordTime;                                  // 0x0468(0x0004)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                PosLagOffset;                                      // 0x046C(0x000C)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_478[0x40];                                     // 0x0478(0x0040)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])

public:
	void AddData(class FName Name_0, float BaseValue, bool bReplicated);
	void AddTag(const struct FGameplayTag& Tag, int32 Count);
	float GetBaseData(class FName Name_0);
	float GetCurData(class FName Name_0);
	bool IsPosInLagAABB(const struct FVector& InCheckPos);
	void OnRep_Data();
	void OnRep_ReplicatedTags();
	void RegisterTagChangeCallback(const struct FGameplayTag& Tag, const TDelegate<void(const struct FGameplayTag& Tag, bool IsContain)>& Callback);
	void RemoveTag(const struct FGameplayTag& Tag, int32 Count);
	void SetBaseData(class FName Name_0, float NewValue);
	void SetCurrentData(class FName Name_0, float NewValue);
	void UnregisterTagChangeCallback(const struct FGameplayTag& Tag, class UObject* BoundObject, class FName FunctionName);

	bool GetData(class FName Name_0, float* OutBase, float* OutCurrent) const;
	bool HasTag(const struct FGameplayTag& Tag) const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("LogicTree_EntityDataCom")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"LogicTree_EntityDataCom")
	}
	static class ULogicTree_EntityDataCom* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULogicTree_EntityDataCom>();
	}
};
DUMPER7_ASSERTS_ULogicTree_EntityDataCom;

// Class GameLogicTree.LogicTree_LogicHandleCom
// 0x0418 (0x04C8 - 0x00B0)
class ULogicTree_LogicHandleCom : public UActorComponent
{
public:
	struct FLogicTree_LogicHandleContainer        ReplicatedHandles;                                 // 0x00B0(0x0180)(Net, RepNotify, NativeAccessSpecifierPublic)
	uint8                                         Pad_230[0x1D8];                                    // 0x0230(0x01D8)(Fixing Size After Last Property [ Rei-SdkDumper ])
	TMap<int32, class UGameLogicTreeEntity*>      Entities;                                          // 0x0408(0x0050)(Transient, NativeAccessSpecifierPublic)
	uint8                                         Pad_458[0x70];                                     // 0x0458(0x0070)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])

public:
	void Client_NotifyExecuteFail(int32 LogicId, int32 PredictionId);
	void Client_NotifyStopFail(int32 LogicId, int32 PredictionId);
	void MulticastExecuteLogic(int32 LogicId, int32 PredictionId);
	void MulticastExecuteNode_FromServer(int32 LogicId, int32 NodeId, const struct FLogicTree_NodeExecutionData& InData);
	void MulticastStopLogic(int32 LogicId, int32 PredictionId);
	void OnRep_ReplicatedHandles();
	void Server_TryStopLogic(int32 LogicId, int32 PredictionId);
	void TryExecuteLogic(int32 LogicId, int32 PredictionId);
	void TryExecuteLogic_FromClient(int32 LogicId);
	void TryStopLogic_FromClient(int32 LogicId);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("LogicTree_LogicHandleCom")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"LogicTree_LogicHandleCom")
	}
	static class ULogicTree_LogicHandleCom* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULogicTree_LogicHandleCom>();
	}
};
DUMPER7_ASSERTS_ULogicTree_LogicHandleCom;

// Class GameLogicTree.LogicTree_CustomContext
// 0x0000 (0x0028 - 0x0028)
class ULogicTree_CustomContext final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("LogicTree_CustomContext")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"LogicTree_CustomContext")
	}
	static class ULogicTree_CustomContext* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULogicTree_CustomContext>();
	}
};
DUMPER7_ASSERTS_ULogicTree_CustomContext;

// Class GameLogicTree.LogicTree_SpawnAction
// 0x0048 (0x0078 - 0x0030)
class ULogicTree_SpawnAction : public ULogicTree_ActionBase
{
public:
	bool                                          bAttached;                                         // 0x0030(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Rei-SdkDumper ])
	class FName                                   AttachSocket;                                      // 0x0034(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ControlByEntity;                                   // 0x003C(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Rei-SdkDumper ])
	struct FLogicTree_DataAccessor                DataAccessor;                                      // 0x0040(0x0038)(Edit, DisableEditOnInstance, ContainsInstancedReference, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("LogicTree_SpawnAction")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"LogicTree_SpawnAction")
	}
	static class ULogicTree_SpawnAction* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULogicTree_SpawnAction>();
	}
};
DUMPER7_ASSERTS_ULogicTree_SpawnAction;

// Class GameLogicTree.LT_Decorator_CheckOwnerTag
// 0x0018 (0x0050 - 0x0038)
class ULT_Decorator_CheckOwnerTag final : public ULogicTree_Decorator
{
public:
	struct FGameplayTag                           CheckTag;                                          // 0x0038(0x0008)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_40[0x8];                                       // 0x0040(0x0008)(Fixing Size After Last Property [ Rei-SdkDumper ])
	class ULogicTree_EntityDataCom*               OwnerDataComCache;                                 // 0x0048(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	void OnTagChange(const struct FGameplayTag& Tag, bool IsContain);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("LT_Decorator_CheckOwnerTag")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"LT_Decorator_CheckOwnerTag")
	}
	static class ULT_Decorator_CheckOwnerTag* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULT_Decorator_CheckOwnerTag>();
	}
};
DUMPER7_ASSERTS_ULT_Decorator_CheckOwnerTag;

// Class GameLogicTree.GameLogicTree_EntityMgr
// 0x00B0 (0x00E0 - 0x0030)
class UGameLogicTree_EntityMgr final : public UWorldSubsystem
{
public:
	uint8                                         Pad_30[0x8];                                       // 0x0030(0x0008)(Fixing Size After Last Property [ Rei-SdkDumper ])
	TMap<class AActor*, int32>                    ActorLookUp;                                       // 0x0038(0x0050)(Transient, Protected, NativeAccessSpecifierProtected)
	TMap<int32, class ULogicTree_EntityDataCom*>  DataComLookUp;                                     // 0x0088(0x0050)(ExportObject, Transient, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_D8[0x8];                                       // 0x00D8(0x0008)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])

public:
	static bool CheckActorHasTagByStr(class AActor* TargetActor, class FName InTagStr);
	static class UGameLogicTree_EntityMgr* Get(const class UObject* WorldContextObject);
	static float GetLTDataDataAccessorFloatData(struct FLogicTree_DataAccessor* InAccessor, class ULogicTreeNode* FromNode);
	static int32 GetLTDataDataAccessorIntData(struct FLogicTree_DataAccessor* InAccessor, class ULogicTreeNode* FromNode);
	static class UObject* GetLTDataDataAccessorObjData(struct FLogicTree_DataAccessor* InAccessor, class ULogicTreeNode* FromNode);
	static struct FVector GetLTDataDataAccessorVectorData(struct FLogicTree_DataAccessor* InAccessor, class ULogicTreeNode* FromNode);
	static void SetLTDataDataAccessorFloatData(struct FLogicTree_DataAccessor* InAccessor, class ULogicTreeNode* FromNode, float InValue);
	static void SetLTDataDataAccessorIntData(struct FLogicTree_DataAccessor* InAccessor, class ULogicTreeNode* FromNode, int32 InValue);
	static void SetLTDataDataAccessorObjData(struct FLogicTree_DataAccessor* InAccessor, class ULogicTreeNode* FromNode, class UObject* InValue);
	static void SetLTDataDataAccessorVectorData(struct FLogicTree_DataAccessor* InAccessor, class ULogicTreeNode* FromNode, const struct FVector& InValue);
	static void Static_AddTagToActor(class AActor* TargetActor, struct FGameplayTag* InTag);
	static void Static_RemoveActorTag(class AActor* TargetActor, struct FGameplayTag* InTag);
	static void Static_SendLogicTreeMsgToActor(class AActor* TargetActor, struct FLogicTree_MsgContext& Msg);

	void AddTagToActor(class AActor* TargetActor, struct FGameplayTag* InTag);
	class UGameLogicTreeEntity* GetLogicByStrPath(const class FString& InPath);
	struct FLogicTree_LogicHandle InstallLogicTreeEntity(class AActor* OwnerActor, int32 InId, TSubclassOf<class ULogicTree_LogicHandleCom> InHandleComClass, bool bReplicate, bool DefaultActive, bool ExecuteImmediately);
	struct FLogicTree_LogicHandle InstallLogicTreeEntityByObjPath(class AActor* OwnerActor, const struct FSoftObjectPath& InPath, bool bReplicate, bool DefaultActive, bool ExecuteImmediately);
	void RemoveActorTag(class AActor* TargetActor, struct FGameplayTag* InTag);
	void SendLogicTreeMsgToActor(class AActor* TargetActor, struct FLogicTree_MsgContext& Msg);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GameLogicTree_EntityMgr")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GameLogicTree_EntityMgr")
	}
	static class UGameLogicTree_EntityMgr* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameLogicTree_EntityMgr>();
	}
};
DUMPER7_ASSERTS_UGameLogicTree_EntityMgr;

// Class GameLogicTree.GameLogicTreeEntity
// 0x00A8 (0x00D0 - 0x0028)
class UGameLogicTreeEntity final : public UObject
{
public:
	uint8                                         Pad_28[0x18];                                      // 0x0028(0x0018)(Fixing Size After Last Property [ Rei-SdkDumper ])
	class ULogicTree_BlackBoard*                  Blackboard;                                        // 0x0040(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, PersistentInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(bool res)>      OnFinish;                                          // 0x0048(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TArray<class UGameLogic_DataHandler*>         ParallelHandlers;                                  // 0x0058(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class UGameLogic_DataHandler*>         OrderedHandlers;                                   // 0x0068(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	class AActor*                                 Owner;                                             // 0x0078(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ULogicTree_LogicHandleCom*              OwnHandleCom;                                      // 0x0080(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UGameLogicTree_EntityMgr*               OwnMgr;                                            // 0x0088(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 OwnActor;                                          // 0x0090(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_98[0x8];                                       // 0x0098(0x0008)(Fixing Size After Last Property [ Rei-SdkDumper ])
	bool                                          IsRunning;                                         // 0x00A0(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Rei-SdkDumper ])
	class UGameLogicTreeRoot*                     MainRoot;                                          // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UGameLogicTreeRoot*>             SubRoots;                                          // 0x00B0(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	class ULogicTreeMessageBus*                   MessageBus;                                        // 0x00C0(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          HasAuthority;                                      // 0x00C8(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsStandalone;                                      // 0x00C9(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsLocalControl;                                    // 0x00CA(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_CB[0x5];                                       // 0x00CB(0x0005)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])

public:
	void ActivateDataHandlersByTag(const struct FGameplayTag& InTag);
	void DeActivateDataHandlersByTag(const struct FGameplayTag& InTag);
	void FinishLogic();
	void OnLogicEnd();
	void RequestExecute();

	class ULogicTreeMessageBus* GetMessageBus() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GameLogicTreeEntity")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GameLogicTreeEntity")
	}
	static class UGameLogicTreeEntity* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameLogicTreeEntity>();
	}
};
DUMPER7_ASSERTS_UGameLogicTreeEntity;

// Class GameLogicTree.GameLogicTreeRoot
// 0x0020 (0x00C0 - 0x00A0)
class UGameLogicTreeRoot final : public ULogicTreeNode
{
public:
	bool                                          RunOnBegin;                                        // 0x00A0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A1[0x3];                                       // 0x00A1(0x0003)(Fixing Size After Last Property [ Rei-SdkDumper ])
	class FName                                   TreeName;                                          // 0x00A4(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_AC[0x4];                                       // 0x00AC(0x0004)(Fixing Size After Last Property [ Rei-SdkDumper ])
	class ULogicTree_CompositeNode*               RootCompositeNode;                                 // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ULogicTree_CompositeNode*               Child;                                             // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GameLogicTreeRoot")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GameLogicTreeRoot")
	}
	static class UGameLogicTreeRoot* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameLogicTreeRoot>();
	}
};
DUMPER7_ASSERTS_UGameLogicTreeRoot;

// Class GameLogicTree.LogicTree_AddBuffAction
// 0x0018 (0x0048 - 0x0030)
class ULogicTree_AddBuffAction final : public ULogicTree_ActionBase
{
public:
	struct FSoftObjectPath                        BuffPath;                                          // 0x0030(0x0018)(Edit, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("LogicTree_AddBuffAction")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"LogicTree_AddBuffAction")
	}
	static class ULogicTree_AddBuffAction* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULogicTree_AddBuffAction>();
	}
};
DUMPER7_ASSERTS_ULogicTree_AddBuffAction;

// Class GameLogicTree.LogicTree_BindActionToEvent
// 0x0010 (0x00B0 - 0x00A0)
class ULogicTree_BindActionToEvent final : public ULogicTree_TaskNode
{
public:
	TArray<struct FLogicTreeActionBindData>       ActionDatas;                                       // 0x00A0(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, ContainsInstancedReference, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("LogicTree_BindActionToEvent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"LogicTree_BindActionToEvent")
	}
	static class ULogicTree_BindActionToEvent* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULogicTree_BindActionToEvent>();
	}
};
DUMPER7_ASSERTS_ULogicTree_BindActionToEvent;

// Class GameLogicTree.LogicTree_BlackBoard
// 0x00A0 (0x00C8 - 0x0028)
class ULogicTree_BlackBoard final : public UObject
{
public:
	TMap<class FName, struct FLogicTreeBBValue>   ValueMap;                                          // 0x0028(0x0050)(NativeAccessSpecifierPublic)
	TMap<class FName, struct FLogicTree_BBContext> ContextObjectMap;                                 // 0x0078(0x0050)(Transient, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("LogicTree_BlackBoard")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"LogicTree_BlackBoard")
	}
	static class ULogicTree_BlackBoard* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULogicTree_BlackBoard>();
	}
};
DUMPER7_ASSERTS_ULogicTree_BlackBoard;

// Class GameLogicTree.LogicTree_ChangeAttrAction
// 0x00F0 (0x0120 - 0x0030)
class ULogicTree_ChangeAttrAction final : public ULogicTree_ActionBase
{
public:
	struct FGameLogicTree_AttributeAccessor       Data1;                                             // 0x0030(0x0050)(Edit, DisableEditOnInstance, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FGameLogicTree_AttributeAccessor       Data2;                                             // 0x0080(0x0050)(Edit, DisableEditOnInstance, ContainsInstancedReference, NativeAccessSpecifierPublic)
	EGameLogicTreeAction                          Action;                                            // 0x00D0(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Rei-SdkDumper ])
	struct FLogicTree_DataAccessor                ResDataAccessor;                                   // 0x00D8(0x0038)(Edit, DisableEditOnInstance, ContainsInstancedReference, NativeAccessSpecifierPublic)
	ESetAttributeType                             SetAttrType;                                       // 0x0110(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bResetByCacheVal;                                  // 0x0111(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_112[0x2];                                      // 0x0112(0x0002)(Fixing Size After Last Property [ Rei-SdkDumper ])
	float                                         CacheChangeVal;                                    // 0x0114(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ValidCacheChangeVal;                               // 0x0118(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          OnlyExecuteAtAuthority;                            // 0x011C(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCacheValidChangeValToBB;                          // 0x011D(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11E[0x2];                                      // 0x011E(0x0002)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("LogicTree_ChangeAttrAction")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"LogicTree_ChangeAttrAction")
	}
	static class ULogicTree_ChangeAttrAction* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULogicTree_ChangeAttrAction>();
	}
};
DUMPER7_ASSERTS_ULogicTree_ChangeAttrAction;

// Class GameLogicTree.LogicTree_ChangeAttributeNode
// 0x0010 (0x00B0 - 0x00A0)
class ULogicTree_ChangeAttributeNode final : public ULogicTree_TaskNode
{
public:
	class ULogicTree_ChangeAttrAction*            Action;                                            // 0x00A0(0x0008)(Edit, ExportObject, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_A8[0x8];                                       // 0x00A8(0x0008)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("LogicTree_ChangeAttributeNode")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"LogicTree_ChangeAttributeNode")
	}
	static class ULogicTree_ChangeAttributeNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULogicTree_ChangeAttributeNode>();
	}
};
DUMPER7_ASSERTS_ULogicTree_ChangeAttributeNode;

// Class GameLogicTree.LogicTree_DoAction
// 0x0010 (0x00B0 - 0x00A0)
class ULogicTree_DoAction final : public ULogicTree_TaskNode
{
public:
	class ULogicTree_ActionBase*                  Action;                                            // 0x00A0(0x0008)(Edit, ExportObject, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          isOneExecute;                                      // 0x00A8(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("LogicTree_DoAction")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"LogicTree_DoAction")
	}
	static class ULogicTree_DoAction* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULogicTree_DoAction>();
	}
};
DUMPER7_ASSERTS_ULogicTree_DoAction;

// Class GameLogicTree.LogicTree_DoActionList
// 0x0018 (0x00B8 - 0x00A0)
class ULogicTree_DoActionList final : public ULogicTree_TaskNode
{
public:
	TArray<class ULogicTree_ActionBase*>          actions;                                           // 0x00A0(0x0010)(Edit, ExportObject, ZeroConstructor, DisableEditOnInstance, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	bool                                          isOneExecute;                                      // 0x00B0(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("LogicTree_DoActionList")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"LogicTree_DoActionList")
	}
	static class ULogicTree_DoActionList* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULogicTree_DoActionList>();
	}
};
DUMPER7_ASSERTS_ULogicTree_DoActionList;

// Class GameLogicTree.LogicTreeMessageBus
// 0x00F8 (0x0120 - 0x0028)
class ULogicTreeMessageBus final : public UObject
{
public:
	uint8                                         Pad_28[0x58];                                      // 0x0028(0x0058)(Fixing Size After Last Property [ Rei-SdkDumper ])
	TMap<struct FGameplayTag, struct FLogicTree_MsgContext> CachedMessages;                          // 0x0080(0x0050)(Transient, NativeAccessSpecifierPrivate)
	TMap<struct FGameplayTag, TMulticastInlineDelegate<void()>> DynamicDelegates;                    // 0x00D0(0x0050)(Transient, ContainsInstancedReference, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("LogicTreeMessageBus")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"LogicTreeMessageBus")
	}
	static class ULogicTreeMessageBus* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULogicTreeMessageBus>();
	}
};
DUMPER7_ASSERTS_ULogicTreeMessageBus;

// Class GameLogicTree.LogicTree_PlayWwiseAction
// 0x0050 (0x0080 - 0x0030)
class ULogicTree_PlayWwiseAction final : public ULogicTree_ActionBase
{
public:
	class FString                                 WwiseKey;                                          // 0x0030(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          is2DAudio;                                         // 0x0040(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          needCacheWwiseCom;                                 // 0x0041(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_42[0x6];                                       // 0x0042(0x0006)(Fixing Size After Last Property [ Rei-SdkDumper ])
	struct FLogicTree_DataAccessor                WwiseDataAccessor;                                 // 0x0048(0x0038)(Edit, ContainsInstancedReference, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("LogicTree_PlayWwiseAction")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"LogicTree_PlayWwiseAction")
	}
	static class ULogicTree_PlayWwiseAction* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULogicTree_PlayWwiseAction>();
	}
};
DUMPER7_ASSERTS_ULogicTree_PlayWwiseAction;

// Class GameLogicTree.LogicTree_SequenceNode
// 0x0008 (0x00C0 - 0x00B8)
class ULogicTree_SequenceNode final : public ULogicTree_CompositeNode
{
public:
	class ULogicTreeNode*                         JumpTickNode;                                      // 0x00B8(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("LogicTree_SequenceNode")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"LogicTree_SequenceNode")
	}
	static class ULogicTree_SequenceNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULogicTree_SequenceNode>();
	}
};
DUMPER7_ASSERTS_ULogicTree_SequenceNode;

// Class GameLogicTree.LogicTree_SimpleParallel
// 0x0000 (0x00B8 - 0x00B8)
class ULogicTree_SimpleParallel final : public ULogicTree_CompositeNode
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("LogicTree_SimpleParallel")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"LogicTree_SimpleParallel")
	}
	static class ULogicTree_SimpleParallel* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULogicTree_SimpleParallel>();
	}
};
DUMPER7_ASSERTS_ULogicTree_SimpleParallel;

// Class GameLogicTree.LogicTree_SpawnActorAction
// 0x0008 (0x0080 - 0x0078)
class ULogicTree_SpawnActorAction final : public ULogicTree_SpawnAction
{
public:
	TSubclassOf<class AActor>                     TargetClass;                                       // 0x0078(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("LogicTree_SpawnActorAction")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"LogicTree_SpawnActorAction")
	}
	static class ULogicTree_SpawnActorAction* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULogicTree_SpawnActorAction>();
	}
};
DUMPER7_ASSERTS_ULogicTree_SpawnActorAction;

// Class GameLogicTree.LogicTree_StopWwiseAction
// 0x0038 (0x0068 - 0x0030)
class ULogicTree_StopWwiseAction final : public ULogicTree_ActionBase
{
public:
	struct FLogicTree_DataAccessor                WwiseDataAccessor;                                 // 0x0030(0x0038)(Edit, ContainsInstancedReference, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("LogicTree_StopWwiseAction")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"LogicTree_StopWwiseAction")
	}
	static class ULogicTree_StopWwiseAction* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULogicTree_StopWwiseAction>();
	}
};
DUMPER7_ASSERTS_ULogicTree_StopWwiseAction;

// Class GameLogicTree.LogicTree_TaskNode_BP
// 0x0000 (0x00A0 - 0x00A0)
class ULogicTree_TaskNode_BP final : public ULogicTree_TaskNode
{
public:
	ELogicTreeNodeStatus ExecuteBP(class ULogicTree_BlackBoard* TargetBlackBoard);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("LogicTree_TaskNode_BP")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"LogicTree_TaskNode_BP")
	}
	static class ULogicTree_TaskNode_BP* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULogicTree_TaskNode_BP>();
	}
};
DUMPER7_ASSERTS_ULogicTree_TaskNode_BP;

// Class GameLogicTree.LogicTree_WaitTask
// 0x0048 (0x00E8 - 0x00A0)
class ULogicTree_WaitTask final : public ULogicTree_TaskNode
{
public:
	bool                                          isUseCustomVal;                                    // 0x00A0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_A1[0x3];                                       // 0x00A1(0x0003)(Fixing Size After Last Property [ Rei-SdkDumper ])
	float                                         WaitTime;                                          // 0x00A4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FLogicTree_DataAccessor                DataAccessor;                                      // 0x00A8(0x0038)(Edit, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	uint8                                         Pad_E0[0x8];                                       // 0x00E0(0x0008)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("LogicTree_WaitTask")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"LogicTree_WaitTask")
	}
	static class ULogicTree_WaitTask* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULogicTree_WaitTask>();
	}
};
DUMPER7_ASSERTS_ULogicTree_WaitTask;

// Class GameLogicTree.NodeExecuteHelper
// 0x0000 (0x0028 - 0x0028)
class UNodeExecuteHelper final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NodeExecuteHelper")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NodeExecuteHelper")
	}
	static class UNodeExecuteHelper* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNodeExecuteHelper>();
	}
};
DUMPER7_ASSERTS_UNodeExecuteHelper;

// Class GameLogicTree.LT_Decorator_CheckContextArrayContainsObj
// 0x0070 (0x00A8 - 0x0038)
class ULT_Decorator_CheckContextArrayContainsObj final : public ULogicTree_Decorator
{
public:
	struct FLogicTree_DataAccessor                CheckObj;                                          // 0x0038(0x0038)(Edit, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FLogicTree_DataAccessor                CheckContext;                                      // 0x0070(0x0038)(Edit, ContainsInstancedReference, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("LT_Decorator_CheckContextArrayContainsObj")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"LT_Decorator_CheckContextArrayContainsObj")
	}
	static class ULT_Decorator_CheckContextArrayContainsObj* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULT_Decorator_CheckContextArrayContainsObj>();
	}
};
DUMPER7_ASSERTS_ULT_Decorator_CheckContextArrayContainsObj;

// Class GameLogicTree.LT_Decorator_CheckContextObjAngleWithOwner
// 0x0040 (0x0078 - 0x0038)
class ULT_Decorator_CheckContextObjAngleWithOwner final : public ULogicTree_Decorator
{
public:
	float                                         AngleMin;                                          // 0x0038(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AngleMax;                                          // 0x003C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLogicTree_DataAccessor                TargetActor;                                       // 0x0040(0x0038)(Edit, ContainsInstancedReference, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("LT_Decorator_CheckContextObjAngleWithOwner")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"LT_Decorator_CheckContextObjAngleWithOwner")
	}
	static class ULT_Decorator_CheckContextObjAngleWithOwner* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULT_Decorator_CheckContextObjAngleWithOwner>();
	}
};
DUMPER7_ASSERTS_ULT_Decorator_CheckContextObjAngleWithOwner;

// Class GameLogicTree.LT_Decorator_CheckContextObjDisSqWithOwner
// 0x0078 (0x00B0 - 0x0038)
class ULT_Decorator_CheckContextObjDisSqWithOwner final : public ULogicTree_Decorator
{
public:
	struct FLogicTree_DataAccessor                TargetActor;                                       // 0x0038(0x0038)(Edit, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FLogicTree_DataAccessor                CheckDisSq;                                        // 0x0070(0x0038)(Edit, ContainsInstancedReference, NativeAccessSpecifierPublic)
	ELTDecorator_CompareOperation                 CheckOperation;                                    // 0x00A8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("LT_Decorator_CheckContextObjDisSqWithOwner")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"LT_Decorator_CheckContextObjDisSqWithOwner")
	}
	static class ULT_Decorator_CheckContextObjDisSqWithOwner* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULT_Decorator_CheckContextObjDisSqWithOwner>();
	}
};
DUMPER7_ASSERTS_ULT_Decorator_CheckContextObjDisSqWithOwner;

// Class GameLogicTree.LT_Decorator_CheckContextObjHeightOffsetWithOwner
// 0x0040 (0x0078 - 0x0038)
class ULT_Decorator_CheckContextObjHeightOffsetWithOwner final : public ULogicTree_Decorator
{
public:
	float                                         HeightOffsetMin;                                   // 0x0038(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         HeightOffsetMax;                                   // 0x003C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLogicTree_DataAccessor                TargetActor;                                       // 0x0040(0x0038)(Edit, ContainsInstancedReference, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("LT_Decorator_CheckContextObjHeightOffsetWithOwner")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"LT_Decorator_CheckContextObjHeightOffsetWithOwner")
	}
	static class ULT_Decorator_CheckContextObjHeightOffsetWithOwner* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULT_Decorator_CheckContextObjHeightOffsetWithOwner>();
	}
};
DUMPER7_ASSERTS_ULT_Decorator_CheckContextObjHeightOffsetWithOwner;

// Class GameLogicTree.LT_Decorator_CompareFloatData
// 0x0078 (0x00B0 - 0x0038)
class ULT_Decorator_CompareFloatData final : public ULogicTree_Decorator
{
public:
	struct FLogicTree_DataAccessor                DataA;                                             // 0x0038(0x0038)(Edit, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FLogicTree_DataAccessor                DataB;                                             // 0x0070(0x0038)(Edit, ContainsInstancedReference, NativeAccessSpecifierPublic)
	ELTDecorator_CompareOperation                 Operation;                                         // 0x00A8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("LT_Decorator_CompareFloatData")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"LT_Decorator_CompareFloatData")
	}
	static class ULT_Decorator_CompareFloatData* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULT_Decorator_CompareFloatData>();
	}
};
DUMPER7_ASSERTS_ULT_Decorator_CompareFloatData;

// Class GameLogicTree.LT_Decorator_CompareIntData
// 0x0078 (0x00B0 - 0x0038)
class ULT_Decorator_CompareIntData final : public ULogicTree_Decorator
{
public:
	struct FLogicTree_DataAccessor                DataA;                                             // 0x0038(0x0038)(Edit, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FLogicTree_DataAccessor                DataB;                                             // 0x0070(0x0038)(Edit, ContainsInstancedReference, NativeAccessSpecifierPublic)
	ELTDecorator_CompareOperation                 Operation;                                         // 0x00A8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("LT_Decorator_CompareIntData")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"LT_Decorator_CompareIntData")
	}
	static class ULT_Decorator_CompareIntData* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULT_Decorator_CompareIntData>();
	}
};
DUMPER7_ASSERTS_ULT_Decorator_CompareIntData;

// Class GameLogicTree.LT_Decorator_TriggerOnMsg
// 0x0050 (0x0108 - 0x00B8)
class ULT_Decorator_TriggerOnMsg final : public ULogicTree_CompositeNode
{
public:
	struct FGameplayTag                           TriggerMsgTag;                                     // 0x00B8(0x0008)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          CanFinish;                                         // 0x00C0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          CanReExecuteRunningChild;                          // 0x00C1(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C2[0x2];                                       // 0x00C2(0x0002)(Fixing Size After Last Property [ Rei-SdkDumper ])
	int32                                         NeedChildFinishNum;                                // 0x00C4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          CacheContext;                                      // 0x00C8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCacheByValue;                                     // 0x00C9(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCheckByData;                                      // 0x00CA(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_CB[0x5];                                       // 0x00CB(0x0005)(Fixing Size After Last Property [ Rei-SdkDumper ])
	TArray<struct FLogicTree_MsgConditionCheck>   CheckDataInt;                                      // 0x00D0(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_E0[0x10];                                      // 0x00E0(0x0010)(Fixing Size After Last Property [ Rei-SdkDumper ])
	class ULogicTreeNode*                         CacheChild;                                        // 0x00F0(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_F8[0x10];                                      // 0x00F8(0x0010)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])

public:
	void OnReceiveLogicMsg(const struct FLogicTree_MsgContext& Msg);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("LT_Decorator_TriggerOnMsg")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"LT_Decorator_TriggerOnMsg")
	}
	static class ULT_Decorator_TriggerOnMsg* GetDefaultObj()
