#pragma once

/*
* SDK generated by Rei-SdkDumper
* Based on Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GameCore

#include "Basic.hpp"

#include "GameCore_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// Class GameCore.DoTweenSystem
// 0x0068 (0x0098 - 0x0030)
class UDoTweenSystem final : public UWorldSubsystem
{
public:
	uint8                                         Pad_30[0x68];                                      // 0x0030(0x0068)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])

public:
	void Kill(int32 InId, bool InComplete);
	int32 Play(EDoTweenType InType, class UCurveBase* InCurveId, class UWidget* InWidget, const struct FVector2D& ControlPoint, float InDuration, int32 looptime, float Multiplier);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DoTweenSystem")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DoTweenSystem")
	}
	static class UDoTweenSystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDoTweenSystem>();
	}
};
DUMPER7_ASSERTS_UDoTweenSystem;

// Class GameCore.GameCoreLibrary
// 0x0000 (0x0028 - 0x0028)
class UGameCoreLibrary final : public UBlueprintFunctionLibrary
{
public:
	static class UObject* DuplicateObject(class UObject* InSrcObject, class UObject* InNewOuter);
	static void ExploreFolder(const class FString& InPath);
	static struct FVector2D GetAbsolutePosition(const struct FGeometry& InGeometry);
	static class FString GetFixLang(const class FString& InLang);
	static int32 GetGameInstanceIndex();
	static class FString GetLocalIpAddress();
	static float GetRealTimeDelta(const class UObject* WorldContextObject, float InDeltaTime);
	static class UClass* LoadUClass(const struct FSoftClassPath& InPath);
	static class UClass* LoadUClassByPath(const class FString& InPath);
	static class UUserWidget* LoadUI(const class UObject* WorldContextObject, const class FName& InPath, class FName WidgetName);
	static class UObject* LoadUObject(const struct FSoftObjectPath& InPath);
	static class UObject* LoadUObjectByPath(const class FString& InPath);
	static class FString ProcessLangText(const class FString& InContent, const class FString& InPlayerName);
	static class FString RoleToString(ENetRole InRole);
	static struct FLinearColor String2LinearColor(const class FString& InColor);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GameCoreLibrary")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GameCoreLibrary")
	}
	static class UGameCoreLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameCoreLibrary>();
	}
};
DUMPER7_ASSERTS_UGameCoreLibrary;

// Class GameCore.GameCoreSystem
// 0x0210 (0x0240 - 0x0030)
class UGameCoreSystem final : public UGameInstanceSubsystem
{
public:
	uint8                                         Pad_30[0x210];                                     // 0x0030(0x0210)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])

public:
	static class UGameCoreSystem* Get(class UObject* InWorldContext);
	static bool GetLastInputType();
	static void SwitchDeviceEventNotice(const bool InOpen);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GameCoreSystem")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GameCoreSystem")
	}
	static class UGameCoreSystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameCoreSystem>();
	}
};
DUMPER7_ASSERTS_UGameCoreSystem;

// Class GameCore.GameCoreWidget
// 0x0048 (0x02C8 - 0x0280)
class UGameCoreWidget : public UUserWidget
{
public:
	uint8                                         Pad_280[0x8];                                      // 0x0280(0x0008)(Fixing Size After Last Property [ Rei-SdkDumper ])
	TArray<struct FSoftClassPath>                 StreamingClasses;                                  // 0x0288(0x0010)(Edit, ZeroConstructor, AdvancedDisplay, NativeAccessSpecifierPublic)
	TArray<struct FSoftObjectPath>                StreamingObjects;                                  // 0x0298(0x0010)(Edit, ZeroConstructor, AdvancedDisplay, NativeAccessSpecifierPublic)
	bool                                          bAutoStreaming;                                    // 0x02A8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2A9[0x7];                                      // 0x02A9(0x0007)(Fixing Size After Last Property [ Rei-SdkDumper ])
	TArray<struct FAnimControl>                   AnimControlList;                                   // 0x02B0(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C0[0x8];                                      // 0x02C0(0x0008)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])

public:
	void ListenForInputActionIgnorePause(class FName ActionName, EInputEvent EventType, bool bConsume, TDelegate<void()> Callback);
	void PalyAnimByName(const class FString& InName);
	void PlayDefaultAnim();
	void PlayOpenAnimation();
	void StreamingWidget();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GameCoreWidget")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GameCoreWidget")
	}
	static class UGameCoreWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameCoreWidget>();
	}
};
DUMPER7_ASSERTS_UGameCoreWidget;

}

