#pragma once

/*
* SDK generated by Rei-SdkDumper
* Based on Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GameCore

#include "Basic.hpp"


namespace SDK
{

// Enum GameCore.EDoTweenType
// NumValues: 0x0006
enum class EDoTweenType : uint8
{
	None                                     = 0,
	LocalMove                                = 1,
	LocalMoveRelative                        = 2,
	LocalScale                               = 3,
	Shake                                    = 4,
	EDoTweenType_MAX                         = 5,
};

// Enum GameCore.EWidgetChangeType
// NumValues: 0x0004
enum class EWidgetChangeType : uint8
{
	ON_Open                                  = 0,
	ON_Display                               = 1,
	ON_Hidden                                = 2,
	ON_MAX                                   = 3,
};

// ScriptStruct GameCore.TemplateId
// 0x0010 (0x0010 - 0x0000)
struct FTemplateId final
{
public:
	int32                                         Genre;                                             // 0x0000(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Detail;                                            // 0x0004(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Particular;                                        // 0x0008(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Level;                                             // 0x000C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FTemplateId;

// ScriptStruct GameCore.AnimControl
// 0x0030 (0x0030 - 0x0000)
struct FAnimControl final
{
public:
	class FString                                 WidgetName;                                        // 0x0000(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EWidgetChangeType                             Type;                                              // 0x0010(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Rei-SdkDumper ])
	class FString                                 AnimName;                                          // 0x0018(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Loop;                                              // 0x0028(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_FAnimControl;

}

