#pragma once

/*
* SDK generated by Rei-SdkDumper
* Based on Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HotPatch

#include "Basic.hpp"


namespace SDK
{

// Enum HotPatch.EResPublishType
// NumValues: 0x000B
enum class EResPublishType : uint8
{
	None                                     = 0,
	Starter                                  = 1,
	Starter_wwise_chinese                    = 2,
	Starter_wwise_english                    = 3,
	Starter_wwise_japanese                   = 4,
	Starter_wwise_korean                     = 5,
	wwise_chinese                            = 11,
	wwise_english                            = 12,
	wwise_japanese                           = 13,
	wwise_korean                             = 14,
	EResPublishType_MAX                      = 15,
};

// Enum HotPatch.EHotPatchErrCode
// NumValues: 0x000D
enum class EHotPatchErrCode : uint8
{
	None                                     = 0,
	BadConfiguration                         = 1,
	NetworkUnavailable                       = 2,
	DownloadManifestFailed                   = 3,
	NeedUpgrade                              = 4,
	DownloadUpdatesFailed                    = 5,
	SaveFileFailed                           = 6,
	GetDiskFreeSpaceFailed                   = 7,
	DiskFreeSpaceNotEnough                   = 8,
	MergeFileFailed                          = 9,
	VerifyFileFailed                         = 10,
	MoveFileFailed                           = 11,
	EHotPatchErrCode_MAX                     = 12,
};

// Enum HotPatch.EHotPatchStage
// NumValues: 0x000A
enum class EHotPatchStage : uint8
{
	None                                     = 0,
	FetchCDN                                 = 1,
	ReadingManifest                          = 2,
	Calculating                              = 3,
	Verifing                                 = 4,
	FetchingUpdates                          = 5,
	Mounting                                 = 6,
	Moving                                   = 7,
	Done                                     = 8,
	EHotPatchStage_MAX                       = 9,
};

// ScriptStruct HotPatch.HotPatchAsset
// 0x0058 (0x0058 - 0x0000)
struct FHotPatchAsset final
{
public:
	class FString                                 Name;                                              // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Hash;                                              // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                         SizeInBytes;                                       // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bPrimary;                                          // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Rei-SdkDumper ])
	class FString                                 Base;                                              // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Diff;                                              // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                         DiffSizeBytes;                                     // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FHotPatchAsset;

// ScriptStruct HotPatch.HotPatchAssetManifest
// 0x0048 (0x0048 - 0x0000)
struct FHotPatchAssetManifest final
{
public:
	class FString                                 Version;                                           // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ProjectVersion;                                    // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 PathOffset;                                        // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUserCache;                                        // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Rei-SdkDumper ])
	TArray<struct FHotPatchAsset>                 Paks;                                              // 0x0038(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FHotPatchAssetManifest;

// ScriptStruct HotPatch.HotPatchCDNList
// 0x0010 (0x0010 - 0x0000)
struct FHotPatchCDNList final
{
public:
	TArray<class FString>                         Urls;                                              // 0x0000(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FHotPatchCDNList;

// ScriptStruct HotPatch.HotPatchDebug
// 0x0028 (0x0028 - 0x0000)
struct FHotPatchDebug final
{
public:
	bool                                          bDisableHotPatch;                                  // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIgnoreAppVersion;                                 // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Rei-SdkDumper ])
	class FString                                 DebugFileServer;                                   // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ServerListUrl;                                     // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FHotPatchDebug;

}

