#pragma once

/*
* SDK generated by Rei-SdkDumper
* Based on Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HouseNpcAnimBase

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "SeasunAnimGraph_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass HouseNpcAnimBase.HouseNpcAnimBase_C
// 0x5000 (0x56C0 - 0x06C0)
class UHouseNpcAnimBase_C : public UHouseCharacterAnimIns
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x06C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_3;                   // 0x06C8(0x0118)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_10;                   // 0x07E0(0x0158)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_9;                    // 0x0938(0x0158)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_1;                 // 0x0A90(0x0050)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_28;                    // 0x0AE0(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_8;                   // 0x0B08(0x00A0)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator;                   // 0x0BA8(0x0050)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_8;                    // 0x0BF8(0x0158)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_2;                     // 0x0D50(0x00C8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_27;                    // 0x0E18(0x0028)()
	struct FAnimNode_TwoBoneIK                    AnimGraphNode_TwoBoneIK_2;                         // 0x0E40(0x01E0)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_11;            // 0x1020(0x0020)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_26;                    // 0x1040(0x0028)()
	struct FAnimNode_CopyBone                     AnimGraphNode_CopyBone;                            // 0x1068(0x00F0)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_10;                 // 0x1158(0x00C0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_25;                    // 0x1218(0x0028)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_1;                     // 0x1240(0x00C8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_24;                    // 0x1308(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_23;                    // 0x1330(0x0028)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_9;                  // 0x1358(0x00C0)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_8;                  // 0x1418(0x00C0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_22;                    // 0x14D8(0x0028)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_7;                  // 0x1500(0x00C0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_21;                    // 0x15C0(0x0028)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_11;            // 0x15E8(0x0020)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_6;                  // 0x1608(0x00C0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_7;                    // 0x16C8(0x0158)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_6;                    // 0x1820(0x0158)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_20;                    // 0x1978(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_19;                    // 0x19A0(0x0028)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_5;                    // 0x19C8(0x0158)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_18;                    // 0x1B20(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_17;                    // 0x1B48(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_16;                    // 0x1B70(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_15;                    // 0x1B98(0x0028)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_4;                        // 0x1BC0(0x0108)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_5;                  // 0x1CC8(0x00C0)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_4;                  // 0x1D88(0x00C0)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_3;                        // 0x1E48(0x0108)()
	struct FAnimNode_Root                         AnimGraphNode_Root_4;                              // 0x1F50(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_2;                   // 0x1F80(0x0118)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_10;            // 0x2098(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_10;            // 0x20B8(0x0020)()
	struct FAnimNode_Inertialization              AnimGraphNode_Inertialization_1;                   // 0x20D8(0x0070)()
	uint8                                         Pad_2148[0x8];                                     // 0x2148(0x0008)(Fixing Size After Last Property [ Rei-SdkDumper ])
	struct FAnimNode_TwoBoneIK                    AnimGraphNode_TwoBoneIK_1;                         // 0x2150(0x01E0)()
	struct FAnimNode_TwoBoneIK                    AnimGraphNode_TwoBoneIK;                           // 0x2330(0x01E0)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_7;                   // 0x2510(0x00A0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_4;                    // 0x25B0(0x0158)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_14;                    // 0x2708(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_13;                    // 0x2730(0x0028)()
	struct FAnimNode_SkeletalRotateSpine          AnimGraphNode_SkeletalRotateSpine_5;               // 0x2758(0x0110)()
	struct FAnimNode_Root                         AnimGraphNode_Root_3;                              // 0x2868(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_1;                   // 0x2898(0x0118)()
	struct FAnimNode_RefPose                      AnimGraphNode_LocalRefPose_1;                      // 0x29B0(0x0018)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_3;                  // 0x29C8(0x00C0)()
	struct FAnimNode_RefPose                      AnimGraphNode_LocalRefPose;                        // 0x2A88(0x0018)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_2;                  // 0x2AA0(0x00C0)()
	struct FAnimNode_Root                         AnimGraphNode_Root_2;                              // 0x2B60(0x0030)()
	struct FAnimNode_SkeletalRotateSpine          AnimGraphNode_SkeletalRotateSpine_4;               // 0x2B90(0x0110)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_9;             // 0x2CA0(0x0020)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_9;             // 0x2CC0(0x0020)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_3;                              // 0x2CE0(0x0048)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_2;                              // 0x2D28(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x2D70(0x0080)()
	struct FAnimNode_ApplyMeshSpaceAdditive       AnimGraphNode_ApplyMeshSpaceAdditive;              // 0x2DF0(0x00D0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_3;                    // 0x2EC0(0x0158)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_12;                    // 0x3018(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_6;                   // 0x3040(0x00A0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_11;                    // 0x30E0(0x0028)()
	struct FAnimNode_Inertialization              AnimGraphNode_Inertialization;                     // 0x3108(0x0070)()
	struct FAnimNode_Root                         AnimGraphNode_Root_1;                              // 0x3178(0x0030)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_8;             // 0x31A8(0x0020)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_10;                    // 0x31C8(0x0028)()
	struct FAnimNode_BSPlayerWithRefBS            AnimGraphNode_BSPlayerWithRefBS;                   // 0x31F0(0x00F0)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive;                       // 0x32E0(0x00C8)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_2;                    // 0x33A8(0x0158)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_9;                     // 0x3500(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_8;                     // 0x3528(0x0028)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_7;             // 0x3550(0x0020)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_1;                  // 0x3570(0x00C0)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_8;             // 0x3630(0x0020)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_2;                        // 0x3650(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_1;                        // 0x3758(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone;                          // 0x3860(0x0108)()
	struct FAnimNode_SkeletalRotateSpine          AnimGraphNode_SkeletalRotateSpine_3;               // 0x3968(0x0110)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_7;             // 0x3A78(0x0020)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_7;                     // 0x3A98(0x0028)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_6;             // 0x3AC0(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_5;             // 0x3AE0(0x0020)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_6;             // 0x3B00(0x0020)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_5;                   // 0x3B20(0x00A0)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x3BC0(0x0118)()
	struct FAnimNode_SaveBoneTransform            AnimGraphNode_SaveBoneTransform_1;                 // 0x3CD8(0x0150)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_5;             // 0x3E28(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_4;             // 0x3E48(0x0020)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_4;                   // 0x3E68(0x00A0)()
	struct FAnimNode_SkeletalRotateSpine          AnimGraphNode_SkeletalRotateSpine_2;               // 0x3F08(0x0110)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_4;             // 0x4018(0x0020)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_6;                     // 0x4038(0x0028)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_3;             // 0x4060(0x0020)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend;                    // 0x4080(0x00C0)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_3;                   // 0x4140(0x00A0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_1;                    // 0x41E0(0x0158)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_5;                     // 0x4338(0x0028)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_1;                              // 0x4360(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_4;                     // 0x43A8(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_3;                     // 0x43D0(0x0028)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_3;             // 0x43F8(0x0020)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_2;                   // 0x4418(0x00A0)()
	struct FAnimNode_SaveBoneTransform            AnimGraphNode_SaveBoneTransform;                   // 0x44B8(0x0150)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_2;             // 0x4608(0x0020)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_2;             // 0x4628(0x0020)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0x4648(0x0158)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_2;                     // 0x47A0(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_1;                     // 0x47C8(0x0028)()
	struct FAnimNode_SkeletalRotateSpine          AnimGraphNode_SkeletalRotateSpine_1;               // 0x47F0(0x0110)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_1;             // 0x4900(0x0020)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0x4920(0x0028)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_1;             // 0x4948(0x0020)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_1;                   // 0x4968(0x00A0)()
	struct FAnimNode_SkeletalRotateSpine          AnimGraphNode_SkeletalRotateSpine;                 // 0x4A08(0x0110)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x4B18(0x00A0)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x4BB8(0x0030)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x4BE8(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x4C08(0x0020)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_3;                   // 0x4C28(0x00B0)()
	uint8                                         Pad_4CD8[0x8];                                     // 0x4CD8(0x0008)(Fixing Size After Last Property [ Rei-SdkDumper ])
	struct FAnimNode_RigidBody                    AnimGraphNode_RigidBody;                           // 0x4CE0(0x0650)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_2;                   // 0x5330(0x00B0)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_1;                   // 0x53E0(0x00B0)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x5490(0x0048)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer;                     // 0x54D8(0x00B0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x5588(0x0080)()
	bool                                          K2Node_PropertyAccess_0;                           // 0x5608(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5609[0x3];                                     // 0x5609(0x0003)(Fixing Size After Last Property [ Rei-SdkDumper ])
	float                                         TurnYawCurveValue;                                 // 0x560C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         AccumulateCurveValue;                              // 0x5610(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DiffCurveValue;                                    // 0x5614(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RotationScale;                                     // 0x5618(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RoationAngle;                                      // 0x561C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsNpc;                                             // 0x5620(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5621[0x3];                                     // 0x5621(0x0003)(Fixing Size After Last Property [ Rei-SdkDumper ])
	class FName                                   CheckStandName;                                    // 0x5624(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CheckStandBone;                                    // 0x562C(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         NeckCustomScale;                                   // 0x5634(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          UseCustomCheckStandName;                           // 0x5638(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5639[0x3];                                     // 0x5639(0x0003)(Fixing Size After Last Property [ Rei-SdkDumper ])
	struct FVector                                LAimPos;                                           // 0x563C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RAimPos;                                           // 0x5648(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RightVec;                                          // 0x5654(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                LHand;                                             // 0x5660(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Rhand;                                             // 0x566C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         AccCur;                                            // 0x5678(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                JointLeft;                                         // 0x567C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                JointRight;                                        // 0x5688(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsKiddle;                                          // 0x5694(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          UseNewBoneNeck;                                    // 0x5695(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          OnlyTurnHead;                                      // 0x5696(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5697[0x1];                                     // 0x5697(0x0001)(Fixing Size After Last Property [ Rei-SdkDumper ])
	class UAnimSequenceBase*                      Sequence_Additive;                                 // 0x5698(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Cup;                                               // 0x56A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsHandMatching;                                    // 0x56A4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_56A5[0x3];                                     // 0x56A5(0x0003)(Fixing Size After Last Property [ Rei-SdkDumper ])
	class UAnimSequenceBase*                      Sequence_NoAdditive;                               // 0x56A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      DefaultSeq;                                        // 0x56B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void HandMatching(const struct FPoseLink& InPose_0, struct FPoseLink* HandMatching_0);
	void FurnitureInteract(const struct FPoseLink& InMontagePose, struct FPoseLink* FurnitureInteract_0);
	void ForbiddenBreastAnimLayer(const struct FPoseLink& BreastAnim_Input, struct FPoseLink* ForbiddenBreastAnimLayer_0);
	void TurnHead(const struct FPoseLink& InPose, struct FPoseLink* TurnHead_0);
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void ProcessTurnYawCurve();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_HouseNpcAnimBase_AnimGraphNode_BlendListByBool_8235BB0D4AD855B64F641F8AACCE0742();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_HouseNpcAnimBase_AnimGraphNode_ModifyBone_F611CAA142972785BE993797BDE3F3B7();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_HouseNpcAnimBase_AnimGraphNode_ModifyBone_5268B09D4D521A8D07535DB818B9D217();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_HouseNpcAnimBase_AnimGraphNode_ModifyBone_5656939442EA4FA3BE54499C2C8B4A8C();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_HouseNpcAnimBase_AnimGraphNode_LayeredBoneBlend_BB8D4F094A5F4BE637B1B3BC49FEBF2E();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_HouseNpcAnimBase_AnimGraphNode_LayeredBoneBlend_2B650E674D09C111615056891C2913CD();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_HouseNpcAnimBase_AnimGraphNode_ModifyBone_5F9396404F15A54C6AB9E6BD65CF1E3C();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_HouseNpcAnimBase_AnimGraphNode_LayeredBoneBlend_9F200CA5483DD5BE0F7D83B2DA68D44B();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_HouseNpcAnimBase_AnimGraphNode_LayeredBoneBlend_BE31C6CF45FF944F6AC72F99EACB31A7();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_HouseNpcAnimBase_AnimGraphNode_ModifyBone_E53A3C2346DB921826DC91AF867C3996();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_HouseNpcAnimBase_AnimGraphNode_LayeredBoneBlend_439E010C411EBA6FA9974E9F437133FF();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_HouseNpcAnimBase_AnimGraphNode_LayeredBoneBlend_7E62977E4CA55A4E4CCC5A989A2CC536();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_HouseNpcAnimBase_AnimGraphNode_LayeredBoneBlend_7AE1E34C484363F1293A629181A0245A();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_HouseNpcAnimBase_AnimGraphNode_LayeredBoneBlend_B093E3464943500F7D7E6DBE95687290();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_HouseNpcAnimBase_AnimGraphNode_LayeredBoneBlend_DFF64139451D51FB15897C9A2EA897BC();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_HouseNpcAnimBase_AnimGraphNode_CopyBone_95F38027467E5E3B7820958CF1BFCA7E();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_HouseNpcAnimBase_AnimGraphNode_TwoBoneIK_7F70CCCB48C7A752E48EB4992F732A96();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_HouseNpcAnimBase_AnimGraphNode_SequenceEvaluator_029B12EE4BA126C0E70AE9A96C08C4C9();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_HouseNpcAnimBase_AnimGraphNode_SequenceEvaluator_66ED8E2C43C9F5D6567992BB095DDB76();
	void ResetAnimCurve();
	void ExecuteUbergraph_HouseNpcAnimBase(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("HouseNpcAnimBase_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"HouseNpcAnimBase_C")
	}
	static class UHouseNpcAnimBase_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHouseNpcAnimBase_C>();
	}
};
DUMPER7_ASSERTS_UHouseNpcAnimBase_C;

}

