#pragma once

/*
* SDK generated by Rei-SdkDumper
* Based on Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: IceCreamGameMgr

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "DS_GMThrowResult_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "HouseLittleGameMgrBase_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass IceCreamGameMgr.IceCreamGameMgr_C
// 0x02A8 (0x04E0 - 0x0238)
class AIceCreamGameMgr_C final : public AHouseLittleGameMgrBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_IceCreamGameMgr_C;                  // 0x0238(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        BarrelPos;                                         // 0x0240(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        OrderCamPos;                                       // 0x0248(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        SelectCharCamPos;                                  // 0x0250(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCameraComponent*                       Camera1;                                           // 0x0258(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 TargetGirl;                                        // 0x0260(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class Abarrel_C*                              CurrentBarrel;                                     // 0x0268(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         Targets;                                           // 0x0270(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	TMulticastInlineDelegate<void()>              Shoot;                                             // 0x0280(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UAnimSequence*                          TarAnimMon;                                        // 0x0290(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CurrentSocketName;                                 // 0x0298(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ThrowResult;                                       // 0x02A0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A1[0x3];                                      // 0x02A1(0x0003)(Fixing Size After Last Property [ Rei-SdkDumper ])
	int32                                         CurrentEffectType;                                 // 0x02A4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_HouseThrowCupBase_C*                CurrentCup;                                        // 0x02A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         AppliedCount;                                      // 0x02B0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         RoundIndex;                                        // 0x02B4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         Spoons;                                            // 0x02B8(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	class FName                                   CurrentGirlID;                                     // 0x02C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CurrentGirlIntID;                                  // 0x02D0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D4[0x4];                                      // 0x02D4(0x0004)(Fixing Size After Last Property [ Rei-SdkDumper ])
	TMap<int32, class AHouseBaseCharacter*>       IDstoGirls;                                        // 0x02D8(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          bHasSpecialRes;                                    // 0x0328(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_329[0x7];                                      // 0x0329(0x0007)(Fixing Size After Last Property [ Rei-SdkDumper ])
	class FString                                 CatchLSName;                                       // 0x0330(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	struct FTransform                             HighCameraLoc;                                     // 0x0340(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FTransform                             LowCameraLoc;                                      // 0x0370(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	int32                                         Effect_ID;                                         // 0x03A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A4[0x4];                                      // 0x03A4(0x0004)(Fixing Size After Last Property [ Rei-SdkDumper ])
	class ABP_BeachGameHouseAIChar_C*             As_BP_Beach_Game_House_AIChar;                     // 0x03A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<int32>                                 AllGirlIDs;                                        // 0x03B0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FVector                                InitLaunchPos;                                     // 0x03C0(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                GMPoint;                                           // 0x03CC(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         GMDuration;                                        // 0x03D8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          GMNormal;                                          // 0x03DC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3DD[0x3];                                      // 0x03DD(0x0003)(Fixing Size After Last Property [ Rei-SdkDumper ])
	TArray<class AHouseBaseCharacter*>            AllChallengeGirls;                                 // 0x03E0(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	TArray<class AActor*>                         AllCups;                                           // 0x03F0(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	int32                                         GMCurGirl;                                         // 0x0400(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_404[0x4];                                      // 0x0404(0x0004)(Fixing Size After Last Property [ Rei-SdkDumper ])
	TArray<struct FDS_GMThrowResult>              GMResult;                                          // 0x0408(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	class UNiagaraComponent*                      CupSuccessNiagara;                                 // 0x0418(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMap<int32, class FString>                    MatToSounds;                                       // 0x0420(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<int32, class FString>                    MatToHitSounds;                                    // 0x0470(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          bCurrentSpecial;                                   // 0x04C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4C1[0x7];                                      // 0x04C1(0x0007)(Fixing Size After Last Property [ Rei-SdkDumper ])
	TArray<class UMaterialInterface*>             AnalystSecondaryMaterials;                         // 0x04C8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void MoveClamp(float Val, float* Value);
	void ConditionReinitPos(int32 CheckSupportType, bool bFullReinit);
	void GetSpinePos(struct FVector* Pos);
	void GetMatHitEffectSoundID(int32 MatID, class FString* VoiceID);
	void GetMatEffectSoundID(int32 MatID, class FString* VoiceID);
	void ThrowHit__Overridden(const struct FVector& HitPosInWorld);
	void DecideIceBallPosIndex(const TArray<struct FBallResultConfig>& ResultConfigs, int32 InConfigIndex, int32 InPosIndex, int32 MatID, int32* PosIndex);
	void DecideSpecial(const TArray<struct FBallResultConfig>& Array, int32* ConfigIndex);
	void DecidePosIndex(const TArray<struct FBallResultConfig>& ResultConfigs, int32 InConfigIndex, int32 InPosIndex, int32 MatID, int32* PosIndex);
	void GMGetGirlIDByName(const class FString& Name_0, class FName* GirlId);
	void GetResultData(TArray<struct FBallResults>* DataTable);
	void FindStashGirlAndReinit(int32 GirlId);
	void ChangeHouseBeachView__Overridden(class AActor* PActor);
	void RandomFullCup(class AHouseBaseCharacter* AttachParent, int32 CupType, class AActor** CupActor);
	void DebugGMSub(TArray<struct FBallResultConfig>& ResultArr, class FName BoneName, const class FString& SeqName);
	void DebugGM(int32 GirlId, int32 DrinkId, const class FString& Result, const class FString& Normal, const class FString& BoneName, const class FString& SeqName, int32 IngredientID, const class FString& Reserve);
	void DestroyCupAndDisableHandIK();
	void SpawnAndAttachedCup(int32 DrinkId);
	void DestoryStashGirls();
	void StashGirls();
	void SetCurrentIceCreamMat(class AStaticMeshActor* MeshActor);
	void SpawnNewGirl();
	void DebugDestroyGirl();
	void DebugPrepareGirlToPlay(int32 DrinkId);
	void DebugThrowAndCatch(int32 IngredientID, bool bResult, bool bSpecial);
	void StopSettlementLS();
	void RandomResult(int32 EffectId, const TArray<struct FBallResultConfig>& TargetArray, bool ThrowResult_0);
	void PlayThrowandCatchPerf(bool Result, int32 EffectId);
	void SetBarrelState(const struct FVector& TarLoc, float Duration, float Arc);
	void OnBlendOut_3A4CBF0C499C3DF7D44E499B656E07E8(class FName NotifyName);
	void OnCompleted_3A4CBF0C499C3DF7D44E499B656E07E8(class FName NotifyName);
	void OnBlendOut_E4CA4B6B4077230951FCA8B4861035E7(class FName NotifyName);
	void OnCompleted_E4CA4B6B4077230951FCA8B4861035E7(class FName NotifyName);
	void OnBlendOut_B6FDDA794D3445107B11AA83C81F1C54(class FName NotifyName);
	void OnCompleted_B6FDDA794D3445107B11AA83C81F1C54(class FName NotifyName);
	void OnBlendOut_78973D62430535008195FCBDA69B31D2(class FName NotifyName);
	void OnCompleted_78973D62430535008195FCBDA69B31D2(class FName NotifyName);
	void OnBlendOut_DEE84F30492F2DA24B0B86A1B05B6700(class FName NotifyName);
	void OnCompleted_DEE84F30492F2DA24B0B86A1B05B6700(class FName NotifyName);
	void OnBlendOut_218A782B4771D90850441DB7A016AE0E(class FName NotifyName);
	void OnCompleted_218A782B4771D90850441DB7A016AE0E(class FName NotifyName);
	void OnBlendOut_629DCBC04E3CEE1586F5629EB4CD8B3B(class FName NotifyName);
	void OnCompleted_629DCBC04E3CEE1586F5629EB4CD8B3B(class FName NotifyName);
	void OnBlendOut_1332FD164A5100CBF887DEBDA6B331C4(class FName NotifyName);
	void OnCompleted_1332FD164A5100CBF887DEBDA6B331C4(class FName NotifyName);
	void OnBlendOut_6222EB344E6FC367A9139F9ABC96C003(class FName NotifyName);
	void OnCompleted_6222EB344E6FC367A9139F9ABC96C003(class FName NotifyName);
	void OnBlendOut_F0EC52D541BA69EADE3AE0888A9140FC(class FName NotifyName);
	void OnCompleted_F0EC52D541BA69EADE3AE0888A9140FC(class FName NotifyName);
	void OnBlendOut_55CCC6A94A017DC4E5C3C19118FDA29A(class FName NotifyName);
	void OnCompleted_55CCC6A94A017DC4E5C3C19118FDA29A(class FName NotifyName);
	void AttachIceCream();
	void PrepareToPlay(int32 DrinkId);
	void SelectThrowGameCharacter(int32 CharID, bool bBackMain);
	void ThrowAndCatch(int32 EffectId, bool Result);
	void PlaySettlementPerf(bool Result);
	void SetCharRoundStart();
	void TransToDialogue();
	void ReceiveBeginPlay__Overridden();
	void PerformDialogue();
	void TransCamToOrder(int32 CharID);
	void DebugPlayMontage(class UAnimSequence* BodySeqToPlay);
	void OnPlaySettlementLS(bool Result);
	void OnEndSettlementLS(bool Result);
	void PlayChallengeSettleLS();
	void OnEndChallengeLS();
	void PlayEffectSound(const class FString& VoiceID);
	void PlayGirlEffectSound(const class FString& VoiceRowName);
	void InpAxisEvt_BeachLeftForward_K2Node_InputAxisEvent_1(float AxisValue);
	void InpAxisEvt_BeachLeftRight_K2Node_InputAxisEvent_2(float AxisValue);
	void InpAxisEvt_BeachRightRight_K2Node_InputAxisEvent_4(float AxisValue);
	void InpAxisEvt_BeachRightForward_K2Node_InputAxisEvent_5(float AxisValue);
	void ReceiveEndPlay__Overridden(EEndPlayReason EndPlayReason);
	void ExecuteUbergraph_IceCreamGameMgr(int32 EntryPoint);
	void ReceiveTick(float DeltaSeconds);
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void ChangeHouseBeachView(class AActor* PActor);
	void ReceiveBeginPlay();
	void ThrowHit(const struct FVector& HitPosInWorld);

	class FString GetModuleName() const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("IceCreamGameMgr_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"IceCreamGameMgr_C")
	}
	static class AIceCreamGameMgr_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AIceCreamGameMgr_C>();
	}
};
DUMPER7_ASSERTS_AIceCreamGameMgr_C;

}

