#pragma once

/*
* SDK generated by Rei-SdkDumper
* Based on Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LocationServicesBPLibrary

#include "Basic.hpp"


namespace SDK
{

// Enum LocationServicesBPLibrary.ELocationAccuracy
// NumValues: 0x0007
enum class ELocationAccuracy : uint8
{
	LA_ThreeKilometers                       = 0,
	LA_OneKilometer                          = 1,
	LA_HundredMeters                         = 2,
	LA_TenMeters                             = 3,
	LA_Best                                  = 4,
	LA_Navigation                            = 5,
	LA_MAX                                   = 6,
};

// ScriptStruct LocationServicesBPLibrary.LocationServicesData
// 0x0018 (0x0018 - 0x0000)
struct FLocationServicesData final
{
public:
	float                                         Timestamp;                                         // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Longitude;                                         // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Latitude;                                          // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         HorizontalAccuracy;                                // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         VerticalAccuracy;                                  // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Altitude;                                          // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FLocationServicesData;

}

