#pragma once

/*
* SDK generated by Rei-SdkDumper
* Based on Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LocationServicesBPLibrary

#include "Basic.hpp"

#include "LocationServicesBPLibrary_structs.hpp"


namespace SDK::Params
{

// Function LocationServicesBPLibrary.LocationServices.AreLocationServicesEnabled
// 0x0001 (0x0001 - 0x0000)
struct LocationServices_AreLocationServicesEnabled final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LocationServices_AreLocationServicesEnabled;

// Function LocationServicesBPLibrary.LocationServices.GetLastKnownLocation
// 0x0018 (0x0018 - 0x0000)
struct LocationServices_GetLastKnownLocation final
{
public:
	struct FLocationServicesData                  ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LocationServices_GetLastKnownLocation;

// Function LocationServicesBPLibrary.LocationServices.GetLocationServicesImpl
// 0x0008 (0x0008 - 0x0000)
struct LocationServices_GetLocationServicesImpl final
{
public:
	class ULocationServicesImpl*                  ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LocationServices_GetLocationServicesImpl;

// Function LocationServicesBPLibrary.LocationServices.InitLocationServices
// 0x0010 (0x0010 - 0x0000)
struct LocationServices_InitLocationServices final
{
public:
	ELocationAccuracy                             Accuracy;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Rei-SdkDumper ])
	float                                         UpdateFrequency;                                   // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MinDistanceFilter;                                 // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x000C(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_LocationServices_InitLocationServices;

// Function LocationServicesBPLibrary.LocationServices.IsLocationAccuracyAvailable
// 0x0002 (0x0002 - 0x0000)
struct LocationServices_IsLocationAccuracyAvailable final
{
public:
	ELocationAccuracy                             Accuracy;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LocationServices_IsLocationAccuracyAvailable;

// Function LocationServicesBPLibrary.LocationServices.StartLocationServices
// 0x0001 (0x0001 - 0x0000)
struct LocationServices_StartLocationServices final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LocationServices_StartLocationServices;

// Function LocationServicesBPLibrary.LocationServices.StopLocationServices
// 0x0001 (0x0001 - 0x0000)
struct LocationServices_StopLocationServices final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LocationServices_StopLocationServices;

}

