#pragma once

/*
* SDK generated by Rei-SdkDumper
* Based on Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LuminRuntimeSettings

#include "Basic.hpp"

#include "LuminRuntimeSettings_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_classes.hpp"


namespace SDK
{

// Class LuminRuntimeSettings.LuminRuntimeSettings
// 0x0120 (0x0148 - 0x0028)
class ULuminRuntimeSettings final : public UObject
{
public:
	class FString                                 PackageName;                                       // 0x0028(0x0010)(Edit, ZeroConstructor, Config, GlobalConfig, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ApplicationDisplayName;                            // 0x0038(0x0010)(Edit, ZeroConstructor, Config, GlobalConfig, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ELuminFrameTimingHint                         FrameTimingHint;                                   // 0x0048(0x0001)(Edit, ZeroConstructor, Config, GlobalConfig, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bProtectedContent;                                 // 0x0049(0x0001)(Edit, ZeroConstructor, Config, GlobalConfig, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bManualCallToAppReady;                             // 0x004A(0x0001)(Edit, ZeroConstructor, Config, GlobalConfig, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseMobileRendering;                               // 0x004B(0x0001)(Edit, ZeroConstructor, Config, GlobalConfig, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseVulkan;                                        // 0x004C(0x0001)(ZeroConstructor, Config, GlobalConfig, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4D[0x3];                                       // 0x004D(0x0003)(Fixing Size After Last Property [ Rei-SdkDumper ])
	struct FFilePath                              Certificate;                                       // 0x0050(0x0010)(Edit, Config, GlobalConfig, NativeAccessSpecifierPublic)
	struct FDirectoryPath                         IconModelPath;                                     // 0x0060(0x0010)(Edit, Config, GlobalConfig, NativeAccessSpecifierPublic)
	struct FDirectoryPath                         IconPortalPath;                                    // 0x0070(0x0010)(Edit, Config, GlobalConfig, NativeAccessSpecifierPublic)
	struct FLocalizedIconInfos                    LocalizedIconInfos;                                // 0x0080(0x0010)(Edit, Config, GlobalConfig, NativeAccessSpecifierPublic)
	int32                                         VersionCode;                                       // 0x0090(0x0004)(Edit, ZeroConstructor, Config, GlobalConfig, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MinimumAPILevel;                                   // 0x0094(0x0004)(Edit, ZeroConstructor, Config, GlobalConfig, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<ELuminPrivilege>                       AppPrivileges;                                     // 0x0098(0x0010)(Edit, ZeroConstructor, Config, GlobalConfig, NativeAccessSpecifierPublic)
	TArray<struct FLuminComponentSubElement>      ExtraComponentSubElements;                         // 0x00A8(0x0010)(Edit, ZeroConstructor, Config, GlobalConfig, NativeAccessSpecifierPublic)
	TArray<struct FLuminComponentElement>         ExtraComponentElements;                            // 0x00B8(0x0010)(Edit, ZeroConstructor, Config, GlobalConfig, NativeAccessSpecifierPublic)
	class FString                                 SpatializationPlugin;                              // 0x00C8(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ReverbPlugin;                                      // 0x00D8(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 OcclusionPlugin;                                   // 0x00E8(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SoundCueCookQualityIndex;                          // 0x00F8(0x0004)(Edit, ZeroConstructor, Config, GlobalConfig, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bRemoveDebugInfo;                                  // 0x00FC(0x0001)(Edit, ZeroConstructor, Config, GlobalConfig, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_FD[0x3];                                       // 0x00FD(0x0003)(Fixing Size After Last Property [ Rei-SdkDumper ])
	struct FDirectoryPath                         VulkanValidationLayerLibs;                         // 0x0100(0x0010)(Edit, Config, GlobalConfig, NativeAccessSpecifierPublic)
	bool                                          bFrameVignette;                                    // 0x0110(0x0001)(Edit, ZeroConstructor, Config, GlobalConfig, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_111[0x7];                                      // 0x0111(0x0007)(Fixing Size After Last Property [ Rei-SdkDumper ])
	TArray<struct FLocalizedAppName>              LocalizedAppNames;                                 // 0x0118(0x0010)(Edit, ZeroConstructor, Config, GlobalConfig, NativeAccessSpecifierPublic)
	uint8                                         Pad_128[0x20];                                     // 0x0128(0x0020)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("LuminRuntimeSettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"LuminRuntimeSettings")
	}
	static class ULuminRuntimeSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULuminRuntimeSettings>();
	}
};
DUMPER7_ASSERTS_ULuminRuntimeSettings;

}

