#pragma once

/*
* SDK generated by Rei-SdkDumper
* Based on Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MagicLeapPlanes

#include "Basic.hpp"

#include "MagicLeapPlanes_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function MagicLeapPlanes.MagicLeapPlanesComponent.RequestPlanesAsync
// 0x0001 (0x0001 - 0x0000)
struct MagicLeapPlanesComponent_RequestPlanesAsync final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MagicLeapPlanesComponent_RequestPlanesAsync;

// Function MagicLeapPlanes.MagicLeapPlanesFunctionLibrary.AddPersistentQuery
// 0x0014 (0x0014 - 0x0000)
struct MagicLeapPlanesFunctionLibrary_AddPersistentQuery final
{
public:
	EMagicLeapPlaneQueryType                      PersistentQueryType;                               // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Rei-SdkDumper ])
	struct FGuid                                  ReturnValue;                                       // 0x0004(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MagicLeapPlanesFunctionLibrary_AddPersistentQuery;

// Function MagicLeapPlanes.MagicLeapPlanesFunctionLibrary.CreateTracker
// 0x0001 (0x0001 - 0x0000)
struct MagicLeapPlanesFunctionLibrary_CreateTracker final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MagicLeapPlanesFunctionLibrary_CreateTracker;

// Function MagicLeapPlanes.MagicLeapPlanesFunctionLibrary.DestroyTracker
// 0x0001 (0x0001 - 0x0000)
struct MagicLeapPlanesFunctionLibrary_DestroyTracker final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MagicLeapPlanesFunctionLibrary_DestroyTracker;

// Function MagicLeapPlanes.MagicLeapPlanesFunctionLibrary.GetContentScale
// 0x00A0 (0x00A0 - 0x0000)
struct MagicLeapPlanesFunctionLibrary_GetContentScale final
{
public:
	const class AActor*                           ContentActor;                                      // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMagicLeapPlaneResult                  PlaneResult;                                       // 0x0008(0x0060)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	uint8                                         Pad_68[0x8];                                       // 0x0068(0x0008)(Fixing Size After Last Property [ Rei-SdkDumper ])
	struct FTransform                             ReturnValue;                                       // 0x0070(0x0030)(Parm, OutParm, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MagicLeapPlanesFunctionLibrary_GetContentScale;

// Function MagicLeapPlanes.MagicLeapPlanesFunctionLibrary.IsTrackerValid
// 0x0001 (0x0001 - 0x0000)
struct MagicLeapPlanesFunctionLibrary_IsTrackerValid final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MagicLeapPlanesFunctionLibrary_IsTrackerValid;

// Function MagicLeapPlanes.MagicLeapPlanesFunctionLibrary.PlanesPersistentQueryBeginAsync
// 0x0090 (0x0090 - 0x0000)
struct MagicLeapPlanesFunctionLibrary_PlanesPersistentQueryBeginAsync final
{
public:
	struct FMagicLeapPlanesQuery                  Query;                                             // 0x0000(0x0060)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FGuid                                  Handle;                                            // 0x0060(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(const bool bSuccess, const struct FGuid& QueryHandle, const EMagicLeapPlaneQueryType QueryType, const TArray<struct FMagicLeapPlaneResult>& NewPlanes, const TArray<struct FGuid>& RemovedPlaneIDs, const TArray<struct FMagicLeapPlaneBoundaries>& NewPolygons, const TArray<struct FGuid>& RemovedPolygonIDs)> ResultDelegate; // 0x0070(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0080(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_81[0xF];                                       // 0x0081(0x000F)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_MagicLeapPlanesFunctionLibrary_PlanesPersistentQueryBeginAsync;

// Function MagicLeapPlanes.MagicLeapPlanesFunctionLibrary.PlanesQueryBeginAsync
// 0x0080 (0x0080 - 0x0000)
struct MagicLeapPlanesFunctionLibrary_PlanesQueryBeginAsync final
{
public:
	struct FMagicLeapPlanesQuery                  Query;                                             // 0x0000(0x0060)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
	TDelegate<void(const bool bSuccess, const TArray<struct FMagicLeapPlaneResult>& Planes, const TArray<struct FMagicLeapPlaneBoundaries>& Polygons)> ResultDelegate; // 0x0060(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0070(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_71[0xF];                                       // 0x0071(0x000F)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_MagicLeapPlanesFunctionLibrary_PlanesQueryBeginAsync;

// Function MagicLeapPlanes.MagicLeapPlanesFunctionLibrary.RemoveFlagsNotInQuery
// 0x0030 (0x0030 - 0x0000)
struct MagicLeapPlanesFunctionLibrary_RemoveFlagsNotInQuery final
{
public:
	TArray<EMagicLeapPlaneQueryFlags>             InQueryFlags;                                      // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<EMagicLeapPlaneQueryFlags>             InResultFlags;                                     // 0x0010(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<EMagicLeapPlaneQueryFlags>             OutFlags;                                          // 0x0020(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MagicLeapPlanesFunctionLibrary_RemoveFlagsNotInQuery;

// Function MagicLeapPlanes.MagicLeapPlanesFunctionLibrary.RemovePersistentQuery
// 0x0014 (0x0014 - 0x0000)
struct MagicLeapPlanesFunctionLibrary_RemovePersistentQuery final
{
public:
	struct FGuid                                  Handle;                                            // 0x0000(0x0010)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_MagicLeapPlanesFunctionLibrary_RemovePersistentQuery;

// Function MagicLeapPlanes.MagicLeapPlanesFunctionLibrary.ReorderPlaneFlags
// 0x0030 (0x0030 - 0x0000)
struct MagicLeapPlanesFunctionLibrary_ReorderPlaneFlags final
{
public:
	TArray<EMagicLeapPlaneQueryFlags>             InPriority;                                        // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<EMagicLeapPlaneQueryFlags>             InFlagsToReorder;                                  // 0x0010(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<EMagicLeapPlaneQueryFlags>             OutReorderedFlags;                                 // 0x0020(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MagicLeapPlanesFunctionLibrary_ReorderPlaneFlags;

}

