#pragma once

/*
* SDK generated by Rei-SdkDumper
* Based on Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MagicLeapARPin

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "MagicLeapARPin_structs.hpp"


namespace SDK::Params
{

// Function MagicLeapARPin.MagicLeapARPinComponent.AttemptPinDataRestoration
// 0x0001 (0x0001 - 0x0000)
struct MagicLeapARPinComponent_AttemptPinDataRestoration final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MagicLeapARPinComponent_AttemptPinDataRestoration;

// Function MagicLeapARPin.MagicLeapARPinComponent.GetPinData
// 0x0010 (0x0010 - 0x0000)
struct MagicLeapARPinComponent_GetPinData final
{
public:
	TSubclassOf<class UMagicLeapARPinSaveGame>    PinDataClass_0;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMagicLeapARPinSaveGame*                ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MagicLeapARPinComponent_GetPinData;

// Function MagicLeapARPin.MagicLeapARPinComponent.PinActor
// 0x0010 (0x0010 - 0x0000)
struct MagicLeapARPinComponent_PinActor final
{
public:
	class AActor*                                 ActorToPin;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_MagicLeapARPinComponent_PinActor;

// Function MagicLeapARPin.MagicLeapARPinComponent.PinSceneComponent
// 0x0010 (0x0010 - 0x0000)
struct MagicLeapARPinComponent_PinSceneComponent final
{
public:
	class USceneComponent*                        ComponentToPin;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_MagicLeapARPinComponent_PinSceneComponent;

// Function MagicLeapARPin.MagicLeapARPinComponent.PinToID
// 0x0014 (0x0014 - 0x0000)
struct MagicLeapARPinComponent_PinToID final
{
public:
	struct FGuid                                  PinId;                                             // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_MagicLeapARPinComponent_PinToID;

// Function MagicLeapARPin.MagicLeapARPinComponent.PinToRestoredOrSyncedID
// 0x0001 (0x0001 - 0x0000)
struct MagicLeapARPinComponent_PinToRestoredOrSyncedID final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MagicLeapARPinComponent_PinToRestoredOrSyncedID;

// Function MagicLeapARPin.MagicLeapARPinComponent.TryGetPinData
// 0x0018 (0x0018 - 0x0000)
struct MagicLeapARPinComponent_TryGetPinData final
{
public:
	TSubclassOf<class UMagicLeapARPinSaveGame>    InPinDataClass;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          OutPinDataValid;                                   // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Rei-SdkDumper ])
	class UMagicLeapARPinSaveGame*                ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MagicLeapARPinComponent_TryGetPinData;

// Function MagicLeapARPin.MagicLeapARPinComponent.GetPinnedPinID
// 0x0014 (0x0014 - 0x0000)
struct MagicLeapARPinComponent_GetPinnedPinID final
{
public:
	struct FGuid                                  PinId;                                             // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_MagicLeapARPinComponent_GetPinnedPinID;

// Function MagicLeapARPin.MagicLeapARPinComponent.GetPinState
// 0x0018 (0x0018 - 0x0000)
struct MagicLeapARPinComponent_GetPinState final
{
public:
	struct FMagicLeapARPinState                   State;                                             // 0x0000(0x0014)(Parm, OutParm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0014(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_MagicLeapARPinComponent_GetPinState;

// Function MagicLeapARPin.MagicLeapARPinComponent.IsPinned
// 0x0001 (0x0001 - 0x0000)
struct MagicLeapARPinComponent_IsPinned final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MagicLeapARPinComponent_IsPinned;

// Function MagicLeapARPin.MagicLeapARPinComponent.PinRestoredOrSynced
// 0x0001 (0x0001 - 0x0000)
struct MagicLeapARPinComponent_PinRestoredOrSynced final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MagicLeapARPinComponent_PinRestoredOrSynced;

// Function MagicLeapARPin.MagicLeapARPinFunctionLibrary.ARPinIdToString
// 0x0020 (0x0020 - 0x0000)
struct MagicLeapARPinFunctionLibrary_ARPinIdToString final
{
public:
	struct FGuid                                  ARPinId;                                           // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MagicLeapARPinFunctionLibrary_ARPinIdToString;

// Function MagicLeapARPin.MagicLeapARPinFunctionLibrary.BindToOnMagicLeapARPinUpdatedDelegate
// 0x0010 (0x0010 - 0x0000)
struct MagicLeapARPinFunctionLibrary_BindToOnMagicLeapARPinUpdatedDelegate final
{
public:
	TDelegate<void(const TArray<struct FGuid>& Added, const TArray<struct FGuid>& Updated, const TArray<struct FGuid>& Deleted)> Delegate; // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MagicLeapARPinFunctionLibrary_BindToOnMagicLeapARPinUpdatedDelegate;

// Function MagicLeapARPin.MagicLeapARPinFunctionLibrary.BindToOnMagicLeapContentBindingFoundDelegate
// 0x0010 (0x0010 - 0x0000)
struct MagicLeapARPinFunctionLibrary_BindToOnMagicLeapContentBindingFoundDelegate final
{
public:
	TDelegate<void(const struct FGuid& PinId, const TSet<class FString>& PinnedObjectIds)> Delegate; // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MagicLeapARPinFunctionLibrary_BindToOnMagicLeapContentBindingFoundDelegate;

// Function MagicLeapARPin.MagicLeapARPinFunctionLibrary.CreateTracker
// 0x0001 (0x0001 - 0x0000)
struct MagicLeapARPinFunctionLibrary_CreateTracker final
{
public:
	EMagicLeapPassableWorldError                  ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MagicLeapARPinFunctionLibrary_CreateTracker;

// Function MagicLeapARPin.MagicLeapARPinFunctionLibrary.DestroyTracker
// 0x0001 (0x0001 - 0x0000)
struct MagicLeapARPinFunctionLibrary_DestroyTracker final
{
public:
	EMagicLeapPassableWorldError                  ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MagicLeapARPinFunctionLibrary_DestroyTracker;

// Function MagicLeapARPin.MagicLeapARPinFunctionLibrary.GetARPinPositionAndOrientation
// 0x002C (0x002C - 0x0000)
struct MagicLeapARPinFunctionLibrary_GetARPinPositionAndOrientation final
{
public:
	struct FGuid                                  PinId;                                             // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Position;                                          // 0x0010(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               Orientation;                                       // 0x001C(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          PinFoundInEnvironment;                             // 0x0028(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0029(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2A[0x2];                                       // 0x002A(0x0002)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_MagicLeapARPinFunctionLibrary_GetARPinPositionAndOrientation;

// Function MagicLeapARPin.MagicLeapARPinFunctionLibrary.GetARPinPositionAndOrientation_TrackingSpace
// 0x002C (0x002C - 0x0000)
struct MagicLeapARPinFunctionLibrary_GetARPinPositionAndOrientation_TrackingSpace final
{
public:
	struct FGuid                                  PinId;                                             // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Position;                                          // 0x0010(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               Orientation;                                       // 0x001C(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          PinFoundInEnvironment;                             // 0x0028(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0029(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2A[0x2];                                       // 0x002A(0x0002)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_MagicLeapARPinFunctionLibrary_GetARPinPositionAndOrientation_TrackingSpace;

// Function MagicLeapARPin.MagicLeapARPinFunctionLibrary.GetARPinState
// 0x0028 (0x0028 - 0x0000)
struct MagicLeapARPinFunctionLibrary_GetARPinState final
{
public:
	struct FGuid                                  PinId;                                             // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMagicLeapARPinState                   State;                                             // 0x0010(0x0014)(Parm, OutParm, NoDestructor, NativeAccessSpecifierPublic)
	EMagicLeapPassableWorldError                  ReturnValue;                                       // 0x0024(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_MagicLeapARPinFunctionLibrary_GetARPinState;

// Function MagicLeapARPin.MagicLeapARPinFunctionLibrary.GetARPinStateToString
// 0x0028 (0x0028 - 0x0000)
struct MagicLeapARPinFunctionLibrary_GetARPinStateToString final
{
public:
	struct FMagicLeapARPinState                   State;                                             // 0x0000(0x0014)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Rei-SdkDumper ])
	class FString                                 ReturnValue;                                       // 0x0018(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MagicLeapARPinFunctionLibrary_GetARPinStateToString;

// Function MagicLeapARPin.MagicLeapARPinFunctionLibrary.GetAvailableARPins
// 0x0020 (0x0020 - 0x0000)
struct MagicLeapARPinFunctionLibrary_GetAvailableARPins final
{
public:
	int32                                         NumRequested;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Rei-SdkDumper ])
	TArray<struct FGuid>                          Pins;                                              // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	EMagicLeapPassableWorldError                  ReturnValue;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_MagicLeapARPinFunctionLibrary_GetAvailableARPins;

// Function MagicLeapARPin.MagicLeapARPinFunctionLibrary.GetClosestARPin
// 0x0020 (0x0020 - 0x0000)
struct MagicLeapARPinFunctionLibrary_GetClosestARPin final
{
public:
	struct FVector                                SearchPoint;                                       // 0x0000(0x000C)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGuid                                  PinId;                                             // 0x000C(0x0010)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EMagicLeapPassableWorldError                  ReturnValue;                                       // 0x001C(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_MagicLeapARPinFunctionLibrary_GetClosestARPin;

// Function MagicLeapARPin.MagicLeapARPinFunctionLibrary.GetContentBindingSaveGameUserIndex
// 0x0004 (0x0004 - 0x0000)
struct MagicLeapARPinFunctionLibrary_GetContentBindingSaveGameUserIndex final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MagicLeapARPinFunctionLibrary_GetContentBindingSaveGameUserIndex;

// Function MagicLeapARPin.MagicLeapARPinFunctionLibrary.GetGlobalQueryFilter
// 0x0070 (0x0070 - 0x0000)
struct MagicLeapARPinFunctionLibrary_GetGlobalQueryFilter final
{
public:
	struct FMagicLeapARPinQuery                   CurrentGlobalFilter;                               // 0x0000(0x0068)(Parm, OutParm, NativeAccessSpecifierPublic)
	EMagicLeapPassableWorldError                  ReturnValue;                                       // 0x0068(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_MagicLeapARPinFunctionLibrary_GetGlobalQueryFilter;

// Function MagicLeapARPin.MagicLeapARPinFunctionLibrary.GetNumAvailableARPins
// 0x0008 (0x0008 - 0x0000)
struct MagicLeapARPinFunctionLibrary_GetNumAvailableARPins final
{
public:
	int32                                         Count;                                             // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EMagicLeapPassableWorldError                  ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_MagicLeapARPinFunctionLibrary_GetNumAvailableARPins;

// Function MagicLeapARPin.MagicLeapARPinFunctionLibrary.IsTrackerValid
// 0x0001 (0x0001 - 0x0000)
struct MagicLeapARPinFunctionLibrary_IsTrackerValid final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MagicLeapARPinFunctionLibrary_IsTrackerValid;

// Function MagicLeapARPin.MagicLeapARPinFunctionLibrary.ParseStringToARPinId
// 0x0028 (0x0028 - 0x0000)
struct MagicLeapARPinFunctionLibrary_ParseStringToARPinId final
{
public:
	class FString                                 PinIdString;                                       // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGuid                                  ARPinId;                                           // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_MagicLeapARPinFunctionLibrary_ParseStringToARPinId;

// Function MagicLeapARPin.MagicLeapARPinFunctionLibrary.QueryARPins
// 0x0080 (0x0080 - 0x0000)
struct MagicLeapARPinFunctionLibrary_QueryARPins final
{
public:
	struct FMagicLeapARPinQuery                   Query;                                             // 0x0000(0x0068)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<struct FGuid>                          Pins;                                              // 0x0068(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	EMagicLeapPassableWorldError                  ReturnValue;                                       // 0x0078(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_MagicLeapARPinFunctionLibrary_QueryARPins;

// Function MagicLeapARPin.MagicLeapARPinFunctionLibrary.SetContentBindingSaveGameUserIndex
// 0x0004 (0x0004 - 0x0000)
struct MagicLeapARPinFunctionLibrary_SetContentBindingSaveGameUserIndex final
{
public:
	int32                                         UserIndex;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MagicLeapARPinFunctionLibrary_SetContentBindingSaveGameUserIndex;

// Function MagicLeapARPin.MagicLeapARPinFunctionLibrary.SetGlobalQueryFilter
// 0x0070 (0x0070 - 0x0000)
struct MagicLeapARPinFunctionLibrary_SetGlobalQueryFilter final
{
public:
	struct FMagicLeapARPinQuery                   InGlobalFilter;                                    // 0x0000(0x0068)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	EMagicLeapPassableWorldError                  ReturnValue;                                       // 0x0068(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_MagicLeapARPinFunctionLibrary_SetGlobalQueryFilter;

// Function MagicLeapARPin.MagicLeapARPinFunctionLibrary.UnBindToOnMagicLeapARPinUpdatedDelegate
// 0x0010 (0x0010 - 0x0000)
struct MagicLeapARPinFunctionLibrary_UnBindToOnMagicLeapARPinUpdatedDelegate final
{
public:
	TDelegate<void(const TArray<struct FGuid>& Added, const TArray<struct FGuid>& Updated, const TArray<struct FGuid>& Deleted)> Delegate; // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MagicLeapARPinFunctionLibrary_UnBindToOnMagicLeapARPinUpdatedDelegate;

// Function MagicLeapARPin.MagicLeapARPinFunctionLibrary.UnBindToOnMagicLeapContentBindingFoundDelegate
// 0x0010 (0x0010 - 0x0000)
struct MagicLeapARPinFunctionLibrary_UnBindToOnMagicLeapContentBindingFoundDelegate final
{
public:
	TDelegate<void(const struct FGuid& PinId, const TSet<class FString>& PinnedObjectIds)> Delegate; // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MagicLeapARPinFunctionLibrary_UnBindToOnMagicLeapContentBindingFoundDelegate;

// Function MagicLeapARPin.MagicLeapARPinRenderer.SetVisibilityOverride
// 0x0001 (0x0001 - 0x0000)
struct MagicLeapARPinRenderer_SetVisibilityOverride final
{
public:
	bool                                          InVisibilityOverride;                              // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MagicLeapARPinRenderer_SetVisibilityOverride;

}

