#pragma once

/*
* SDK generated by Rei-SdkDumper
* Based on Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MagicLeapLightEstimation

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// Enum MagicLeapLightEstimation.EMagicLeapLightEstimationCamera
// NumValues: 0x0005
enum class EMagicLeapLightEstimationCamera : uint8
{
	Left                                     = 0,
	Right                                    = 1,
	FarLeft                                  = 2,
	FarRight                                 = 3,
	EMagicLeapLightEstimationCamera_MAX      = 4,
};

// ScriptStruct MagicLeapLightEstimation.MagicLeapLightEstimationColorTemperatureState
// 0x0020 (0x0020 - 0x0000)
struct FMagicLeapLightEstimationColorTemperatureState final
{
public:
	float                                         ColorTemperatureKelvin;                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           AmbientColor;                                      // 0x0004(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Rei-SdkDumper ])
	struct FTimespan                              Timestamp;                                         // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FMagicLeapLightEstimationColorTemperatureState;

// ScriptStruct MagicLeapLightEstimation.MagicLeapLightEstimationAmbientGlobalState
// 0x0018 (0x0018 - 0x0000)
struct FMagicLeapLightEstimationAmbientGlobalState final
{
public:
	TArray<float>                                 AmbientIntensityNits;                              // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	struct FTimespan                              Timestamp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FMagicLeapLightEstimationAmbientGlobalState;

}

