#pragma once

/*
* SDK generated by Rei-SdkDumper
* Based on Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MagicLeapSharedWorld

#include "Basic.hpp"

#include "MagicLeapSharedWorld_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function MagicLeapSharedWorld.MagicLeapSharedWorldGameMode.DetermineSharedWorldData
// 0x0010 (0x0010 - 0x0000)
struct MagicLeapSharedWorldGameMode_DetermineSharedWorldData final
{
public:
	struct FMagicLeapSharedWorldSharedData        NewSharedWorldData;                                // 0x0000(0x0010)(Parm, OutParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MagicLeapSharedWorldGameMode_DetermineSharedWorldData;

// Function MagicLeapSharedWorld.MagicLeapSharedWorldGameMode.SendSharedWorldDataToClients
// 0x0001 (0x0001 - 0x0000)
struct MagicLeapSharedWorldGameMode_SendSharedWorldDataToClients final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MagicLeapSharedWorldGameMode_SendSharedWorldDataToClients;

// Function MagicLeapSharedWorld.MagicLeapSharedWorldGameState.CalculateXRCameraRootTransform
// 0x0030 (0x0030 - 0x0000)
struct MagicLeapSharedWorldGameState_CalculateXRCameraRootTransform final
{
public:
	struct FTransform                             ReturnValue;                                       // 0x0000(0x0030)(Parm, OutParm, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MagicLeapSharedWorldGameState_CalculateXRCameraRootTransform;

// Function MagicLeapSharedWorld.MagicLeapSharedWorldPlayerController.ClientSetChosenOne
// 0x0001 (0x0001 - 0x0000)
struct MagicLeapSharedWorldPlayerController_ClientSetChosenOne final
{
public:
	bool                                          bChosenOne;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MagicLeapSharedWorldPlayerController_ClientSetChosenOne;

// Function MagicLeapSharedWorld.MagicLeapSharedWorldPlayerController.ServerSetAlignmentTransforms
// 0x0010 (0x0010 - 0x0000)
struct MagicLeapSharedWorldPlayerController_ServerSetAlignmentTransforms final
{
public:
	struct FMagicLeapSharedWorldAlignmentTransforms InAlignmentTransforms;                           // 0x0000(0x0010)(ConstParm, Parm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MagicLeapSharedWorldPlayerController_ServerSetAlignmentTransforms;

// Function MagicLeapSharedWorld.MagicLeapSharedWorldPlayerController.ServerSetLocalWorldData
// 0x0010 (0x0010 - 0x0000)
struct MagicLeapSharedWorldPlayerController_ServerSetLocalWorldData final
{
public:
	struct FMagicLeapSharedWorldLocalData         LocalWorldReplicationData;                         // 0x0000(0x0010)(ConstParm, Parm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MagicLeapSharedWorldPlayerController_ServerSetLocalWorldData;

// Function MagicLeapSharedWorld.MagicLeapSharedWorldPlayerController.CanSendLocalDataToServer
// 0x0001 (0x0001 - 0x0000)
struct MagicLeapSharedWorldPlayerController_CanSendLocalDataToServer final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MagicLeapSharedWorldPlayerController_CanSendLocalDataToServer;

// Function MagicLeapSharedWorld.MagicLeapSharedWorldPlayerController.IsChosenOne
// 0x0001 (0x0001 - 0x0000)
struct MagicLeapSharedWorldPlayerController_IsChosenOne final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MagicLeapSharedWorldPlayerController_IsChosenOne;

}

