#pragma once

/*
* SDK generated by Rei-SdkDumper
* Based on Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MagicLeapARPin

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// Enum MagicLeapARPin.EMagicLeapARPinType
// NumValues: 0x0004
enum class EMagicLeapARPinType : uint8
{
	SingleUserSingleSession                  = 0,
	SingleUserMultiSession                   = 1,
	MultiUserMultiSession                    = 2,
	EMagicLeapARPinType_MAX                  = 3,
};

// Enum MagicLeapARPin.EMagicLeapAutoPinType
// NumValues: 0x0004
enum class EMagicLeapAutoPinType : uint8
{
	OnlyOnDataRestoration                    = 0,
	Always                                   = 1,
	Never                                    = 2,
	EMagicLeapAutoPinType_MAX                = 3,
};

// Enum MagicLeapARPin.EMagicLeapPassableWorldError
// NumValues: 0x000D
enum class EMagicLeapPassableWorldError : uint8
{
	None                                     = 0,
	LowMapQuality                            = 1,
	UnableToLocalize                         = 2,
	Unavailable                              = 3,
	PrivilegeDenied                          = 4,
	InvalidParam                             = 5,
	UnspecifiedFailure                       = 6,
	PrivilegeRequestPending                  = 7,
	StartupPending                           = 8,
	SharedWorldNotEnabled                    = 9,
	NotImplemented                           = 10,
	PinNotFound                              = 11,
	EMagicLeapPassableWorldError_MAX         = 12,
};

// ScriptStruct MagicLeapARPin.MagicLeapARPinState
// 0x0014 (0x0014 - 0x0000)
struct FMagicLeapARPinState final
{
public:
	float                                         Confidence;                                        // 0x0000(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ValidRadius;                                       // 0x0004(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RotationError;                                     // 0x0008(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TranslationError;                                  // 0x000C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EMagicLeapARPinType                           PinType;                                           // 0x0010(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_FMagicLeapARPinState;

// ScriptStruct MagicLeapARPin.MagicLeapARPinQuery
// 0x0068 (0x0068 - 0x0000)
struct FMagicLeapARPinQuery final
{
public:
	TSet<EMagicLeapARPinType>                     Types;                                             // 0x0000(0x0050)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	int32                                         MaxResults;                                        // 0x0050(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                TargetPoint;                                       // 0x0054(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Radius;                                            // 0x0060(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSorted;                                           // 0x0064(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_65[0x3];                                       // 0x0065(0x0003)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_FMagicLeapARPinQuery;

// ScriptStruct MagicLeapARPin.MagicLeapARPinObjectIdList
// 0x0050 (0x0050 - 0x0000)
struct FMagicLeapARPinObjectIdList final
{
public:
	TSet<class FString>                           ObjectIdList;                                      // 0x0000(0x0050)(Edit, EditConst, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FMagicLeapARPinObjectIdList;

}

