#pragma once

/*
* SDK generated by Rei-SdkDumper
* Based on Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MagicLeapSharedWorld

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "MagicLeapARPin_structs.hpp"


namespace SDK
{

// ScriptStruct MagicLeapSharedWorld.MagicLeapSharedWorldSharedData
// 0x0010 (0x0010 - 0x0000)
struct FMagicLeapSharedWorldSharedData final
{
public:
	TArray<struct FGuid>                          PinIDs;                                            // 0x0000(0x0010)(BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FMagicLeapSharedWorldSharedData;

// ScriptStruct MagicLeapSharedWorld.MagicLeapSharedWorldAlignmentTransforms
// 0x0010 (0x0010 - 0x0000)
struct FMagicLeapSharedWorldAlignmentTransforms final
{
public:
	TArray<struct FTransform>                     AlignmentTransforms;                               // 0x0000(0x0010)(BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FMagicLeapSharedWorldAlignmentTransforms;

// ScriptStruct MagicLeapSharedWorld.MagicLeapSharedWorldPinData
// 0x0024 (0x0024 - 0x0000)
struct FMagicLeapSharedWorldPinData final
{
public:
	struct FGuid                                  PinId;                                             // 0x0000(0x0010)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMagicLeapARPinState                   PinState;                                          // 0x0010(0x0014)(BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FMagicLeapSharedWorldPinData;

// ScriptStruct MagicLeapSharedWorld.MagicLeapSharedWorldLocalData
// 0x0010 (0x0010 - 0x0000)
struct FMagicLeapSharedWorldLocalData final
{
public:
	TArray<struct FMagicLeapSharedWorldPinData>   LocalPins;                                         // 0x0000(0x0010)(BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FMagicLeapSharedWorldLocalData;

}

