#pragma once

/*
* SDK generated by Rei-SdkDumper
* Based on Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MagicLeapAudio

#include "Basic.hpp"


namespace SDK::Params
{

// Function MagicLeapAudio.MagicLeapAudioFunctionLibrary.IsMicMuted
// 0x0001 (0x0001 - 0x0000)
struct MagicLeapAudioFunctionLibrary_IsMicMuted final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MagicLeapAudioFunctionLibrary_IsMicMuted;

// Function MagicLeapAudio.MagicLeapAudioFunctionLibrary.SetMicMute
// 0x0002 (0x0002 - 0x0000)
struct MagicLeapAudioFunctionLibrary_SetMicMute final
{
public:
	bool                                          IsMuted;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MagicLeapAudioFunctionLibrary_SetMicMute;

// Function MagicLeapAudio.MagicLeapAudioFunctionLibrary.SetOnAudioJackPluggedDelegate
// 0x0014 (0x0014 - 0x0000)
struct MagicLeapAudioFunctionLibrary_SetOnAudioJackPluggedDelegate final
{
public:
	TDelegate<void()>                             ResultDelegate;                                    // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_MagicLeapAudioFunctionLibrary_SetOnAudioJackPluggedDelegate;

// Function MagicLeapAudio.MagicLeapAudioFunctionLibrary.SetOnAudioJackUnpluggedDelegate
// 0x0014 (0x0014 - 0x0000)
struct MagicLeapAudioFunctionLibrary_SetOnAudioJackUnpluggedDelegate final
{
public:
	TDelegate<void()>                             ResultDelegate;                                    // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_MagicLeapAudioFunctionLibrary_SetOnAudioJackUnpluggedDelegate;

}

