#pragma once

/*
* SDK generated by Rei-SdkDumper
* Based on Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MagicLeap

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "MagicLeap_structs.hpp"
#include "Engine_classes.hpp"
#include "HeadMountedDisplay_classes.hpp"


namespace SDK
{

// Class MagicLeap.MagicLeapSettings
// 0x0008 (0x0030 - 0x0028)
class UMagicLeapSettings final : public UObject
{
public:
	bool                                          bEnableZI;                                         // 0x0028(0x0001)(Edit, ZeroConstructor, Config, GlobalConfig, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseVulkanForZI;                                   // 0x0029(0x0001)(ZeroConstructor, Config, GlobalConfig, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseMLAudioForZI;                                  // 0x002A(0x0001)(Edit, ZeroConstructor, Config, GlobalConfig, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2B[0x5];                                       // 0x002B(0x0005)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MagicLeapSettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MagicLeapSettings")
	}
	static class UMagicLeapSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMagicLeapSettings>();
	}
};
DUMPER7_ASSERTS_UMagicLeapSettings;

// Class MagicLeap.InAppPurchaseComponent
// 0x0078 (0x0128 - 0x00B0)
class UInAppPurchaseComponent final : public UActorComponent
{
public:
	TMulticastInlineDelegate<void(const class FString& LogMessage)> InAppPurchaseLogMessage;         // 0x00B0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const TArray<struct FPurchaseItemDetails>& ItemsDetails)> GetItemsDetailsSuccess; // 0x00C0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              GetItemsDetailsFailure;                            // 0x00D0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const struct FPurchaseConfirmation& PurchaseConfirmations)> PurchaseConfirmationSuccess; // 0x00E0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              PurchaseConfirmationFailure;                       // 0x00F0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const TArray<struct FPurchaseConfirmation>& PurchaseHistory)> GetPurchaseHistorySuccess; // 0x0100(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              GetPurchaseHistoryFailure;                         // 0x0110(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_120[0x8];                                      // 0x0120(0x0008)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])

public:
	bool TryGetItemsDetailsAsync(const TArray<class FString>& ItemIDs);
	bool TryGetPurchaseHistoryAsync(int32 InNumPages);
	bool TryPurchaseItemAsync(const struct FPurchaseItemDetails& ItemDetails);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("InAppPurchaseComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"InAppPurchaseComponent")
	}
	static class UInAppPurchaseComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInAppPurchaseComponent>();
	}
};
DUMPER7_ASSERTS_UInAppPurchaseComponent;

// Class MagicLeap.MagicLeapRaycastComponent
// 0x0068 (0x0118 - 0x00B0)
class UMagicLeapRaycastComponent final : public UActorComponent
{
public:
	uint8                                         Pad_B0[0x68];                                      // 0x00B0(0x0068)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])

public:
	bool RequestRaycast(const struct FMagicLeapRaycastQueryParams& RequestParams, const TDelegate<void(const struct FMagicLeapRaycastHitResult& HitResult)>& ResultDelegate);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MagicLeapRaycastComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MagicLeapRaycastComponent")
	}
	static class UMagicLeapRaycastComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMagicLeapRaycastComponent>();
	}
};
DUMPER7_ASSERTS_UMagicLeapRaycastComponent;

// Class MagicLeap.LuminApplicationLifecycleComponent
// 0x0050 (0x0190 - 0x0140)
class ULuminApplicationLifecycleComponent final : public UApplicationLifecycleComponent
{
public:
	TMulticastInlineDelegate<void()>              DeviceHasReactivatedDelegate;                      // 0x0140(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              DeviceWillEnterRealityModeDelegate;                // 0x0150(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              DeviceWillGoInStandbyDelegate;                     // 0x0160(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(EFocusLostReason Reason)> FocusLostDelegate;                       // 0x0170(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              FocusGainedDelegate;                               // 0x0180(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("LuminApplicationLifecycleComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"LuminApplicationLifecycleComponent")
	}
	static class ULuminApplicationLifecycleComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULuminApplicationLifecycleComponent>();
	}
};
DUMPER7_ASSERTS_ULuminApplicationLifecycleComponent;

// Class MagicLeap.MagicLeapHeadTrackingNotificationsComponent
// 0x0090 (0x01D0 - 0x0140)
class UMagicLeapHeadTrackingNotificationsComponent final : public UVRNotificationsComponent
{
public:
	TMulticastInlineDelegate<void()>              OnHeadTrackingLost;                                // 0x0140(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPrivate)
	TMulticastInlineDelegate<void()>              OnHeadTrackingRecovered;                           // 0x0150(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPrivate)
	TMulticastInlineDelegate<void()>              OnHeadTrackingRecoveryFailed;                      // 0x0160(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPrivate)
	TMulticastInlineDelegate<void()>              OnHeadTrackingNewSessionStarted;                   // 0x0170(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPrivate)
	uint8                                         Pad_180[0x50];                                     // 0x0180(0x0050)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MagicLeapHeadTrackingNotificationsComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MagicLeapHeadTrackingNotificationsComponent")
	}
	static class UMagicLeapHeadTrackingNotificationsComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMagicLeapHeadTrackingNotificationsComponent>();
	}
};
DUMPER7_ASSERTS_UMagicLeapHeadTrackingNotificationsComponent;

// Class MagicLeap.MagicLeapHMDFunctionLibrary
// 0x0000 (0x0028 - 0x0028)
class UMagicLeapHMDFunctionLibrary final : public UBlueprintFunctionLibrary
{
public:
	static bool GetGraphicsClientPerformanceInfo(struct FMagicLeapGraphicsClientPerformanceInfo* PerformanceInfo);
	static bool GetHeadTrackingMapEvents(TSet<EMagicLeapHeadTrackingMapEvent>* MapEvents);
	static bool GetHeadTrackingState(struct FMagicLeapHeadTrackingState* State);
	static int32 GetMinimumAPILevel();
	static class FString GetMLSDKVersion();
	static int32 GetMLSDKVersionMajor();
	static int32 GetMLSDKVersionMinor();
	static int32 GetMLSDKVersionRevision();
	static int32 GetPlatformAPILevel();
	static bool IsRunningOnMagicLeapHMD();
	static bool SetAppReady();
	static void SetBaseOrientation(const struct FQuat& InBaseOrientation);
	static void SetBasePosition(const struct FVector& InBasePosition);
	static void SetBaseRotation(const struct FRotator& InBaseRotation);
	static void SetFocusActor(const class AActor* InFocusActor, bool bSetStabilizationActor);
	static void SetStabilizationDepthActor(const class AActor* InStabilizationDepthActor, bool bSetFocusActor);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MagicLeapHMDFunctionLibrary")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MagicLeapHMDFunctionLibrary")
	}
	static class UMagicLeapHMDFunctionLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMagicLeapHMDFunctionLibrary>();
	}
};
DUMPER7_ASSERTS_UMagicLeapHMDFunctionLibrary;

// Class MagicLeap.MagicLeapMeshTrackerComponent
// 0x0090 (0x0290 - 0x0200)
class UMagicLeapMeshTrackerComponent final : public USceneComponent
{
public:
	uint8                                         Pad_1F8[0x8];                                      // 0x01F8(0x0008)(Fixing Size After Last Property [ Rei-SdkDumper ])
	TMulticastInlineDelegate<void(const struct FGuid& ID, const TArray<struct FVector>& Vertices, const TArray<int32>& Triangles, const TArray<struct FVector>& Normals, const TArray<float>& Confidence)> OnMeshTrackerUpdated; // 0x0200(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	bool                                          ScanWorld;                                         // 0x0210(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EMagicLeapMeshType                            MeshType;                                          // 0x0211(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_212[0x6];                                      // 0x0212(0x0006)(Fixing Size After Last Property [ Rei-SdkDumper ])
	class UBoxComponent*                          BoundingVolume;                                    // 0x0218(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EMagicLeapMeshLOD                             LevelOfDetail;                                     // 0x0220(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_221[0x3];                                      // 0x0221(0x0003)(Fixing Size After Last Property [ Rei-SdkDumper ])
	float                                         PerimeterOfGapsToFill;                             // 0x0224(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Planarize;                                         // 0x0228(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_229[0x3];                                      // 0x0229(0x0003)(Fixing Size After Last Property [ Rei-SdkDumper ])
	float                                         DisconnectedSectionArea;                           // 0x022C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          RequestNormals;                                    // 0x0230(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          RequestVertexConfidence;                           // 0x0231(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EMagicLeapMeshVertexColorMode                 VertexColorMode;                                   // 0x0232(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_233[0x5];                                      // 0x0233(0x0005)(Fixing Size After Last Property [ Rei-SdkDumper ])
	TArray<struct FColor>                         BlockVertexColors;                                 // 0x0238(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	struct FLinearColor                           VertexColorFromConfidenceZero;                     // 0x0248(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           VertexColorFromConfidenceOne;                      // 0x0258(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          RemoveOverlappingTriangles;                        // 0x0268(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_269[0x7];                                      // 0x0269(0x0007)(Fixing Size After Last Property [ Rei-SdkDumper ])
	class UMRMeshComponent*                       MRMesh;                                            // 0x0270(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         BricksPerFrame;                                    // 0x0278(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_27C[0x14];                                     // 0x027C(0x0014)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])

public:
	void ConnectBlockSelector(TScriptInterface<class IMagicLeapMeshBlockSelectorInterface> Selector);
	void ConnectMRMesh(class UMRMeshComponent* InMRMeshPtr);
	void DisconnectBlockSelector();
	void DisconnectMRMesh(class UMRMeshComponent* InMRMeshPtr);
	int32 GetNumQueuedBlockUpdates();
	void SelectMeshBlocks(const struct FMagicLeapTrackingMeshInfo& NewMeshInfo, TArray<struct FMagicLeapMeshBlockRequest>* RequestedMesh);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MagicLeapMeshTrackerComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MagicLeapMeshTrackerComponent")
	}
	static class UMagicLeapMeshTrackerComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMagicLeapMeshTrackerComponent>();
	}
};
DUMPER7_ASSERTS_UMagicLeapMeshTrackerComponent;

// Class MagicLeap.MagicLeapMeshBlockSelectorInterface
// 0x0000 (0x0000 - 0x0000)
class IMagicLeapMeshBlockSelectorInterface final
{
public:
	void SelectMeshBlocks(const struct FMagicLeapTrackingMeshInfo& NewMeshInfo, TArray<struct FMagicLeapMeshBlockRequest>* RequestedMesh);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MagicLeapMeshBlockSelectorInterface")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MagicLeapMeshBlockSelectorInterface")
	}
	static class IMagicLeapMeshBlockSelectorInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IMagicLeapMeshBlockSelectorInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IMagicLeapMeshBlockSelectorInterface;

// Class MagicLeap.MagicLeapRaycastFunctionLibrary
// 0x0000 (0x0028 - 0x0028)
class UMagicLeapRaycastFunctionLibrary final : public UBlueprintFunctionLibrary
{
public:
	static struct FMagicLeapRaycastQueryParams MakeRaycastQueryParams(const struct FVector& Position, const struct FVector& Direction, const struct FVector& UpVector, int32 Width, int32 Height, float HorizontalFovDegrees, bool CollideWithUnobserved, int32 UserData);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MagicLeapRaycastFunctionLibrary")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MagicLeapRaycastFunctionLibrary")
	}
	static class UMagicLeapRaycastFunctionLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMagicLeapRaycastFunctionLibrary>();
	}
};
DUMPER7_ASSERTS_UMagicLeapRaycastFunctionLibrary;

}

