#pragma once

/*
* SDK generated by Rei-SdkDumper
* Based on Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MagicLeapImageTracker

#include "Basic.hpp"


namespace SDK::Params
{

// Function MagicLeapImageTracker.MagicLeapImageTrackerComponent.RemoveTargetAsync
// 0x0001 (0x0001 - 0x0000)
struct MagicLeapImageTrackerComponent_RemoveTargetAsync final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MagicLeapImageTrackerComponent_RemoveTargetAsync;

// Function MagicLeapImageTracker.MagicLeapImageTrackerComponent.SetTargetAsync
// 0x0010 (0x0010 - 0x0000)
struct MagicLeapImageTrackerComponent_SetTargetAsync final
{
public:
	class UTexture2D*                             ImageTarget;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_MagicLeapImageTrackerComponent_SetTargetAsync;

// Function MagicLeapImageTracker.MagicLeapImageTrackerFunctionLibrary.EnableImageTracking
// 0x0001 (0x0001 - 0x0000)
struct MagicLeapImageTrackerFunctionLibrary_EnableImageTracking final
{
public:
	bool                                          bEnable;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MagicLeapImageTrackerFunctionLibrary_EnableImageTracking;

// Function MagicLeapImageTracker.MagicLeapImageTrackerFunctionLibrary.GetMaxSimultaneousTargets
// 0x0004 (0x0004 - 0x0000)
struct MagicLeapImageTrackerFunctionLibrary_GetMaxSimultaneousTargets final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MagicLeapImageTrackerFunctionLibrary_GetMaxSimultaneousTargets;

// Function MagicLeapImageTracker.MagicLeapImageTrackerFunctionLibrary.IsImageTrackingEnabled
// 0x0001 (0x0001 - 0x0000)
struct MagicLeapImageTrackerFunctionLibrary_IsImageTrackingEnabled final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MagicLeapImageTrackerFunctionLibrary_IsImageTrackingEnabled;

// Function MagicLeapImageTracker.MagicLeapImageTrackerFunctionLibrary.SetMaxSimultaneousTargets
// 0x0004 (0x0004 - 0x0000)
struct MagicLeapImageTrackerFunctionLibrary_SetMaxSimultaneousTargets final
{
public:
	int32                                         MaxSimultaneousTargets;                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MagicLeapImageTrackerFunctionLibrary_SetMaxSimultaneousTargets;

}

