#pragma once

/*
* SDK generated by Rei-SdkDumper
* Based on Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MagicLeapAR

#include "Basic.hpp"

#include "Engine_classes.hpp"
#include "MagicLeapAR_structs.hpp"
#include "AugmentedReality_classes.hpp"
#include "MagicLeapImageTracker_structs.hpp"
#include "MagicLeapPlanes_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// Class MagicLeapAR.LuminARSessionFunctionLibrary
// 0x0000 (0x0028 - 0x0028)
class ULuminARSessionFunctionLibrary final : public UBlueprintFunctionLibrary
{
public:
	static void StartLuminARSession(class UObject* WorldContextObject, const struct FLatentActionInfo& LatentInfo, class ULuminARSessionConfig* Configuration);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("LuminARSessionFunctionLibrary")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"LuminARSessionFunctionLibrary")
	}
	static class ULuminARSessionFunctionLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULuminARSessionFunctionLibrary>();
	}
};
DUMPER7_ASSERTS_ULuminARSessionFunctionLibrary;

// Class MagicLeapAR.LuminARFrameFunctionLibrary
// 0x0000 (0x0028 - 0x0028)
class ULuminARFrameFunctionLibrary final : public UBlueprintFunctionLibrary
{
public:
	static ELuminARTrackingState GetTrackingState();
	static bool LuminARLineTrace(class UObject* WorldContextObject, const struct FVector2D& ScreenPosition, const TSet<ELuminARLineTraceChannel>& TraceChannels, TArray<struct FARTraceResult>* OutHitResults);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("LuminARFrameFunctionLibrary")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"LuminARFrameFunctionLibrary")
	}
	static class ULuminARFrameFunctionLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULuminARFrameFunctionLibrary>();
	}
};
DUMPER7_ASSERTS_ULuminARFrameFunctionLibrary;

// Class MagicLeapAR.LuminARLightEstimate
// 0x0010 (0x0050 - 0x0040)
class ULuminARLightEstimate final : public UARBasicLightEstimate
{
public:
	TArray<float>                                 AmbientIntensityNits;                              // 0x0040(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)

public:
	TArray<float> GetAmbientIntensityNits() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("LuminARLightEstimate")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"LuminARLightEstimate")
	}
	static class ULuminARLightEstimate* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULuminARLightEstimate>();
	}
};
DUMPER7_ASSERTS_ULuminARLightEstimate;

// Class MagicLeapAR.LuminARImageTrackingFunctionLibrary
// 0x0000 (0x0028 - 0x0028)
class ULuminARImageTrackingFunctionLibrary final : public UBlueprintFunctionLibrary
{
public:
	static class ULuminARCandidateImage* AddLuminRuntimeCandidateImage(class UARSessionConfig* SessionConfig, class UTexture2D* CandidateTexture, const class FString& FriendlyName, float PhysicalWidth, bool bUseUnreliablePose, bool bImageIsStationary);
	static class ULuminARCandidateImage* AddLuminRuntimeCandidateImageEx(class UARSessionConfig* SessionConfig, class UTexture2D* CandidateTexture, const class FString& FriendlyName, float PhysicalWidth, bool bUseUnreliablePose, bool bImageIsStationary, EMagicLeapImageTargetOrientation InAxisOrientation);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("LuminARImageTrackingFunctionLibrary")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"LuminARImageTrackingFunctionLibrary")
	}
	static class ULuminARImageTrackingFunctionLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULuminARImageTrackingFunctionLibrary>();
	}
};
DUMPER7_ASSERTS_ULuminARImageTrackingFunctionLibrary;

// Class MagicLeapAR.LuminAROrigin
// 0x00C0 (0x02E8 - 0x0228)
class ALuminAROrigin final : public AAROriginActor
{
public:
	class UMRMeshComponent*                       MRMeshComponent;                                   // 0x0228(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UMaterialInterface*                     PlaneSurfaceMaterial;                              // 0x0230(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UMaterialInterface*                     WireframeMaterial;                                 // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_240[0xA8];                                     // 0x0240(0x00A8)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("LuminAROrigin")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"LuminAROrigin")
	}
	static class ALuminAROrigin* GetDefaultObj()
	{
		return GetDefaultObjImpl<ALuminAROrigin>();
	}
};
DUMPER7_ASSERTS_ALuminAROrigin;

// Class MagicLeapAR.LuminARSessionConfig
// 0x0090 (0x01A0 - 0x0110)
class ULuminARSessionConfig final : public UARSessionConfig
{
public:
	struct FMagicLeapPlanesQuery                  PlanesQuery;                                       // 0x0110(0x0060)(Edit, ContainsInstancedReference, NativeAccessSpecifierPublic)
	int32                                         MaxPlaneQueryResults;                              // 0x0170(0x0004)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MinPlaneArea;                                      // 0x0174(0x0004)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bArbitraryOrientationPlaneDetection;               // 0x0178(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_179[0x3];                                      // 0x0179(0x0003)(Fixing Size After Last Property [ Rei-SdkDumper ])
	struct FVector                                PlaneSearchExtents;                                // 0x017C(0x000C)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<EMagicLeapPlaneQueryFlags>             PlaneQueryFlags;                                   // 0x0188(0x0010)(ZeroConstructor, Deprecated, NativeAccessSpecifierPublic)
	bool                                          bDiscardZeroExtentPlanes;                          // 0x0198(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDefaultUseUnreliablePose;                         // 0x0199(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19A[0x6];                                      // 0x019A(0x0006)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("LuminARSessionConfig")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"LuminARSessionConfig")
	}
	static class ULuminARSessionConfig* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULuminARSessionConfig>();
	}
};
DUMPER7_ASSERTS_ULuminARSessionConfig;

// Class MagicLeapAR.LuminARCandidateImage
// 0x0008 (0x0060 - 0x0058)
class ULuminARCandidateImage final : public UARCandidateImage
{
public:
	bool                                          bUseUnreliablePose;                                // 0x0058(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bImageIsStationary;                                // 0x0059(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	EMagicLeapImageTargetOrientation              AxisOrientation;                                   // 0x005A(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_5B[0x5];                                       // 0x005B(0x0005)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])

public:
	EMagicLeapImageTargetOrientation GetAxisOrientation() const;
	bool GetImageIsStationary() const;
	bool GetUseUnreliablePose() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("LuminARCandidateImage")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"LuminARCandidateImage")
	}
	static class ULuminARCandidateImage* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULuminARCandidateImage>();
	}
};
DUMPER7_ASSERTS_ULuminARCandidateImage;

}

