#pragma once

/*
* SDK generated by Rei-SdkDumper
* Based on Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MagicLeapController

#include "Basic.hpp"

#include "Engine_classes.hpp"
#include "InputCore_structs.hpp"
#include "MagicLeapController_structs.hpp"


namespace SDK
{

// Class MagicLeapController.MagicLeapControllerFunctionLibrary
// 0x0000 (0x0028 - 0x0028)
class UMagicLeapControllerFunctionLibrary final : public UBlueprintFunctionLibrary
{
public:
	static bool GetControllerMapping(int32 ControllerIndex, EControllerHand* Hand);
	static EMagicLeapControllerTrackingMode GetControllerTrackingMode();
	static EMagicLeapControllerType GetControllerType(class FName MotionSource);
	static EControllerHand GetHandForMotionSource(class FName MotionSource);
	static EMagicLeapControllerType GetMLControllerType(EControllerHand Hand);
	static class FName GetMotionSourceForHand(EControllerHand Hand);
	static void InvertControllerMapping();
	static bool IsMLControllerConnected(class FName MotionSource);
	static int32 MaxSupportedMagicLeapControllers();
	static bool PlayControllerHapticFeedback(EControllerHand Hand, EMagicLeapControllerHapticPattern HapticPattern, EMagicLeapControllerHapticIntensity Intensity);
	static bool PlayControllerLED(EControllerHand Hand, EMagicLeapControllerLEDPattern LEDPattern, EMagicLeapControllerLEDColor LEDColor, float DurationInSec);
	static bool PlayControllerLEDEffect(EControllerHand Hand, EMagicLeapControllerLEDEffect LEDEffect, EMagicLeapControllerLEDSpeed LEDSpeed, EMagicLeapControllerLEDPattern LEDPattern, EMagicLeapControllerLEDColor LEDColor, float DurationInSec);
	static bool PlayHapticPattern(class FName MotionSource, EMagicLeapControllerHapticPattern HapticPattern, EMagicLeapControllerHapticIntensity Intensity);
	static bool PlayLEDEffect(class FName MotionSource, EMagicLeapControllerLEDEffect LEDEffect, EMagicLeapControllerLEDSpeed LEDSpeed, EMagicLeapControllerLEDPattern LEDPattern, EMagicLeapControllerLEDColor LEDColor, float DurationInSec);
	static bool PlayLEDPattern(class FName MotionSource, EMagicLeapControllerLEDPattern LEDPattern, EMagicLeapControllerLEDColor LEDColor, float DurationInSec);
	static bool SetControllerTrackingMode(EMagicLeapControllerTrackingMode TrackingMode);
	static bool SetMotionSourceForHand(EControllerHand Hand, class FName MotionSource);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MagicLeapControllerFunctionLibrary")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MagicLeapControllerFunctionLibrary")
	}
	static class UMagicLeapControllerFunctionLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMagicLeapControllerFunctionLibrary>();
	}
};
DUMPER7_ASSERTS_UMagicLeapControllerFunctionLibrary;

// Class MagicLeapController.MagicLeapTouchpadGesturesComponent
// 0x0090 (0x0140 - 0x00B0)
class UMagicLeapTouchpadGesturesComponent final : public UActorComponent
{
public:
	uint8                                         Pad_B0[0x8];                                       // 0x00B0(0x0008)(Fixing Size After Last Property [ Rei-SdkDumper ])
	TMulticastInlineDelegate<void(const struct FMagicLeapTouchpadGesture& GestureData)> OnTouchpadGestureStart; // 0x00B8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const struct FMagicLeapTouchpadGesture& GestureData)> OnTouchpadGestureContinue; // 0x00C8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const struct FMagicLeapTouchpadGesture& GestureData)> OnTouchpadGestureEnd; // 0x00D8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_E8[0x58];                                      // 0x00E8(0x0058)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MagicLeapTouchpadGesturesComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MagicLeapTouchpadGesturesComponent")
	}
	static class UMagicLeapTouchpadGesturesComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMagicLeapTouchpadGesturesComponent>();
	}
};
DUMPER7_ASSERTS_UMagicLeapTouchpadGesturesComponent;

}

