#pragma once

/*
* SDK generated by Rei-SdkDumper
* Based on Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MiniGame

#include "Basic.hpp"

#include "MiniGame_structs.hpp"


namespace SDK::Params
{

// Function MiniGame.MiniGameHandler.FindPlayerDataByPlayerID
// 0x0028 (0x0028 - 0x0000)
struct MiniGameHandler_FindPlayerDataByPlayerID final
{
public:
	int64                                         InId;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMiniGamePlayerData                    ReturnValue;                                       // 0x0008(0x0020)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MiniGameHandler_FindPlayerDataByPlayerID;

// Function MiniGame.MiniGameHandler.GetTaskAttribute
// 0x0020 (0x0020 - 0x0000)
struct MiniGameHandler_GetTaskAttribute final
{
public:
	class FString                                 NetUniqueId;                                       // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         TaskGroup;                                         // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         TaskId;                                            // 0x0014(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0018(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_MiniGameHandler_GetTaskAttribute;

// Function MiniGame.MiniGameHandler.HandleCharacterHasEnded
// 0x0008 (0x0008 - 0x0000)
struct MiniGameHandler_HandleCharacterHasEnded final
{
public:
	class AMiniGamePlayerController*              InController;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MiniGameHandler_HandleCharacterHasEnded;

// Function MiniGame.MiniGameHandler.NotifyExitRoom
// 0x0010 (0x0010 - 0x0000)
struct MiniGameHandler_NotifyExitRoom final
{
public:
	class FString                                 InReason;                                          // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MiniGameHandler_NotifyExitRoom;

// Function MiniGame.MiniGameHandler.SetForceCloseRoom
// 0x0010 (0x0010 - 0x0000)
struct MiniGameHandler_SetForceCloseRoom final
{
public:
	class FString                                 InReason;                                          // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MiniGameHandler_SetForceCloseRoom;

// Function MiniGame.MiniGamePlayerController.IsMiniGamePlayerController
// 0x0010 (0x0010 - 0x0000)
struct MiniGamePlayerController_IsMiniGamePlayerController final
{
public:
	class UWorld*                                 InWorld;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_MiniGamePlayerController_IsMiniGamePlayerController;

// Function MiniGame.MiniGamePlayerController.ClientShowDSDebugInfo
// 0x0030 (0x0030 - 0x0000)
struct MiniGamePlayerController_ClientShowDSDebugInfo final
{
public:
	struct FMiniGameDSDebugInfo                   DSDebugInfo;                                       // 0x0000(0x0030)(ConstParm, Parm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MiniGamePlayerController_ClientShowDSDebugInfo;

}

