#pragma once

/*
* SDK generated by Rei-SdkDumper
* Based on Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MiniGame

#include "Basic.hpp"

#include "Engine_classes.hpp"
#include "MiniGame_structs.hpp"


namespace SDK
{

// Class MiniGame.MiniGameHandler
// 0x0090 (0x02B8 - 0x0228)
class AMiniGameHandler : public AActor
{
public:
	TMap<class FString, struct FMiniGamePlayerData> PlayerDatas;                                     // 0x0228(0x0050)(Transient, NativeAccessSpecifierPublic)
	TArray<class AMiniGamePlayerController*>      OnlinePlayerControllers;                           // 0x0278(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPublic)
	int32                                         RoomId;                                            // 0x0288(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         CurrentLevelId;                                    // 0x028C(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RoomMaxLifeTime;                                   // 0x0290(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RoomCurrentTime;                                   // 0x0294(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RoomCurrentRealTime;                               // 0x0298(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MaxOfflineTime;                                    // 0x029C(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bForceCloseRoom;                                   // 0x02A0(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2A1[0x7];                                      // 0x02A1(0x0007)(Fixing Size After Last Property [ Rei-SdkDumper ])
	class FString                                 ForceCloseRoomReason;                              // 0x02A8(0x0010)(ZeroConstructor, Transient, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	struct FMiniGamePlayerData FindPlayerDataByPlayerID(int64 InId);
	int32 GetTaskAttribute(const class FString& NetUniqueId, int32 TaskGroup, int32 TaskId);
	void HandleCharacterHasEnded(class AMiniGamePlayerController* InController);
	void NotifyCloseAllConnection();
	void NotifyExitRoom(const class FString& InReason);
	void NotifyMatchEnd();
	void NotifyStartMatch();
	void SetForceCloseRoom(const class FString& InReason);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MiniGameHandler")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MiniGameHandler")
	}
	static class AMiniGameHandler* GetDefaultObj()
	{
		return GetDefaultObjImpl<AMiniGameHandler>();
	}
};
DUMPER7_ASSERTS_AMiniGameHandler;

// Class MiniGame.MiniGamePlayerController
// 0x0020 (0x0598 - 0x0578)
class AMiniGamePlayerController : public APlayerController
{
public:
	bool                                          LastInputGamepad;                                  // 0x0578(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_579[0x7];                                      // 0x0579(0x0007)(Fixing Size After Last Property [ Rei-SdkDumper ])
	class AMiniGameHandler*                       GameHandler;                                       // 0x0580(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_588[0x10];                                     // 0x0588(0x0010)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])

public:
	static bool IsMiniGamePlayerController(class UWorld* InWorld);

	void ClientShowDSDebugInfo(const struct FMiniGameDSDebugInfo& DSDebugInfo);
	void ResetLastInputTime();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MiniGamePlayerController")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MiniGamePlayerController")
	}
	static class AMiniGamePlayerController* GetDefaultObj()
	{
		return GetDefaultObjImpl<AMiniGamePlayerController>();
	}
};
DUMPER7_ASSERTS_AMiniGamePlayerController;

// Class MiniGame.MiniGame_GameMode
// 0x0008 (0x0318 - 0x0310)
class AMiniGame_GameMode final : public AGameMode
{
public:
	TWeakObjectPtr<class AMiniGameHandler>        Handler;                                           // 0x0310(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MiniGame_GameMode")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MiniGame_GameMode")
	}
	static class AMiniGame_GameMode* GetDefaultObj()
	{
		return GetDefaultObjImpl<AMiniGame_GameMode>();
	}
};
DUMPER7_ASSERTS_AMiniGame_GameMode;

}

