#pragma once

/*
* SDK generated by Rei-SdkDumper
* Based on Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MobilePatchingUtils

#include "Basic.hpp"


namespace SDK::Params
{

// Function MobilePatchingUtils.MobileInstalledContent.GetDiskFreeSpace
// 0x0004 (0x0004 - 0x0000)
struct MobileInstalledContent_GetDiskFreeSpace final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MobileInstalledContent_GetDiskFreeSpace;

// Function MobilePatchingUtils.MobileInstalledContent.GetInstalledContentSize
// 0x0004 (0x0004 - 0x0000)
struct MobileInstalledContent_GetInstalledContentSize final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MobileInstalledContent_GetInstalledContentSize;

// Function MobilePatchingUtils.MobileInstalledContent.Mount
// 0x0020 (0x0020 - 0x0000)
struct MobileInstalledContent_Mount final
{
public:
	int32                                         PakOrder;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Rei-SdkDumper ])
	class FString                                 MountPoint;                                        // 0x0008(0x0010)(Parm, ZeroConstructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_MobileInstalledContent_Mount;

// Function MobilePatchingUtils.MobilePendingContent.GetDownloadSize
// 0x0004 (0x0004 - 0x0000)
struct MobilePendingContent_GetDownloadSize final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MobilePendingContent_GetDownloadSize;

// Function MobilePatchingUtils.MobilePendingContent.GetDownloadSpeed
// 0x0004 (0x0004 - 0x0000)
struct MobilePendingContent_GetDownloadSpeed final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MobilePendingContent_GetDownloadSpeed;

// Function MobilePatchingUtils.MobilePendingContent.GetDownloadStatusText
// 0x0018 (0x0018 - 0x0000)
struct MobilePendingContent_GetDownloadStatusText final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MobilePendingContent_GetDownloadStatusText;

// Function MobilePatchingUtils.MobilePendingContent.GetInstallProgress
// 0x0004 (0x0004 - 0x0000)
struct MobilePendingContent_GetInstallProgress final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MobilePendingContent_GetInstallProgress;

// Function MobilePatchingUtils.MobilePendingContent.GetRequiredDiskSpace
// 0x0004 (0x0004 - 0x0000)
struct MobilePendingContent_GetRequiredDiskSpace final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MobilePendingContent_GetRequiredDiskSpace;

// Function MobilePatchingUtils.MobilePendingContent.GetTotalDownloadedSize
// 0x0004 (0x0004 - 0x0000)
struct MobilePendingContent_GetTotalDownloadedSize final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MobilePendingContent_GetTotalDownloadedSize;

// Function MobilePatchingUtils.MobilePendingContent.StartInstall
// 0x0020 (0x0020 - 0x0000)
struct MobilePendingContent_StartInstall final
{
public:
	TDelegate<void()>                             OnSucceeded;                                       // 0x0000(0x0010)(Parm, ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
	TDelegate<void(class FText ErrorText, int32 ErrorCode)> OnFailed;                                // 0x0010(0x0010)(Parm, ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MobilePendingContent_StartInstall;

// Function MobilePatchingUtils.MobilePatchingLibrary.GetActiveDeviceProfileName
// 0x0010 (0x0010 - 0x0000)
struct MobilePatchingLibrary_GetActiveDeviceProfileName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MobilePatchingLibrary_GetActiveDeviceProfileName;

// Function MobilePatchingUtils.MobilePatchingLibrary.GetInstalledContent
// 0x0018 (0x0018 - 0x0000)
struct MobilePatchingLibrary_GetInstalledContent final
{
public:
	class FString                                 InstallDirectory;                                  // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMobileInstalledContent*                ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MobilePatchingLibrary_GetInstalledContent;

// Function MobilePatchingUtils.MobilePatchingLibrary.GetSupportedPlatformNames
// 0x0010 (0x0010 - 0x0000)
struct MobilePatchingLibrary_GetSupportedPlatformNames final
{
public:
	TArray<class FString>                         ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MobilePatchingLibrary_GetSupportedPlatformNames;

// Function MobilePatchingUtils.MobilePatchingLibrary.HasActiveWiFiConnection
// 0x0001 (0x0001 - 0x0000)
struct MobilePatchingLibrary_HasActiveWiFiConnection final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MobilePatchingLibrary_HasActiveWiFiConnection;

// Function MobilePatchingUtils.MobilePatchingLibrary.RequestContent
// 0x0050 (0x0050 - 0x0000)
struct MobilePatchingLibrary_RequestContent final
{
public:
	class FString                                 RemoteManifestURL;                                 // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 CloudURL;                                          // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 InstallDirectory;                                  // 0x0020(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(class UMobilePendingContent* MobilePendingContent)> OnSucceeded;                  // 0x0030(0x0010)(Parm, ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
	TDelegate<void(class FText ErrorText, int32 ErrorCode)> OnFailed;                                // 0x0040(0x0010)(Parm, ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MobilePatchingLibrary_RequestContent;

}

