#pragma once

/*
* SDK generated by Rei-SdkDumper
* Based on Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MotionTrajectory

#include "Basic.hpp"

#include "MotionTrajectory_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function MotionTrajectory.MotionTrajectoryComponent.SetSampleRate
// 0x0004 (0x0004 - 0x0000)
struct MotionTrajectoryComponent_SetSampleRate final
{
public:
	int32                                         Rate;                                              // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MotionTrajectoryComponent_SetSampleRate;

// Function MotionTrajectory.MotionTrajectoryComponent.GetHistory
// 0x0018 (0x0018 - 0x0000)
struct MotionTrajectoryComponent_GetHistory final
{
public:
	struct FTrajectorySampleRange                 ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MotionTrajectoryComponent_GetHistory;

// Function MotionTrajectory.MotionTrajectoryComponent.GetTrajectory
// 0x0018 (0x0018 - 0x0000)
struct MotionTrajectoryComponent_GetTrajectory final
{
public:
	struct FTrajectorySampleRange                 ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MotionTrajectoryComponent_GetTrajectory;

// Function MotionTrajectory.MotionTrajectoryComponent.GetTrajectoryWithSettings
// 0x0028 (0x0028 - 0x0000)
struct MotionTrajectoryComponent_GetTrajectoryWithSettings final
{
public:
	struct FMotionTrajectorySettings              Settings;                                          // 0x0000(0x000C)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bIncludeHistory;                                   // 0x000C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Rei-SdkDumper ])
	struct FTrajectorySampleRange                 ReturnValue;                                       // 0x0010(0x0018)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MotionTrajectoryComponent_GetTrajectoryWithSettings;

// Function MotionTrajectory.CharacterMovementTrajectoryComponent.OnMovementUpdated
// 0x001C (0x001C - 0x0000)
struct CharacterMovementTrajectoryComponent_OnMovementUpdated final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                OldLocation;                                       // 0x0004(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                OldVelocity;                                       // 0x0010(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CharacterMovementTrajectoryComponent_OnMovementUpdated;

// Function MotionTrajectory.MotionTrajectoryBlueprintLibrary.ClampTrajectoryDirection
// 0x0048 (0x0048 - 0x0000)
struct MotionTrajectoryBlueprintLibrary_ClampTrajectoryDirection final
{
public:
	struct FTrajectorySampleRange                 Trajectory;                                        // 0x0000(0x0018)(Parm, NativeAccessSpecifierPublic)
	TArray<struct FTrajectoryDirectionClamp>      Directions;                                        // 0x0018(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          bPreserveRotation;                                 // 0x0028(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Rei-SdkDumper ])
	struct FTrajectorySampleRange                 ReturnValue;                                       // 0x0030(0x0018)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MotionTrajectoryBlueprintLibrary_ClampTrajectoryDirection;

// Function MotionTrajectory.MotionTrajectoryBlueprintLibrary.DebugDrawTrajectory
// 0x0090 (0x0090 - 0x0000)
struct MotionTrajectoryBlueprintLibrary_DebugDrawTrajectory final
{
public:
	const class AActor*                           Actor;                                             // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Size After Last Property [ Rei-SdkDumper ])
	struct FTransform                             WorldTransform;                                    // 0x0010(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FTrajectorySampleRange                 Trajectory;                                        // 0x0040(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FLinearColor                           PredictionColor;                                   // 0x0058(0x0010)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           HistoryColor;                                      // 0x0068(0x0010)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TransformScale;                                    // 0x0078(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TransformThickness;                                // 0x007C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ArrowScale;                                        // 0x0080(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ArrowSize;                                         // 0x0084(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ArrowThickness;                                    // 0x0088(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_MotionTrajectoryBlueprintLibrary_DebugDrawTrajectory;

// Function MotionTrajectory.MotionTrajectoryBlueprintLibrary.FlattenTrajectory2D
// 0x0038 (0x0038 - 0x0000)
struct MotionTrajectoryBlueprintLibrary_FlattenTrajectory2D final
{
public:
	struct FTrajectorySampleRange                 Trajectory;                                        // 0x0000(0x0018)(Parm, NativeAccessSpecifierPublic)
	bool                                          PreserveSpeed;                                     // 0x0018(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Rei-SdkDumper ])
	struct FTrajectorySampleRange                 ReturnValue;                                       // 0x0020(0x0018)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MotionTrajectoryBlueprintLibrary_FlattenTrajectory2D;

// Function MotionTrajectory.MotionTrajectoryBlueprintLibrary.GetBunkerCollisionPointWithActorFaceDir
// 0x0040 (0x0040 - 0x0000)
struct MotionTrajectoryBlueprintLibrary_GetBunkerCollisionPointWithActorFaceDir final
{
public:
	const class APawn*                            Actor;                                             // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TraceHeight;                                       // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TraceHeightOffset;                                 // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ValidLengthToStart;                                // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ValidEdgeWidth;                                    // 0x0014(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AngleLimit;                                        // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOnlyLeft;                                         // 0x001C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Rei-SdkDumper ])
	struct FBunkerCollisionPoint                  ReturnValue;                                       // 0x0020(0x001C)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_MotionTrajectoryBlueprintLibrary_GetBunkerCollisionPointWithActorFaceDir;

// Function MotionTrajectory.MotionTrajectoryBlueprintLibrary.GetBunkerShootableWithActorAbove
// 0x0010 (0x0010 - 0x0000)
struct MotionTrajectoryBlueprintLibrary_GetBunkerShootableWithActorAbove final
{
public:
	const class APawn*                            Actor;                                             // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ValidEdgeHeight;                                   // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x000C(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_MotionTrajectoryBlueprintLibrary_GetBunkerShootableWithActorAbove;

// Function MotionTrajectory.MotionTrajectoryBlueprintLibrary.GetBunkerShootableWithActorForward
// 0x0030 (0x0030 - 0x0000)
struct MotionTrajectoryBlueprintLibrary_GetBunkerShootableWithActorForward final
{
public:
	const class APawn*                            Actor;                                             // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                FaceDirection;                                     // 0x0008(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                MoveDirection;                                     // 0x0014(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ShootDirZ;                                         // 0x0020(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ValidEdgeWidth;                                    // 0x0024(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0028(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_MotionTrajectoryBlueprintLibrary_GetBunkerShootableWithActorForward;

// Function MotionTrajectory.MotionTrajectoryBlueprintLibrary.GetBunkerTrajectoryCollisionPoint
// 0x0058 (0x0058 - 0x0000)
struct MotionTrajectoryBlueprintLibrary_GetBunkerTrajectoryCollisionPoint final
{
public:
	const class APawn*                            Actor;                                             // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FTrajectorySampleRange                 Trajectory;                                        // 0x0008(0x0018)(Parm, NativeAccessSpecifierPublic)
	float                                         TraceHeight;                                       // 0x0020(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TraceHeightOffset;                                 // 0x0024(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ValidLengthToStart;                                // 0x0028(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ValidMovePredictionLength;                         // 0x002C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ValidEdgeWidth;                                    // 0x0030(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AngleLimit;                                        // 0x0034(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOnlyLeft;                                         // 0x0038(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Rei-SdkDumper ])
	struct FBunkerCollisionPoint                  ReturnValue;                                       // 0x003C(0x001C)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MotionTrajectoryBlueprintLibrary_GetBunkerTrajectoryCollisionPoint;

// Function MotionTrajectory.MotionTrajectoryBlueprintLibrary.GetCrossCollisionPointWithActorFaceDir
// 0x0040 (0x0040 - 0x0000)
struct MotionTrajectoryBlueprintLibrary_GetCrossCollisionPointWithActorFaceDir final
{
public:
	const class APawn*                            Actor;                                             // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TraceLength;                                       // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TraceHeight;                                       // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ValidLengthToStart;                                // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ValidEdgeWidth;                                    // 0x0014(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AngleLimit;                                        // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOnlyLeft;                                         // 0x001C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Rei-SdkDumper ])
	struct FCrossCollisionPoint                   ReturnValue;                                       // 0x0020(0x001C)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_MotionTrajectoryBlueprintLibrary_GetCrossCollisionPointWithActorFaceDir;

// Function MotionTrajectory.MotionTrajectoryBlueprintLibrary.GetCrossTrajectoryCollisionPoint
// 0x0058 (0x0058 - 0x0000)
struct MotionTrajectoryBlueprintLibrary_GetCrossTrajectoryCollisionPoint final
{
public:
	const class APawn*                            Actor;                                             // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FTrajectorySampleRange                 Trajectory;                                        // 0x0008(0x0018)(Parm, NativeAccessSpecifierPublic)
	float                                         TraceLength;                                       // 0x0020(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TraceHeight;                                       // 0x0024(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ValidLengthToStart;                                // 0x0028(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ValidMovePredictionLength;                         // 0x002C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ValidEdgeWidth;                                    // 0x0030(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AngleLimit;                                        // 0x0034(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOnlyLeft;                                         // 0x0038(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Rei-SdkDumper ])
	struct FCrossCollisionPoint                   ReturnValue;                                       // 0x003C(0x001C)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MotionTrajectoryBlueprintLibrary_GetCrossTrajectoryCollisionPoint;

// Function MotionTrajectory.MotionTrajectoryBlueprintLibrary.IsConstantSpeedTrajectory
// 0x0028 (0x0028 - 0x0000)
struct MotionTrajectoryBlueprintLibrary_IsConstantSpeedTrajectory final
{
public:
	struct FTrajectorySampleRange                 Trajectory;                                        // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	float                                         Speed;                                             // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Tolerance;                                         // 0x001C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_MotionTrajectoryBlueprintLibrary_IsConstantSpeedTrajectory;

// Function MotionTrajectory.MotionTrajectoryBlueprintLibrary.IsStartingTrajectory
// 0x0028 (0x0028 - 0x0000)
struct MotionTrajectoryBlueprintLibrary_IsStartingTrajectory final
{
public:
	struct FTrajectorySampleRange                 Trajectory;                                        // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	float                                         MoveMinSpeed;                                      // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         IdleMaxSpeed;                                      // 0x001C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_MotionTrajectoryBlueprintLibrary_IsStartingTrajectory;

// Function MotionTrajectory.MotionTrajectoryBlueprintLibrary.IsStoppingTrajectory
// 0x0028 (0x0028 - 0x0000)
struct MotionTrajectoryBlueprintLibrary_IsStoppingTrajectory final
{
public:
	struct FTrajectorySampleRange                 Trajectory;                                        // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	float                                         MoveMinSpeed;                                      // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         IdleMaxSpeed;                                      // 0x001C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_MotionTrajectoryBlueprintLibrary_IsStoppingTrajectory;

// Function MotionTrajectory.MotionTrajectoryBlueprintLibrary.MakeTrajectoryRelativeToComponent
// 0x0038 (0x0038 - 0x0000)
struct MotionTrajectoryBlueprintLibrary_MakeTrajectoryRelativeToComponent final
{
public:
	struct FTrajectorySampleRange                 ActorTrajectory;                                   // 0x0000(0x0018)(Parm, NativeAccessSpecifierPublic)
	const class USceneComponent*                  Component;                                         // 0x0018(0x0008)(ConstParm, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FTrajectorySampleRange                 ReturnValue;                                       // 0x0020(0x0018)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MotionTrajectoryBlueprintLibrary_MakeTrajectoryRelativeToComponent;

// Function MotionTrajectory.MotionTrajectoryBlueprintLibrary.RotateTrajectory
// 0x0050 (0x0050 - 0x0000)
struct MotionTrajectoryBlueprintLibrary_RotateTrajectory final
{
public:
	struct FTrajectorySampleRange                 Trajectory;                                        // 0x0000(0x0018)(Parm, NativeAccessSpecifierPublic)
	uint8                                         Pad_18[0x8];                                       // 0x0018(0x0008)(Fixing Size After Last Property [ Rei-SdkDumper ])
	struct FQuat                                  Rotation;                                          // 0x0020(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FTrajectorySampleRange                 ReturnValue;                                       // 0x0030(0x0018)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
	uint8                                         Pad_48[0x8];                                       // 0x0048(0x0008)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_MotionTrajectoryBlueprintLibrary_RotateTrajectory;

}

