#pragma once

/*
* SDK generated by Rei-SdkDumper
* Based on Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MotionTrajectory

#include "Basic.hpp"

#include "MotionTrajectory_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// Class MotionTrajectory.MotionTrajectoryComponent
// 0x0118 (0x01C8 - 0x00B0)
#pragma pack(push, 0x1)
class alignas(0x08) UMotionTrajectoryComponent : public UActorComponent
{
public:
	uint8                                         Pad_B0[0xF0];                                      // 0x00B0(0x00F0)(Fixing Size After Last Property [ Rei-SdkDumper ])
	struct FMotionTrajectorySettings              PredictionSettings;                                // 0x01A0(0x000C)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic)
	struct FMotionTrajectorySettings              HistorySettings;                                   // 0x01AC(0x000C)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic)
	int32                                         SampleRate;                                        // 0x01B8(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MaxSamples;                                        // 0x01BC(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bPredictionIncludesHistory;                        // 0x01C0(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUniformSampledHistory;                            // 0x01C1(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSmoothInterpolation;                              // 0x01C2(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C3[0x5];                                      // 0x01C3(0x0005)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])

public:
	void SetSampleRate(int32 Rate);

	struct FTrajectorySampleRange GetHistory() const;
	struct FTrajectorySampleRange GetTrajectory() const;
	struct FTrajectorySampleRange GetTrajectoryWithSettings(const struct FMotionTrajectorySettings& Settings, bool bIncludeHistory) const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MotionTrajectoryComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MotionTrajectoryComponent")
	}
	static class UMotionTrajectoryComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMotionTrajectoryComponent>();
	}
};
#pragma pack(pop)
DUMPER7_ASSERTS_UMotionTrajectoryComponent;

// Class MotionTrajectory.CharacterMovementTrajectoryComponent
// 0x0018 (0x01E0 - 0x01C8)
class UCharacterMovementTrajectoryComponent final : public UMotionTrajectoryComponent
{
public:
	struct FRotator                               LastDesiredControlRotation;                        // 0x01C8(0x000C)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FRotator                               DesiredControlRotationVelocity;                    // 0x01D4(0x000C)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)

public:
	void OnMovementUpdated(float DeltaSeconds, const struct FVector& OldLocation, const struct FVector& OldVelocity);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CharacterMovementTrajectoryComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CharacterMovementTrajectoryComponent")
	}
	static class UCharacterMovementTrajectoryComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCharacterMovementTrajectoryComponent>();
	}
};
DUMPER7_ASSERTS_UCharacterMovementTrajectoryComponent;

// Class MotionTrajectory.MotionTrajectoryBlueprintLibrary
// 0x0000 (0x0028 - 0x0028)
class UMotionTrajectoryBlueprintLibrary final : public UBlueprintFunctionLibrary
{
public:
	static struct FTrajectorySampleRange ClampTrajectoryDirection(const struct FTrajectorySampleRange& Trajectory, const TArray<struct FTrajectoryDirectionClamp>& Directions, bool bPreserveRotation);
	static void DebugDrawTrajectory(const class AActor* Actor, const struct FTransform& WorldTransform, const struct FTrajectorySampleRange& Trajectory, const struct FLinearColor& PredictionColor, const struct FLinearColor& HistoryColor, float TransformScale, float TransformThickness, float ArrowScale, float ArrowSize, float ArrowThickness);
	static struct FTrajectorySampleRange FlattenTrajectory2D(const struct FTrajectorySampleRange& Trajectory, bool PreserveSpeed);
	static struct FBunkerCollisionPoint GetBunkerCollisionPointWithActorFaceDir(const class APawn* Actor, float TraceHeight, float TraceHeightOffset, float ValidLengthToStart, float ValidEdgeWidth, float AngleLimit, bool bOnlyLeft);
	static bool GetBunkerShootableWithActorAbove(const class APawn* Actor, float ValidEdgeHeight);
	static bool GetBunkerShootableWithActorForward(const class APawn* Actor, const struct FVector& FaceDirection, const struct FVector& MoveDirection, float ShootDirZ, float ValidEdgeWidth);
	static struct FBunkerCollisionPoint GetBunkerTrajectoryCollisionPoint(const class APawn* Actor, const struct FTrajectorySampleRange& Trajectory, float TraceHeight, float TraceHeightOffset, float ValidLengthToStart, float ValidMovePredictionLength, float ValidEdgeWidth, float AngleLimit, bool bOnlyLeft);
	static struct FCrossCollisionPoint GetCrossCollisionPointWithActorFaceDir(const class APawn* Actor, float TraceLength, float TraceHeight, float ValidLengthToStart, float ValidEdgeWidth, float AngleLimit, bool bOnlyLeft);
	static struct FCrossCollisionPoint GetCrossTrajectoryCollisionPoint(const class APawn* Actor, const struct FTrajectorySampleRange& Trajectory, float TraceLength, float TraceHeight, float ValidLengthToStart, float ValidMovePredictionLength, float ValidEdgeWidth, float AngleLimit, bool bOnlyLeft);
	static bool IsConstantSpeedTrajectory(const struct FTrajectorySampleRange& Trajectory, float Speed, float Tolerance);
	static bool IsStartingTrajectory(const struct FTrajectorySampleRange& Trajectory, float MoveMinSpeed, float IdleMaxSpeed);
	static bool IsStoppingTrajectory(const struct FTrajectorySampleRange& Trajectory, float MoveMinSpeed, float IdleMaxSpeed);
	static struct FTrajectorySampleRange MakeTrajectoryRelativeToComponent(const struct FTrajectorySampleRange& ActorTrajectory, const class USceneComponent* Component);
	static struct FTrajectorySampleRange RotateTrajectory(const struct FTrajectorySampleRange& Trajectory, const struct FQuat& Rotation);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MotionTrajectoryBlueprintLibrary")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MotionTrajectoryBlueprintLibrary")
	}
	static class UMotionTrajectoryBlueprintLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMotionTrajectoryBlueprintLibrary>();
	}
};
DUMPER7_ASSERTS_UMotionTrajectoryBlueprintLibrary;

}

