#pragma once

/*
* SDK generated by Rei-SdkDumper
* Based on Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MotoSynth

#include "Basic.hpp"

#include "MotoSynth_structs.hpp"
#include "AudioMixer_classes.hpp"
#include "CoreUObject_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// Class MotoSynth.MotoSynthPreset
// 0x0068 (0x0090 - 0x0028)
class UMotoSynthPreset final : public UObject
{
public:
	struct FMotoSynthRuntimeSettings              Settings;                                          // 0x0028(0x0068)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MotoSynthPreset")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MotoSynthPreset")
	}
	static class UMotoSynthPreset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMotoSynthPreset>();
	}
};
DUMPER7_ASSERTS_UMotoSynthPreset;

// Class MotoSynth.MotoSynthSource
// 0x00D0 (0x00F8 - 0x0028)
class UMotoSynthSource final : public UObject
{
public:
	bool                                          bConvertTo8Bit;                                    // 0x0028(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Rei-SdkDumper ])
	float                                         DownSampleFactor;                                  // 0x002C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRuntimeFloatCurve                     RPMCurve;                                          // 0x0030(0x0088)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	TArray<float>                                 SourceData;                                        // 0x00B8(0x0010)(ZeroConstructor, Deprecated, Protected, NativeAccessSpecifierProtected)
	TArray<int16>                                 SourceDataPCM;                                     // 0x00C8(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	int32                                         SourceSampleRate;                                  // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_DC[0x4];                                       // 0x00DC(0x0004)(Fixing Size After Last Property [ Rei-SdkDumper ])
	TArray<struct FGrainTableEntry>               GrainTable;                                        // 0x00E0(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_F0[0x8];                                       // 0x00F0(0x0008)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MotoSynthSource")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MotoSynthSource")
	}
	static class UMotoSynthSource* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMotoSynthSource>();
	}
};
DUMPER7_ASSERTS_UMotoSynthSource;

// Class MotoSynth.SynthComponentMoto
// 0x00C0 (0x0780 - 0x06C0)
class USynthComponentMoto final : public USynthComponent
{
public:
	class UMotoSynthPreset*                       MotoSynthPreset;                                   // 0x06C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RPM;                                               // 0x06C8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_6CC[0xB4];                                     // 0x06CC(0x00B4)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])

public:
	void GetRPMRange(float* OutMinRPM, float* OutMaxRPM);
	void SetRPM(float InRPM, float InTimeSec);
	void SetSettings(const struct FMotoSynthRuntimeSettings& InSettings);

	bool IsEnabled() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SynthComponentMoto")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SynthComponentMoto")
	}
	static class USynthComponentMoto* GetDefaultObj()
	{
		return GetDefaultObjImpl<USynthComponentMoto>();
	}
};
DUMPER7_ASSERTS_USynthComponentMoto;

}

