#pragma once

/*
* SDK generated by Rei-SdkDumper
* Based on Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NetworkLerpMovement

#include "Basic.hpp"

#include "NetworkLerpMovement_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class NetworkLerpMovement.NetworkLerpComponent
// 0x0160 (0x0210 - 0x00B0)
class UNetworkLerpComponent final : public UActorComponent
{
public:
	struct FNetworkLerpServerUpdate               NetworkLerpServerUpdate;                           // 0x00B0(0x0008)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_B8[0x8];                                       // 0x00B8(0x0008)(Fixing Size After Last Property [ Rei-SdkDumper ])
	struct FNetworkLerpFromTo                     NetworkLerpFromTo;                                 // 0x00C0(0x0070)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FTimerHandle                           ReplicateServerTimeHandle;                         // 0x0130(0x0008)(NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCurveFloat*                            FloatCurve;                                        // 0x0138(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         ClientLerpTimeErrorTolerance;                      // 0x0140(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         ServerReplicateRateInSeconds;                      // 0x0144(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         ServerLerpThreshold;                               // 0x0148(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         ClientMaxTimeBetweenUpdatesInSeconds;              // 0x014C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         ClientCorrectionLerpAlpha;                         // 0x0150(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_154[0xC];                                      // 0x0154(0x000C)(Fixing Size After Last Property [ Rei-SdkDumper ])
	struct FNetworkLerpFromTo                     ServerCachedNetworkLerpFromTo;                     // 0x0160(0x0070)(NoDestructor, Protected, NativeAccessSpecifierProtected)
	float                                         ServerCachedPredictedLerpTime;                     // 0x01D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bDebug;                                            // 0x01D4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1D5[0x3];                                      // 0x01D5(0x0003)(Fixing Size After Last Property [ Rei-SdkDumper ])
	struct FNetworkLerpClientPrediction           ClientPredictionValues;                            // 0x01D8(0x0008)(BlueprintVisible, BlueprintReadOnly, NoDestructor, Protected, NativeAccessSpecifierProtected)
	TMulticastInlineDelegate<void()>              OnLerpComplete;                                    // 0x01E0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnLerpReverse;                                     // 0x01F0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_200[0x10];                                     // 0x0200(0x0010)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])

public:
	void ForceStart();
	void ForceStop(bool bReset);
	const struct FTransform GetPredictedTransform(float TimeInSeconds);
	void LerpBetween(const struct FTransform& InStartTransform, const struct FTransform& InTargetTransform, float InLerpDuration, bool bInLoop);
	void LerpBetweenInternal(const struct FTransform& InStartTransform, const struct FTransform& InTargetTransform, float InLerpDuration, float InStartAtLerpTime, bool bInLoop);
	void OnRep_NetworkLerpFromTo();
	void OnRep_ServerLerpTime();
	void PerformLerp(float DeltaTime);
	void ReplicateServerTime();
	void ReplicateServerTimeInternal(bool bForce);
	void Teleport(const struct FTransform& InTransform);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NetworkLerpComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NetworkLerpComponent")
	}
	static class UNetworkLerpComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNetworkLerpComponent>();
	}
};
DUMPER7_ASSERTS_UNetworkLerpComponent;

}

