#pragma once

/*
* SDK generated by Rei-SdkDumper
* Based on Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: OVRLipSync

#include "Basic.hpp"

#include "Engine_classes.hpp"
#include "OVRLipSync_structs.hpp"
#include "CoreUObject_classes.hpp"


namespace SDK
{

// Class OVRLipSync.OVRLipSyncActorComponentBase
// 0x0070 (0x0120 - 0x00B0)
class UOVRLipSyncActorComponentBase : public UActorComponent
{
public:
	TMulticastInlineDelegate<void()>              OnVisemesReady;                                    // 0x00B0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_C0[0x28];                                      // 0x00C0(0x0028)(Fixing Size After Last Property [ Rei-SdkDumper ])
	class UCurveFloat*                            DBCurve;                                           // 0x00E8(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_F0[0x30];                                      // 0x00F0(0x0030)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])

public:
	void AssignVisemesToMorphTargets(class USkeletalMeshComponent* Mesh, const TArray<class FString>& MorphTargetNames);
	void AssignVisemesToMorphTargets_Default(class USkeletalMeshComponent* Mesh);
	void SetEnableLipSync(bool Enable);

	const float GetLaughterScore() const;
	const TArray<class FString> GetVisemeNames() const;
	const TArray<float> GetVisemes() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("OVRLipSyncActorComponentBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"OVRLipSyncActorComponentBase")
	}
	static class UOVRLipSyncActorComponentBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOVRLipSyncActorComponentBase>();
	}
};
DUMPER7_ASSERTS_UOVRLipSyncActorComponentBase;

// Class OVRLipSync.OVRLipSyncFrameSequence
// 0x0030 (0x0058 - 0x0028)
class UOVRLipSyncFrameSequence final : public UObject
{
public:
	float                                         ResetMinTime;                                      // 0x0028(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ResetMaxTime;                                      // 0x002C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         KeyFrameGenerateThre;                              // 0x0030(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Rei-SdkDumper ])
	TArray<float>                                 ReplaceViseme;                                     // 0x0038(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FOVRLipSyncFrame>               FrameSequence;                                     // 0x0048(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("OVRLipSyncFrameSequence")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"OVRLipSyncFrameSequence")
	}
	static class UOVRLipSyncFrameSequence* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOVRLipSyncFrameSequence>();
	}
};
DUMPER7_ASSERTS_UOVRLipSyncFrameSequence;

// Class OVRLipSync.OVRLipSyncPlaybackActorComponent
// 0x0048 (0x0168 - 0x0120)
class UOVRLipSyncPlaybackActorComponent final : public UOVRLipSyncActorComponentBase
{
public:
	class UOVRLipSyncFrameSequence*               Sequence;                                          // 0x0120(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAudioComponent*                        AudioComponent;                                    // 0x0128(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<TWeakObjectPtr<class USkeletalMeshComponent>> SyncMeshComponentContainer;                 // 0x0130(0x0010)(ExportObject, ZeroConstructor, Transient, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPublic)
	uint8                                         Pad_140[0x28];                                     // 0x0140(0x0028)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])

public:
	void AddLipSnycSkeletalMesh(class USkeletalMeshComponent* Mesh);
	void RemoveLipSnycSkeletalMesh(class USkeletalMeshComponent* Mesh);
	void SetPlaybackSequence(class UOVRLipSyncFrameSequence* InSequence);
	void Start(class UAudioComponent* InAudioComponent, class UOVRLipSyncFrameSequence* InSequence);
	void Start_WithID(int32 CharacterID, int32 InPlayingID, const class FString& VoiceID, const class FString& WwiseEvent, const class FString& VoiceLang, class UWwiseComponent* AudioPlayer);
	void Stop();
	void SyncLipMesh();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("OVRLipSyncPlaybackActorComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"OVRLipSyncPlaybackActorComponent")
	}
	static class UOVRLipSyncPlaybackActorComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOVRLipSyncPlaybackActorComponent>();
	}
};
DUMPER7_ASSERTS_UOVRLipSyncPlaybackActorComponent;

}

