#pragma once

/*
* SDK generated by Rei-SdkDumper
* Based on Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Plot

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "GameCore_structs.hpp"
#include "GameCore_classes.hpp"
#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "Plot_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"
#include "Slate_structs.hpp"


namespace SDK
{

// Class Plot.PlotItem
// 0x0068 (0x0090 - 0x0028)
class UPlotItem : public UObject
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Rei-SdkDumper ])
	TArray<class UPlotItem*>                      Childs;                                            // 0x0030(0x0010)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	class UPlotItem*                              Parent;                                            // 0x0040(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, PersistentInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPlotScreenType                               ScreenType;                                        // 0x0048(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bWait;                                             // 0x0049(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EWaitOperationType                            WaitType;                                          // 0x004A(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4B[0x1];                                       // 0x004B(0x0001)(Fixing Size After Last Property [ Rei-SdkDumper ])
	float                                         Timeout;                                           // 0x004C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UPlotEvent*>                     TimeoutEvents;                                     // 0x0050(0x0010)(Edit, ExportObject, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	float                                         TrackTime;                                         // 0x0060(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_64[0x2];                                       // 0x0064(0x0002)(Fixing Size After Last Property [ Rei-SdkDumper ])
	bool                                          bCanHaveMultipleChildren;                          // 0x0066(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_67[0x1];                                       // 0x0067(0x0001)(Fixing Size After Last Property [ Rei-SdkDumper ])
	int32                                         ExecuteIndex;                                      // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Rei-SdkDumper ])
	class FString                                 DisplayLabel;                                      // 0x0070(0x0010)(ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         ItemIndex;                                         // 0x0080(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_84[0x2];                                       // 0x0084(0x0002)(Fixing Size After Last Property [ Rei-SdkDumper ])
	bool                                          bCanEditWait;                                      // 0x0086(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_87[0x9];                                       // 0x0087(0x0009)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])

public:
	void Clearup();
	void End();
	void OnEnd();
	void OnStart();
	void SetExecuteIndex(int32 InIndex);
	void Start();

	int32 GetChildrenCount() const;
	int32 GetIndex() const;
	class UPlotItem* GetParent() const;
	class UPlot* GetPlot() const;
	class UPlotWidget* GetWidget() const;
	class UWorld* GetWorld() const;
	bool IsTimeout() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PlotItem")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PlotItem")
	}
	static class UPlotItem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPlotItem>();
	}
};
DUMPER7_ASSERTS_UPlotItem;

// Class Plot.PlotItem_FindEvidence
// 0x0048 (0x00D8 - 0x0090)
class UPlotItem_FindEvidence final : public UPlotItem
{
public:
	struct FSoftClassPath                         UMGPath;                                           // 0x0090(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPlotWidgetOrderType                          ZOrder;                                            // 0x00A8(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A9[0x3];                                       // 0x00A9(0x0003)(Fixing Size After Last Property [ Rei-SdkDumper ])
	int32                                         OrderOffset;                                       // 0x00AC(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 PlaceName;                                         // 0x00B0(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 InitGroup;                                         // 0x00C0(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D0[0x8];                                       // 0x00D0(0x0008)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PlotItem_FindEvidence")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PlotItem_FindEvidence")
	}
	static class UPlotItem_FindEvidence* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPlotItem_FindEvidence>();
	}
};
DUMPER7_ASSERTS_UPlotItem_FindEvidence;

// Class Plot.PlotLibrary
// 0x0000 (0x0028 - 0x0028)
class UPlotLibrary final : public UBlueprintFunctionLibrary
{
public:
	static void ClearSequencerWidgetCallBack(class UWidget* InChildWidget);
	static void FindCameraEndLocationAndFOVInLevelSequence(class ULevelSequence* InSequence, struct FVector* OutEndLocation, float* OutFOV);
	static class APlotRoleActor* FindRoleByName(class UObject* WorldContextObject, const class FString& InName);
	static class FString GetCurrentPlotFileName(class UObject* WorldContextObject);
	static class UPlotWidget* GetCurrentPlotWidget(class UObject* WorldContextObject);
	static class USequencerUserWidget* GetCurrentSequencer(class UObject* WorldContextObject);
	static class FString GetDefaultSpineAnimationNameFromData(const TArray<class FString>& InData);
	static TArray<class UPlotItem*> GetPlotItemByClass(class UObject* WorldContextObject, class UClass* InClass);
	static const struct FPlotName2Img GetPlotName2ImageData(const class FString& InKey);
	static void GetPlotNameConfig(const class FString& InKey, class USpineAtlasAsset** OutAtlas, class USpineSkeletonDataAsset** OutSkeletonData);
	static struct FPlotRoleInfo GetPlotRoleConfig(int32 InId);
	static EDialogueOperationType GetTalkOperationType(class UPlotItem* InItem);
	static int32 LuaGetDataTableRowFromName(class UDataTable* Table, class FName RowName);
	static void RemoveLineBreaksInline(class FString& SourceString, class UPlot* InPlot);
	static void ReplaceHyperColorTag(class FString& SourceString, class UPlot* InPlot);
	static void SetNearClipPlaneForPlotSequencer(float InValue);
	static void SetPlotRoleTexture(const class FString& InKey, class UMaterialInstanceDynamic* RoleMaterial);
	static void SkipParentSequencerWidgetAnimation(class UWidget* InChildWidget);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PlotLibrary")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PlotLibrary")
	}
	static class UPlotLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPlotLibrary>();
	}
};
DUMPER7_ASSERTS_UPlotLibrary;

// Class Plot.SubtitlesTextInterface
// 0x0000 (0x0000 - 0x0000)
class ISubtitlesTextInterface final
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SubtitlesTextInterface")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SubtitlesTextInterface")
	}
	static class ISubtitlesTextInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<ISubtitlesTextInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_ISubtitlesTextInterface;

// Class Plot.MovieClipBackgroundUserWidget
// 0x0038 (0x02B8 - 0x0280)
class UMovieClipBackgroundUserWidget final : public UUserWidget
{
public:
	class UMovieSkipWidget*                       umg_MovieSkipWidget;                               // 0x0280(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTextBlock*                             Text_SkipTip_Phone;                                // 0x0288(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTextBlock*                             Text_SkipTip_Computer;                             // 0x0290(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UImage*                                 Image_SkipTip_Gamepad_Xbox;                        // 0x0298(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UImage*                                 Image_SkipTip_Gamepad_PS;                          // 0x02A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPlayControllerType                           CurrentType;                                       // 0x02A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2A9[0xF];                                      // 0x02A9(0x000F)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])

public:
	void ReplaceFontAsset(class UTextBlock* InTextBlock);
	void SetCurrentControlerType(EPlayControllerType TypeToSet);
	void SetSkipTipVisible();
	void SetVisible(bool bIsSetVisible);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieClipBackgroundUserWidget")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieClipBackgroundUserWidget")
	}
	static class UMovieClipBackgroundUserWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieClipBackgroundUserWidget>();
	}
};
DUMPER7_ASSERTS_UMovieClipBackgroundUserWidget;

// Class Plot.PlotCondition
// 0x0000 (0x0028 - 0x0028)
class UPlotCondition : public UObject
{
public:
	bool Check();

	class UPlot* GetPlot() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PlotCondition")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PlotCondition")
	}
	static class UPlotCondition* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPlotCondition>();
	}
};
DUMPER7_ASSERTS_UPlotCondition;

// Class Plot.PlotSelectNumCondition
// 0x0008 (0x0030 - 0x0028)
class UPlotSelectNumCondition final : public UPlotCondition
{
public:
	int32                                         Num;                                               // 0x0028(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PlotSelectNumCondition")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PlotSelectNumCondition")
	}
	static class UPlotSelectNumCondition* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPlotSelectNumCondition>();
	}
};
DUMPER7_ASSERTS_UPlotSelectNumCondition;

// Class Plot.MovieClipSubUserWidget
// 0x0010 (0x0290 - 0x0280)
class UMovieClipSubUserWidget final : public UUserWidget
{
public:
	class FString                                 SubtitlesPath;                                     // 0x0280(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieClipSubUserWidget")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieClipSubUserWidget")
	}
	static class UMovieClipSubUserWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieClipSubUserWidget>();
	}
};
DUMPER7_ASSERTS_UMovieClipSubUserWidget;

// Class Plot.MovieClipCameraActor
// 0x0010 (0x07D0 - 0x07C0)
class AMovieClipCameraActor final : public ACameraActor
{
public:
	class UStaticMeshComponent*                   PlaneComponent;                                    // 0x07C0(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UStaticMeshComponent*                   BackgroundMesh;                                    // 0x07C8(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieClipCameraActor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieClipCameraActor")
	}
	static class AMovieClipCameraActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AMovieClipCameraActor>();
	}
};
DUMPER7_ASSERTS_AMovieClipCameraActor;

// Class Plot.MovieClipCanvasPanel
// 0x0000 (0x0150 - 0x0150)
class UMovieClipCanvasPanel final : public UCanvasPanel
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieClipCanvasPanel")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieClipCanvasPanel")
	}
	static class UMovieClipCanvasPanel* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieClipCanvasPanel>();
	}
};
DUMPER7_ASSERTS_UMovieClipCanvasPanel;

// Class Plot.PlotItem_DisableAllScreenMessages
// 0x0000 (0x0090 - 0x0090)
class UPlotItem_DisableAllScreenMessages final : public UPlotItem
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PlotItem_DisableAllScreenMessages")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PlotItem_DisableAllScreenMessages")
	}
	static class UPlotItem_DisableAllScreenMessages* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPlotItem_DisableAllScreenMessages>();
	}
};
DUMPER7_ASSERTS_UPlotItem_DisableAllScreenMessages;

// Class Plot.MovieClipImage
// 0x00E8 (0x0210 - 0x0128)
class UMovieClipImage : public UWidget
{
public:
	uint8                                         Pad_128[0x8];                                      // 0x0128(0x0008)(Fixing Size After Last Property [ Rei-SdkDumper ])
	struct FSlateBrush                            Brush;                                             // 0x0130(0x0088)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	class ULevelSequence*                         lpSequence;                                        // 0x01B8(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsMainView;                                       // 0x01C0(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C1[0x3];                                      // 0x01C1(0x0003)(Fixing Size After Last Property [ Rei-SdkDumper ])
	float                                         MaxViewDistance;                                   // 0x01C4(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              PlaybackRange;                                     // 0x01C8(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void()>                             BrushDelegate;                                     // 0x01D0(0x0010)(ZeroConstructor, InstancedReference, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_1E0[0x30];                                     // 0x01E0(0x0030)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])

public:
	void OnCameraCut(class UCameraComponent* CameraComp);
	void PlayAnimation();
	void StopAnimation();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieClipImage")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieClipImage")
	}
	static class UMovieClipImage* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieClipImage>();
	}
};
DUMPER7_ASSERTS_UMovieClipImage;

// Class Plot.MovieClipMediaSourceImage
// 0x0050 (0x0260 - 0x0210)
class UMovieClipMediaSourceImage final : public UMovieClipImage
{
public:
	class FString                                 MP4Path;                                           // 0x0210(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFileMediaSource*                       lpMediaSource;                                     // 0x0220(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMediaPlayer*                           lpMediaPlayer;                                     // 0x0228(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftObjectPath                        MediaTexturePath;                                  // 0x0230(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMediaTexture*                          MediaTexture;                                      // 0x0248(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AMovieClipCameraActor*                  MovieClipCameraActor;                              // 0x0250(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_258[0x8];                                      // 0x0258(0x0008)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])

public:
	void AutoSetPath();
	void OnMediaOpenFailedHandler(const class FString& DeviceUrl);
	void OnMediaSourceOpenedHandler(const class FString& DeviceUrl);

	TArray<class FString> GetFileList() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieClipMediaSourceImage")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieClipMediaSourceImage")
	}
	static class UMovieClipMediaSourceImage* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieClipMediaSourceImage>();
	}
};
DUMPER7_ASSERTS_UMovieClipMediaSourceImage;

// Class Plot.PlotItem_LuaImpl
// 0x0020 (0x00B0 - 0x0090)
class UPlotItem_LuaImpl : public UPlotItem
{
public:
	EPlotWidgetOrderType                          OrderType;                                         // 0x0090(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_91[0x3];                                       // 0x0091(0x0003)(Fixing Size After Last Property [ Rei-SdkDumper ])
	int32                                         OrderOffset;                                       // 0x0094(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_98[0x18];                                      // 0x0098(0x0018)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])

public:
	bool IsSingleWidget();
	void SetWait(bool InValue);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PlotItem_LuaImpl")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PlotItem_LuaImpl")
	}
	static class UPlotItem_LuaImpl* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPlotItem_LuaImpl>();
	}
};
DUMPER7_ASSERTS_UPlotItem_LuaImpl;

// Class Plot.PlotItem_TableGame
// 0x0070 (0x0120 - 0x00B0)
class UPlotItem_TableGame final : public UPlotItem_LuaImpl
{
public:
	class FString                                 TextKey;                                           // 0x00B0(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         DiceMin;                                           // 0x00C0(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         DiceMax;                                           // 0x00C4(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         DestValue;                                         // 0x00C8(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         GreatSuccess;                                      // 0x00CC(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         EpicFail;                                          // 0x00D0(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D4[0x4];                                       // 0x00D4(0x0004)(Fixing Size After Last Property [ Rei-SdkDumper ])
	class FString                                 SuccessGroup;                                      // 0x00D8(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 GreatSuccessGroup;                                 // 0x00E8(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 FailGroup;                                         // 0x00F8(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 EpicFailGroup;                                     // 0x0108(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_118[0x8];                                      // 0x0118(0x0008)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])

public:
	void GotoGroup(const class FString& InGroupName);
	void OnGroupComplete();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PlotItem_TableGame")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PlotItem_TableGame")
	}
	static class UPlotItem_TableGame* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPlotItem_TableGame>();
	}
};
DUMPER7_ASSERTS_UPlotItem_TableGame;

// Class Plot.MovieClipNormalSubtitlesText
// 0x0020 (0x02E8 - 0x02C8)
class UMovieClipNormalSubtitlesText final : public UTextBlock
{
public:
	uint8                                         Pad_2C8[0x8];                                      // 0x02C8(0x0008)(Fixing Size After Last Property [ Rei-SdkDumper ])
	class FString                                 Key;                                               // 0x02D0(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2E0[0x8];                                      // 0x02E0(0x0008)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieClipNormalSubtitlesText")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieClipNormalSubtitlesText")
	}
	static class UMovieClipNormalSubtitlesText* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieClipNormalSubtitlesText>();
	}
};
DUMPER7_ASSERTS_UMovieClipNormalSubtitlesText;

// Class Plot.MovieSkipWidget
// 0x0020 (0x02A0 - 0x0280)
class UMovieSkipWidget final : public UUserWidget
{
public:
	class UMaterialInstanceDynamic*               SkipCircleInstance;                                // 0x0280(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bStartingCount;                                    // 0x0288(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_289[0x3];                                      // 0x0289(0x0003)(Fixing Size After Last Property [ Rei-SdkDumper ])
	float                                         StartToNow;                                        // 0x028C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SkipIntervalTime;                                  // 0x0290(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InterpValue;                                       // 0x0294(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UImage*                                 SkipCircle;                                        // 0x0298(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieSkipWidget")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieSkipWidget")
	}
	static class UMovieSkipWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSkipWidget>();
	}
};
DUMPER7_ASSERTS_UMovieSkipWidget;

// Class Plot.Plot
// 0x0278 (0x02A0 - 0x0028)
class UPlot final : public UObject
{
public:
	class FString                                 PlotConfig;                                        // 0x0028(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftObjectPath                        BGPath;                                            // 0x0038(0x0018)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShowBackgroundMask;                               // 0x0050(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Rei-SdkDumper ])
	float                                         FadeTime;                                          // 0x0054(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class USequencerUserWidget>       StageAnimationWidgetClass;                         // 0x0058(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SpineAnimationBlendTime;                           // 0x0060(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Preload;                                           // 0x0064(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_65[0x3];                                       // 0x0065(0x0003)(Fixing Size After Last Property [ Rei-SdkDumper ])
	class UPlotItem*                              RootItem;                                          // 0x0068(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, PersistentInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_70[0x118];                                     // 0x0070(0x0118)(Fixing Size After Last Property [ Rei-SdkDumper ])
	TWeakObjectPtr<class UPlotWidget>             Widget;                                            // 0x0188(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class USequencerUserWidget*                   SequencerWidget;                                   // 0x0190(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UPlotItem*                              SequencerPlotItem;                                 // 0x0198(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UPlotItem*                              CGSpinePlotItem;                                   // 0x01A0(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1A8[0x8];                                      // 0x01A8(0x0008)(Fixing Size After Last Property [ Rei-SdkDumper ])
	TMap<class FString, struct FConfigItem>       ConfigMap;                                         // 0x01B0(0x0050)(Transient, NativeAccessSpecifierPrivate)
	uint8                                         Pad_200[0xA0];                                     // 0x0200(0x00A0)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])

public:
	static void ReloadLanguage();
	static void SetPlotLanguageNames(const TArray<class FString>& InLanguageNames);

	void Cleanup();
	void ClearSequence();
	void End(EPlotCompleteType InCompleteType);
	int32 GetConfigId();
	struct FConfigItem GetTalkConfig(class FString* InKey);
	bool IsJump(class UPlotItem* InItem);
	void OnSequencerFinishedHandler();
	void OnWindowActivatedHandler();
	void OnWindowDeactivatedHandler();
	void SetAutoPlay(bool bIsAutoPlay);
	void SetPlayMode(const EPlayMode InPlayMode);
	void SetWidget(class UPlotWidget* InWidget);
	void Start();

	float GetFadeTime() const;
	bool GetIsAutoPlay() const;
	EPlayMode GetPlayMode() const;
	float GetPlaySpeed() const;
	class UPlotItem* GetRootItem() const;
	class UPlotWidget* GetWidget() const;
	class UWorld* GetWorld() const;
	bool HasKey(const class FString& InKey) const;
	bool IsNormalDialogueType() const;
	bool IsVisiableSequencerUserWidget() const;
	bool JumpTo(const class FString& InKey) const;
	void SaveKey(const class FString& InKey) const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("Plot")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"Plot")
	}
	static class UPlot* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPlot>();
	}
};
DUMPER7_ASSERTS_UPlot;

// Class Plot.PlotCameraObj
// 0x0058 (0x0080 - 0x0028)
class UPlotCameraObj final : public UObject
{
public:
	struct FPlotCameraInfo                        CameraArgs;                                        // 0x0028(0x0058)(Edit, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PlotCameraObj")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PlotCameraObj")
	}
	static class UPlotCameraObj* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPlotCameraObj>();
	}
};
DUMPER7_ASSERTS_UPlotCameraObj;

// Class Plot.PlotEvent
// 0x0000 (0x0028 - 0x0028)
class UPlotEvent : public UObject
{
public:
	bool DoEvent();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PlotEvent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PlotEvent")
	}
	static class UPlotEvent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPlotEvent>();
	}
};
DUMPER7_ASSERTS_UPlotEvent;

// Class Plot.PlotEvent_JumpKey
// 0x0010 (0x0038 - 0x0028)
class UPlotEvent_JumpKey final : public UPlotEvent
{
public:
	class FString                                 Key;                                               // 0x0028(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PlotEvent_JumpKey")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PlotEvent_JumpKey")
	}
	static class UPlotEvent_JumpKey* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPlotEvent_JumpKey>();
	}
};
DUMPER7_ASSERTS_UPlotEvent_JumpKey;

// Class Plot.PlotCharacter
// 0x0050 (0x0510 - 0x04C0)
class APlotCharacter final : public ACharacter
{
public:
	class USpringArmComponent*                    CameraArm;                                         // 0x04B8(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCameraComponent*                       Camera;                                            // 0x04C0(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4C8[0x48];                                     // 0x04C8(0x0048)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])

public:
	struct FPlotCameraInfo GetCameraArgs() const;
	void SetCameraArgs(const struct FPlotCameraInfo& InArgs, class UPlot* InPlot) const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PlotCharacter")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PlotCharacter")
	}
	static class APlotCharacter* GetDefaultObj()
	{
		return GetDefaultObjImpl<APlotCharacter>();
	}
};
DUMPER7_ASSERTS_APlotCharacter;

// Class Plot.PlotItem_SetSkipEnabled
// 0x0008 (0x00B8 - 0x00B0)
class UPlotItem_SetSkipEnabled final : public UPlotItem_LuaImpl
{
public:
	bool                                          Enabled;                                           // 0x00B0(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PlotItem_SetSkipEnabled")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PlotItem_SetSkipEnabled")
	}
	static class UPlotItem_SetSkipEnabled* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPlotItem_SetSkipEnabled>();
	}
};
DUMPER7_ASSERTS_UPlotItem_SetSkipEnabled;

// Class Plot.PlotReadKeyCondition
// 0x0018 (0x0040 - 0x0028)
class UPlotReadKeyCondition final : public UPlotCondition
{
public:
	class FString                                 Key;                                               // 0x0028(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseSavedKey;                                      // 0x0038(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bHasRead;                                          // 0x0039(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3A[0x6];                                       // 0x003A(0x0006)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PlotReadKeyCondition")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PlotReadKeyCondition")
	}
	static class UPlotReadKeyCondition* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPlotReadKeyCondition>();
	}
};
DUMPER7_ASSERTS_UPlotReadKeyCondition;

// Class Plot.PlotTimeoutCondition
// 0x0010 (0x0038 - 0x0028)
class UPlotTimeoutCondition final : public UPlotCondition
{
public:
	class FString                                 Key;                                               // 0x0028(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PlotTimeoutCondition")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PlotTimeoutCondition")
	}
	static class UPlotTimeoutCondition* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPlotTimeoutCondition>();
	}
};
DUMPER7_ASSERTS_UPlotTimeoutCondition;

// Class Plot.PlotLuaImplWidget
// 0x0008 (0x0288 - 0x0280)
class UPlotLuaImplWidget final : public UUserWidget
{
public:
	uint8                                         Pad_280[0x8];                                      // 0x0280(0x0008)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])

public:
	void NotifyStart(class UPlotItem_LuaImpl* InPlotItem, class UPlotWidget* InPlotWidget, bool InIsPreview);
	void NotifyStop();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PlotLuaImplWidget")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PlotLuaImplWidget")
	}
	static class UPlotLuaImplWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPlotLuaImplWidget>();
	}
};
DUMPER7_ASSERTS_UPlotLuaImplWidget;

// Class Plot.PlotImage
// 0x0058 (0x0288 - 0x0230)
class UPlotImage final : public UImage
{
public:
	uint8                                         Pad_230[0x58];                                     // 0x0230(0x0058)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PlotImage")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PlotImage")
	}
	static class UPlotImage* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPlotImage>();
	}
};
DUMPER7_ASSERTS_UPlotImage;

// Class Plot.PlotItem_Root
// 0x0030 (0x00C0 - 0x0090)
class UPlotItem_Root final : public UPlotItem
{
public:
	struct FTalkConfig                            TalkConfig;                                        // 0x0090(0x0030)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PlotItem_Root")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PlotItem_Root")
	}
	static class UPlotItem_Root* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPlotItem_Root>();
	}
};
DUMPER7_ASSERTS_UPlotItem_Root;

// Class Plot.PlotSaveItem
// 0x0088 (0x0118 - 0x0090)
class UPlotSaveItem : public UPlotItem
{
public:
	struct FConfigItem                            Config;                                            // 0x0090(0x0080)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnTemplate, NativeAccessSpecifierPublic)
	bool                                          bSave;                                             // 0x0110(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_111[0x7];                                      // 0x0111(0x0007)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])

public:
	static class FString GetContentFromSelectItemData(const struct FSelectItemData& SelectItemData);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PlotSaveItem")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PlotSaveItem")
	}
	static class UPlotSaveItem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPlotSaveItem>();
	}
};
DUMPER7_ASSERTS_UPlotSaveItem;

// Class Plot.PlotItem_AddSpotLight
// 0x0060 (0x00F0 - 0x0090)
class UPlotItem_AddSpotLight final : public UPlotItem
{
public:
	class FString                                 RoleName;                                          // 0x0090(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 LightName;                                         // 0x00A0(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSpotLightParameters                   SpotLightParameters;                               // 0x00B0(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector                                RelativeLocation;                                  // 0x00D0(0x000C)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               RelativeRotation;                                  // 0x00DC(0x000C)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         bHide : 1;                                         // 0x00E8(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PlotItem_AddSpotLight")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PlotItem_AddSpotLight")
	}
	static class UPlotItem_AddSpotLight* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPlotItem_AddSpotLight>();
	}
};
DUMPER7_ASSERTS_UPlotItem_AddSpotLight;

// Class Plot.PlotSubtitlesTextBlock
// 0x0000 (0x02C8 - 0x02C8)
class UPlotSubtitlesTextBlock final : public UTextBlock
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PlotSubtitlesTextBlock")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PlotSubtitlesTextBlock")
	}
	static class UPlotSubtitlesTextBlock* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPlotSubtitlesTextBlock>();
	}
};
DUMPER7_ASSERTS_UPlotSubtitlesTextBlock;

// Class Plot.PlotItem_BackgroundSubtitles
// 0x00B8 (0x0148 - 0x0090)
class UPlotItem_BackgroundSubtitles final : public UPlotItem
{
public:
	class FText                                   Text;                                              // 0x0090(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	class FText                                   TextKey;                                           // 0x00A8(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	class FString                                 WwiseEventID;                                      // 0x00C0(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          UseSelfLangFile;                                   // 0x00D0(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Rei-SdkDumper ])
	struct FSoftObjectPath                        FontPath;                                          // 0x00D8(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         FontSize;                                          // 0x00F0(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ETextJustify                                  Justification;                                     // 0x00F4(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPlotTextAnchorLayoutType                     AnchorType;                                        // 0x00F5(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bBold;                                             // 0x00F6(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsVertical;                                       // 0x00F7(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LineHeightPercentage;                              // 0x00F8(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           FontColor;                                         // 0x00FC(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              Offset;                                            // 0x010C(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EFowardType                                   FowardType;                                        // 0x0114(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPlotSubtitlesFadeInType                      FadeInType;                                        // 0x0115(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_116[0x2];                                      // 0x0116(0x0002)(Fixing Size After Last Property [ Rei-SdkDumper ])
	float                                         BlendInTime;                                       // 0x0118(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         WaitTime;                                          // 0x011C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BlendOutTime;                                      // 0x0120(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_124[0x4];                                      // 0x0124(0x0004)(Fixing Size After Last Property [ Rei-SdkDumper ])
	class UWwiseComponent*                        WwiseBSComponent;                                  // 0x0128(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_130[0x18];                                     // 0x0130(0x0018)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])

public:
	void OnWwiseCompleteHandler(class UWwiseComponent* InWwiseComponent);

	class FText GetRemoveLineBreakText() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PlotItem_BackgroundSubtitles")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PlotItem_BackgroundSubtitles")
	}
	static class UPlotItem_BackgroundSubtitles* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPlotItem_BackgroundSubtitles>();
	}
};
DUMPER7_ASSERTS_UPlotItem_BackgroundSubtitles;

// Class Plot.PlotItem_BackgroundSubtitleOneByOne
// 0x01C0 (0x0250 - 0x0090)
class UPlotItem_BackgroundSubtitleOneByOne final : public UPlotItem
{
public:
	TArray<class FString>                         Keys;                                              // 0x0090(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class FString>                         EventNames;                                        // 0x00A0(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          UseSelfLangFile;                                   // 0x00B0(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B1[0x3];                                       // 0x00B1(0x0003)(Fixing Size After Last Property [ Rei-SdkDumper ])
	int32                                         FontSize;                                          // 0x00B4(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ETextJustify                                  Justification;                                     // 0x00B8(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPlotTextAnchorLayoutType                     AnchorType;                                        // 0x00B9(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bBold;                                             // 0x00BA(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_BB[0x1];                                       // 0x00BB(0x0001)(Fixing Size After Last Property [ Rei-SdkDumper ])
	struct FLinearColor                           FontColor;                                         // 0x00BC(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              Offset;                                            // 0x00CC(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Width;                                             // 0x00D4(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Speed;                                             // 0x00D8(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FadeOut;                                           // 0x00DC(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DirTime;                                           // 0x00E0(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_E4[0x4];                                       // 0x00E4(0x0004)(Fixing Size After Last Property [ Rei-SdkDumper ])
	class FString                                 Content;                                           // 0x00E8(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UWwiseComponent*                        WwiseBSComponent;                                  // 0x00F8(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_100[0x150];                                    // 0x0100(0x0150)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])

public:
	TArray<struct FSubtitleRecord> GetHasPlayRecord();
	void OnInput();
	void OnWwiseCompleteHandler(class UWwiseComponent* InWwiseComponent);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PlotItem_BackgroundSubtitleOneByOne")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PlotItem_BackgroundSubtitleOneByOne")
	}
	static class UPlotItem_BackgroundSubtitleOneByOne* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPlotItem_BackgroundSubtitleOneByOne>();
	}
};
DUMPER7_ASSERTS_UPlotItem_BackgroundSubtitleOneByOne;

// Class Plot.PlotItem_BackgroundSubtitle_New
// 0x0218 (0x02A8 - 0x0090)
class UPlotItem_BackgroundSubtitle_New final : public UPlotItem
{
public:
	bool                                          isOneByOne;                                        // 0x0090(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Rei-SdkDumper ])
	TArray<class FString>                         Keys;                                              // 0x0098(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class FString>                         EventNames;                                        // 0x00A8(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class FString>                         Speakers;                                          // 0x00B8(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          UseSelfLangFile;                                   // 0x00C8(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C9[0x3];                                       // 0x00C9(0x0003)(Fixing Size After Last Property [ Rei-SdkDumper ])
	int32                                         FontSize;                                          // 0x00CC(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
