#pragma once

/*
* SDK generated by Rei-SdkDumper
* Based on Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Plot

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "MovieScene_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// Enum Plot.EHandDrawPlayType
// NumValues: 0x0004
enum class EHandDrawPlayType : uint8
{
	Normal                                   = 0,
	Force                                    = 1,
	Hide                                     = 2,
	EHandDrawPlayType_MAX                    = 3,
};

// Enum Plot.EPlotWidgetOrderType
// NumValues: 0x0004
enum class EPlotWidgetOrderType : uint8
{
	All                                      = 0,
	RoleAndBg                                = 3,
	Bg                                       = 10,
	EPlotWidgetOrderType_MAX                 = 11,
};

// Enum Plot.EPlotScreenType
// NumValues: 0x0004
enum class EPlotScreenType : uint8
{
	Global                                   = 0,
	First                                    = 1,
	Second                                   = 2,
	EPlotScreenType_MAX                      = 3,
};

// Enum Plot.EPlotCompleteType
// NumValues: 0x0004
enum class EPlotCompleteType : uint8
{
	Normal                                   = 0,
	Skip                                     = 1,
	Close                                    = 2,
	EPlotCompleteType_MAX                    = 3,
};

// Enum Plot.EDialogueType
// NumValues: 0x0006
enum class EDialogueType : uint8
{
	None                                     = 0,
	Normal                                   = 1,
	Fight                                    = 2,
	Animation                                = 3,
	Stage                                    = 4,
	EDialogueType_MAX                        = 5,
};

// Enum Plot.EPlotPostProcessEffectType
// NumValues: 0x0007
enum class EPlotPostProcessEffectType : uint8
{
	Recall                                   = 0,
	Twinkle                                  = 1,
	SpeedLine                                = 2,
	ColorTint                                = 3,
	Shake                                    = 4,
	Noise                                    = 5,
	EPlotPostProcessEffectType_MAX           = 6,
};

// Enum Plot.EScreenTransitionEffectType
// NumValues: 0x0008
enum class EScreenTransitionEffectType : uint8
{
	Mosaic                                   = 0,
	BlackBackground                          = 1,
	WhiteBackground                          = 2,
	CloseEye                                 = 3,
	OpenEye                                  = 4,
	DiffusionBegin                           = 5,
	DiffusionEnd                             = 6,
	EScreenTransitionEffectType_MAX          = 7,
};

// Enum Plot.ESpineEffectType
// NumValues: 0x0008
enum class ESpineEffectType : uint8
{
	None                                     = 0,
	Normal                                   = 1,
	Message                                  = 2,
	Ghost                                    = 3,
	NormalDisappear                          = 4,
	HalfBlack                                = 5,
	HalfBlackMessage                         = 6,
	ESpineEffectType_MAX                     = 7,
};

// Enum Plot.ECameraMotionType
// NumValues: 0x0005
enum class ECameraMotionType : uint8
{
	ChangeProperty                           = 0,
	MoveMainCamera                           = 1,
	FollowRole                               = 2,
	MoveToTarget                             = 3,
	ECameraMotionType_MAX                    = 4,
};

// Enum Plot.EPlotBgSwitchType
// NumValues: 0x0003
enum class EPlotBgSwitchType : uint8
{
	Default                                  = 0,
	Dissolve                                 = 1,
	EPlotBgSwitchType_MAX                    = 2,
};

// Enum Plot.EWaitOperationType
// NumValues: 0x0003
enum class EWaitOperationType : uint8
{
	WaitForCompletion                        = 0,
	WaitAll                                  = 1,
	EWaitOperationType_MAX                   = 2,
};

// Enum Plot.EFowardType
// NumValues: 0x0003
enum class EFowardType : uint8
{
	Click                                    = 0,
	Time                                     = 1,
	EFowardType_MAX                          = 2,
};

// Enum Plot.EPlotType
// NumValues: 0x0003
enum class EPlotType : uint8
{
	Plot                                     = 0,
	CG                                       = 1,
	EPlotType_MAX                            = 2,
};

// Enum Plot.EPlayControllerType
// NumValues: 0x0005
enum class EPlayControllerType : uint8
{
	Computer                                 = 0,
	Phone                                    = 1,
	Gamepad_Xbox                             = 2,
	Gamepad_PS                               = 3,
	EPlayControllerType_MAX                  = 4,
};

// Enum Plot.EPlotCategory
// NumValues: 0x0003
enum class EPlotCategory : uint8
{
	Plot2D                                   = 0,
	Plot3D                                   = 1,
	EPlotCategory_MAX                        = 2,
};

// Enum Plot.EPlotSpinePos
// NumValues: 0x0007
enum class EPlotSpinePos : uint8
{
	Pos1                                     = 0,
	Pos2                                     = 1,
	Pos3                                     = 2,
	Pos4                                     = 3,
	Pos5                                     = 4,
	Pos6                                     = 5,
	EPlotSpinePos_MAX                        = 6,
};

// Enum Plot.EPlotTextAnchorLayoutType
// NumValues: 0x0008
enum class EPlotTextAnchorLayoutType : uint8
{
	LeftTop                                  = 0,
	RightTop                                 = 1,
	RightBottom                              = 2,
	LeftBottom                               = 3,
	Center                                   = 4,
	CenterBottom                             = 5,
	CenterTop                                = 6,
	EPlotTextAnchorLayoutType_MAX            = 7,
};

// Enum Plot.EPlotSubtitlesFadeInType
// NumValues: 0x0003
enum class EPlotSubtitlesFadeInType : uint8
{
	Normal                                   = 0,
	Mask                                     = 1,
	EPlotSubtitlesFadeInType_MAX             = 2,
};

// Enum Plot.EDialogueOperationType
// NumValues: 0x0004
enum class EDialogueOperationType : uint8
{
	User                                     = 0,
	Normal                                   = 1,
	Stage                                    = 2,
	EDialogueOperationType_MAX               = 3,
};

// Enum Plot.EPlayMode
// NumValues: 0x0004
enum class EPlayMode : uint8
{
	Normal                                   = 0,
	Auto                                     = 1,
	Jump                                     = 2,
	EPlayMode_MAX                            = 3,
};

// Enum Plot.EPlotSwitchScreenEntryType
// NumValues: 0x0003
enum class EPlotSwitchScreenEntryType : uint8
{
	EntryFromRight                           = 0,
	EntryFromLeft                            = 1,
	EPlotSwitchScreenEntryType_MAX           = 2,
};

// Enum Plot.ESpliceType
// NumValues: 0x0003
enum class ESpliceType : uint8
{
	Vertical                                 = 0,
	Horizontal                               = 1,
	ESpliceType_MAX                          = 2,
};

// Enum Plot.EWwiseVolumeType
// NumValues: 0x0006
enum class EWwiseVolumeType : uint8
{
	None                                     = 0,
	Voice                                    = 1,
	Sound                                    = 2,
	Music                                    = 3,
	Master                                   = 4,
	EWwiseVolumeType_MAX                     = 5,
};

// Enum Plot.ERoleControlActionType
// NumValues: 0x000A
enum class ERoleControlActionType : uint8
{
	Move                                     = 0,
	Animation                                = 1,
	FaceToTarget                             = 2,
	LookAtForward                            = 3,
	StopFaceToTarget                         = 4,
	Location                                 = 5,
	Rotation                                 = 6,
	LocationAndRotation                      = 7,
	FacialExpression                         = 8,
	ERoleControlActionType_MAX               = 9,
};

// Enum Plot.EPlotOutShowType
// NumValues: 0x0003
enum class EPlotOutShowType : uint8
{
	Place                                    = 0,
	Time                                     = 1,
	EPlotOutShowType_MAX                     = 2,
};

// Enum Plot.EPlotItemUINodeType
// NumValues: 0x0005
enum class EPlotItemUINodeType : uint8
{
	None                                     = 0,
	DialogueNode                             = 1,
	PanelAside                               = 2,
	UINode                                   = 3,
	EPlotItemUINodeType_MAX                  = 4,
};

// Enum Plot.ESpineChangeEffectType
// NumValues: 0x0008
enum class ESpineChangeEffectType : uint8
{
	ToWhite                                  = 0,
	ToNormal                                 = 1,
	CancelBack                               = 2,
	GhostToDisappear                         = 3,
	NormalToDisappear                        = 4,
	DisappearToGhost                         = 5,
	DisappearToNormal                        = 6,
	ESpineChangeEffectType_MAX               = 7,
};

// Enum Plot.ETalkState
// NumValues: 0x0004
enum class ETalkState : uint8
{
	Noraml                                   = 0,
	Talk                                     = 1,
	CountDown                                = 2,
	ETalkState_MAX                           = 3,
};

// Enum Plot.EPlotWidgetType
// NumValues: 0x0003
enum class EPlotWidgetType : uint8
{
	StaticRoleImage                          = 0,
	Spine                                    = 1,
	EPlotWidgetType_MAX                      = 2,
};

// ScriptStruct Plot.PlotCameraInfo
// 0x0058 (0x0058 - 0x0000)
struct FPlotCameraInfo final
{
public:
	ECameraMotionType                             CameraMotionType;                                  // 0x0000(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Rei-SdkDumper ])
	struct FVector                                Postion;                                           // 0x0004(0x000C)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               Rotator;                                           // 0x0010(0x000C)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	float                                         FOV;                                               // 0x001C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Offset;                                            // 0x0020(0x000C)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   TargetCameraName;                                  // 0x002C(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MoveTime;                                          // 0x0034(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 FollowRoleName;                                    // 0x0038(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Direction;                                         // 0x0048(0x000C)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_FPlotCameraInfo;

// ScriptStruct Plot.SpineParameters
// 0x0050 (0x0050 - 0x0000)
struct FSpineParameters final
{
public:
	ESpineEffectType                              SpineEffectType;                                   // 0x0000(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Rei-SdkDumper ])
	struct FVector2D                              Offset;                                            // 0x0004(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Scale;                                             // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           Color;                                             // 0x0010(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Animation;                                         // 0x0020(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 LoopStandAnimation;                                // 0x0030(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         ZOrder;                                            // 0x0040(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bLoop;                                             // 0x0041(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_42[0x2];                                       // 0x0042(0x0002)(Fixing Size After Last Property [ Rei-SdkDumper ])
	float                                         HalfBlackDarkValue;                                // 0x0044(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         HalfBlackSmoothStrength;                           // 0x0048(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_FSpineParameters;

// ScriptStruct Plot.HandDrawAxisParams
// 0x0008 (0x0008 - 0x0000)
struct FHandDrawAxisParams final
{
public:
	int32                                         Index;                                             // 0x0000(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EHandDrawPlayType                             PlayType;                                          // 0x0004(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_FHandDrawAxisParams;

// ScriptStruct Plot.PlotInfo
// 0x0028 (0x0030 - 0x0008)
struct FPlotInfo final : public FTableRowBase
{
public:
	int32                                         ID;                                                // 0x0008(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Rei-SdkDumper ])
	struct FSoftObjectPath                        PlotPath;                                          // 0x0010(0x0018)(Edit, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Summary;                                           // 0x0028(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Browse;                                            // 0x0029(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPlotCategory                                 PlotCategory;                                      // 0x002A(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2B[0x5];                                       // 0x002B(0x0005)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_FPlotInfo;

// ScriptStruct Plot.SelectItemData
// 0x0040 (0x0040 - 0x0000)
struct FSelectItemData
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Size After Last Property [ Rei-SdkDumper ])
	TArray<class UPlotCondition*>                 AppearCondition;                                   // 0x0008(0x0010)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	TArray<class UPlotCondition*>                 DisAppearCondition;                                // 0x0018(0x0010)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	int32                                         Index;                                             // 0x0028(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SelectNum;                                         // 0x002C(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Highlight;                                         // 0x0030(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0xF];                                       // 0x0031(0x000F)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_FSelectItemData;

// ScriptStruct Plot.FacialMorphTargetInfo
// 0x000C (0x000C - 0x0000)
struct FFacialMorphTargetInfo final
{
public:
	class FName                                   MorphTargetName;                                   // 0x0000(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AnimationTime;                                     // 0x0008(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FFacialMorphTargetInfo;

// ScriptStruct Plot.BlendParameters
// 0x0010 (0x0010 - 0x0000)
struct FBlendParameters final
{
public:
	EPlotBgSwitchType                             SwitchType;                                        // 0x0000(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Rei-SdkDumper ])
	float                                         BlendInTime;                                       // 0x0004(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         WaitTime;                                          // 0x0008(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BlendOutTime;                                      // 0x000C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FBlendParameters;

// ScriptStruct Plot.FacialAnimationGroup
// 0x0020 (0x0020 - 0x0000)
struct FFacialAnimationGroup final
{
public:
	int32                                         ID;                                                // 0x0000(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   FacialAnimName;                                    // 0x0004(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Rei-SdkDumper ])
	TArray<struct FFacialMorphTargetInfo>         AnimDatas;                                         // 0x0010(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FFacialAnimationGroup;

// ScriptStruct Plot.PlotRoleControlArgs
// 0x00A8 (0x00A8 - 0x0000)
struct FPlotRoleControlArgs final
{
public:
	class FString                                 ShowName;                                          // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ModelID;                                           // 0x0010(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Rei-SdkDumper ])
	class FString                                 LookAtRoleName;                                    // 0x0018(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   LookAtSocketName;                                  // 0x0028(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LookAtSpeed;                                       // 0x0030(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Rei-SdkDumper ])
	struct FSoftObjectPath                        Anim;                                              // 0x0038(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         LoopNum;                                           // 0x0050(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Position;                                          // 0x0054(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                TargetLocation;                                    // 0x0060(0x000C)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MoveTime;                                          // 0x006C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               Rotator;                                           // 0x0070(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Rei-SdkDumper ])
	struct FFacialAnimationGroup                  FacialAnimationGroup;                              // 0x0080(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	bool                                          bHide;                                             // 0x00A0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShowWeapon;                                       // 0x00A1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A2[0x6];                                       // 0x00A2(0x0006)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_FPlotRoleControlArgs;

// ScriptStruct Plot.ConfigItem
// 0x0080 (0x0080 - 0x0000)
struct FConfigItem final
{
public:
	class FString                                 Key;                                               // 0x0000(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Pos;                                               // 0x0010(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Rei-SdkDumper ])
	class FString                                 Flag;                                              // 0x0018(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Speaker;                                           // 0x0028(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 RealSpeaker;                                       // 0x0038(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Content;                                           // 0x0048(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 WwiseEventID;                                      // 0x0058(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_68[0x18];                                      // 0x0068(0x0018)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_FConfigItem;

// ScriptStruct Plot.SequenceItemStruct
// 0x0000 (0x0040 - 0x0040)
struct FSequenceItemStruct final : public FSelectItemData
{
};
DUMPER7_ASSERTS_FSequenceItemStruct;

// ScriptStruct Plot.FacialAnimationData
// 0x0018 (0x0020 - 0x0008)
struct FFacialAnimationData final : public FTableRowBase
{
public:
	int32                                         ID;                                                // 0x0008(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Rei-SdkDumper ])
	TArray<struct FFacialAnimationGroup>          FacialAnimations;                                  // 0x0010(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FFacialAnimationData;

// ScriptStruct Plot.PlotName2Img
// 0x0120 (0x0128 - 0x0008)
struct FPlotName2Img final : public FTableRowBase
{
public:
	class FString                                 Key;                                               // 0x0008(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 RoleName;                                          // 0x0018(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftObjectPath                        ImgPath;                                           // 0x0028(0x0018)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftObjectPath                        HeadImagePath;                                     // 0x0040(0x0018)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftObjectPath                        ImageSpritePath;                                   // 0x0058(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftObjectPath                        MessageHeadPath;                                   // 0x0070(0x0018)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftObjectPath                        SpineAtlas;                                        // 0x0088(0x0018)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftObjectPath                        SpineSkeletonData;                                 // 0x00A0(0x0018)(Edit, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SpineAtlasScale;                                   // 0x00B8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              SpineAtlasOffset;                                  // 0x00BC(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C4[0x4];                                       // 0x00C4(0x0004)(Fixing Size After Last Property [ Rei-SdkDumper ])
	struct FSpineParameters                       DefaultSpineParameters;                            // 0x00C8(0x0050)(Edit, NativeAccessSpecifierPublic)
	float                                         AdditionalImageScale;                              // 0x0118(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SpinePlotDefaultScale;                             // 0x011C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          SpeakingTogether;                                  // 0x0120(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_121[0x7];                                      // 0x0121(0x0007)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_FPlotName2Img;

// ScriptStruct Plot.TalkConfig
// 0x0030 (0x0030 - 0x0000)
struct FTalkConfig final
{
public:
	struct FSoftObjectPath                        Img;                                               // 0x0000(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         FontSize;                                          // 0x0018(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bBold;                                             // 0x001C(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EFowardType                                   FowardType;                                        // 0x001D(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1E[0x2];                                       // 0x001E(0x0002)(Fixing Size After Last Property [ Rei-SdkDumper ])
	float                                         Time;                                              // 0x0020(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EDialogueType                                 DialogueType;                                      // 0x0024(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Rei-SdkDumper ])
	float                                         TalkPlaySpeed;                                     // 0x0028(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseCustomSpeed;                                   // 0x002C(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseDefaultFontParams;                             // 0x002D(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2E[0x2];                                       // 0x002E(0x0002)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_FTalkConfig;

// ScriptStruct Plot.PlotCutSceneData
// 0x0080 (0x0080 - 0x0000)
struct FPlotCutSceneData final
{
public:
	struct FSoftObjectPath                        SequencePath;                                      // 0x0000(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMovieSceneSequencePlaybackSettings    Settings;                                          // 0x0018(0x0014)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Rei-SdkDumper ])
	struct FSoftObjectPath                        Style;                                             // 0x0030(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              Size;                                              // 0x0048(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              Position;                                          // 0x0050(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FadeInTime;                                        // 0x0058(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FadeOutTime;                                       // 0x005C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FadeOutTargetAlpha;                                // 0x0060(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PlayDelayTime;                                     // 0x0064(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FadeOutDelayTime;                                  // 0x0068(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              TargetPosition;                                    // 0x006C(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MoveDelayTime;                                     // 0x0074(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MoveSpeed;                                         // 0x0078(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Layer;                                             // 0x007C(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bIsMainCamera : 1;                                 // 0x007D(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_7E[0x2];                                       // 0x007E(0x0002)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_FPlotCutSceneData;

// ScriptStruct Plot.SubtitleRecord
// 0x0020 (0x0020 - 0x0000)
struct FSubtitleRecord final
{
public:
	class FString                                 Content;                                           // 0x0000(0x0010)(ZeroConstructor, Transient, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 WwiseEventID;                                      // 0x0010(0x0010)(ZeroConstructor, Transient, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FSubtitleRecord;

// ScriptStruct Plot.InteractionGameRecord
// 0x0038 (0x0038 - 0x0000)
struct FInteractionGameRecord final
{
public:
	class FString                                 Content;                                           // 0x0000(0x0010)(ZeroConstructor, Transient, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Speaker;                                           // 0x0010(0x0010)(ZeroConstructor, Transient, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          isCurTalking;                                      // 0x0020(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Rei-SdkDumper ])
	class FString                                 WwiseEventID;                                      // 0x0028(0x0010)(ZeroConstructor, Transient, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FInteractionGameRecord;

// ScriptStruct Plot.BackgroundSubtitlesOneByOneParams
// 0x000C (0x000C - 0x0000)
struct FBackgroundSubtitlesOneByOneParams final
{
public:
	float                                         Speed;                                             // 0x0000(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FadeOut;                                           // 0x0004(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DirTime;                                           // 0x0008(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FBackgroundSubtitlesOneByOneParams;

// ScriptStruct Plot.BackgroundSubtitlesParams
// 0x0010 (0x0010 - 0x0000)
struct FBackgroundSubtitlesParams final
{
public:
	EFowardType                                   FowardType;                                        // 0x0000(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPlotSubtitlesFadeInType                      FadeInType;                                        // 0x0001(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Rei-SdkDumper ])
	float                                         BlendInTime;                                       // 0x0004(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         WaitTime;                                          // 0x0008(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BlendOutTime;                                      // 0x000C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FBackgroundSubtitlesParams;

// ScriptStruct Plot.PlotAccessoriesInfo
// 0x0020 (0x0020 - 0x0000)
struct FPlotAccessoriesInfo final
{
public:
	struct FSoftObjectPath                        Accessorie;                                        // 0x0000(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   SokectName;                                        // 0x0018(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FPlotAccessoriesInfo;

// ScriptStruct Plot.PlotRoleInfo
// 0x0058 (0x0060 - 0x0008)
struct FPlotRoleInfo final : public FTableRowBase
{
public:
	int32                                         ID;                                                // 0x0008(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Rei-SdkDumper ])
	struct FSoftObjectPath                        Skeletal;                                          // 0x0010(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FPlotAccessoriesInfo>           AccessoriesSkeletal;                               // 0x0028(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	TSubclassOf<class UAnimInstance>              RoleAnimInstance;                                  // 0x0038(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftClassPath                         WeaponAssetPath;                                   // 0x0040(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   WeaponSocket;                                      // 0x0058(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FPlotRoleInfo;

// ScriptStruct Plot.PlotSound
// 0x0028 (0x0030 - 0x0008)
struct FPlotSound final : public FTableRowBase
{
public:
	int32                                         ID;                                                // 0x0008(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Rei-SdkDumper ])
	class FString                                 Desc;                                              // 0x0010(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 EventName;                                         // 0x0020(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FPlotSound;

// ScriptStruct Plot.SpotLightParameters
// 0x0020 (0x0020 - 0x0000)
struct FSpotLightParameters final
{
public:
	float                                         Intensity;                                         // 0x0000(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           LightColor;                                        // 0x0004(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AttenuationRadius;                                 // 0x0014(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InnerConeAngle;                                    // 0x0018(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         OuterConeAngle;                                    // 0x001C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FSpotLightParameters;

// ScriptStruct Plot.CGSpineAnimationData
// 0x0010 (0x0010 - 0x0000)
struct FCGSpineAnimationData final
{
public:
	class FString                                 Animation;                                         // 0x0000(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FCGSpineAnimationData;

// ScriptStruct Plot.CGSpineParameters
// 0x0028 (0x0028 - 0x0000)
struct FCGSpineParameters final
{
public:
	struct FVector2D                              Offset;                                            // 0x0000(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Scale;                                             // 0x0008(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Rei-SdkDumper ])
	TArray<struct FCGSpineAnimationData>          Animations;                                        // 0x0010(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          bLoop;                                             // 0x0020(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bHide;                                             // 0x0021(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_FCGSpineParameters;

// ScriptStruct Plot.BranchItemStruct
// 0x0010 (0x0050 - 0x0040)
struct FBranchItemStruct final : public FSelectItemData
{
public:
	class FString                                 JumpKey;                                           // 0x0040(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FBranchItemStruct;

// ScriptStruct Plot.NameSelected
// 0x0010 (0x0010 - 0x0000)
struct FNameSelected final
{
public:
	class FString                                 EventName;                                         // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FNameSelected;

}

