#pragma once

/*
* SDK generated by Rei-SdkDumper
* Based on Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RadarChart

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "RadarChart_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// Class RadarChart.RadarChart
// 0x0978 (0x0AA0 - 0x0128)
class URadarChart final : public UWidget
{
public:
	struct FRadarChartStyle                       ChartStyle;                                        // 0x0128(0x08E0)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	TArray<struct FRadarChartValueLayer>          ValueLayers;                                       // 0x0A08(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                         bWrapWithInvalidationPanel : 1;                    // 0x0A18(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_A19[0x7];                                      // 0x0A19(0x0007)(Fixing Size After Last Property [ Rei-SdkDumper ])
	TMulticastInlineDelegate<void(const struct FRadarChartEvent& Event)> OnClicked;                  // 0x0A20(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const struct FRadarChartEvent& Event)> OnPressed;                  // 0x0A30(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const struct FRadarChartEvent& Event)> OnReleased;                 // 0x0A40(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const struct FRadarChartEvent& Event)> OnHovered;                  // 0x0A50(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const struct FRadarChartEvent& Event)> OnUnhovered;                // 0x0A60(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const struct FRadarChartEvent& Event)> OnValueSlide;               // 0x0A70(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_A80[0x20];                                     // 0x0A80(0x0020)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])

public:
	void ForceRebuild();
	void InvalidateAllMaterials();
	void InvalidateMaterial(struct FRadarChartAppearance& InAppearance);
	void Refresh();
	void RefreshBase();
	void RefreshValueLayers();
	void SetNormalizationScale(float InValue);
	void SetValue(uint8 ValueLayerIndex, uint8 ValueIndex, float Value);
	void SetValuesForLayer(uint8 ValueLayerIndex, const TArray<float>& InValues);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("RadarChart")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"RadarChart")
	}
	static class URadarChart* GetDefaultObj()
	{
		return GetDefaultObjImpl<URadarChart>();
	}
};
DUMPER7_ASSERTS_URadarChart;

// Class RadarChart.RadarChartSetValuesAnimated
// 0x0050 (0x0080 - 0x0030)
class URadarChartSetValuesAnimated final : public UBlueprintAsyncActionBase
{
public:
	uint8                                         Pad_30[0x30];                                      // 0x0030(0x0030)(Fixing Size After Last Property [ Rei-SdkDumper ])
	TMulticastInlineDelegate<void(float Percent)> OnUpdate;                                          // 0x0060(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(float Percent)> OnFinished;                                        // 0x0070(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)

public:
	static class URadarChartSetValuesAnimated* SetValuesAnimated(class URadarChart* Target, uint8 ValueLayer, const TArray<float>& Values, float Duration, uint8 FPS, EEasingFunc Ease);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("RadarChartSetValuesAnimated")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"RadarChartSetValuesAnimated")
	}
	static class URadarChartSetValuesAnimated* GetDefaultObj()
	{
		return GetDefaultObjImpl<URadarChartSetValuesAnimated>();
	}
};
DUMPER7_ASSERTS_URadarChartSetValuesAnimated;

// Class RadarChart.RadarChartSetNormalizationScaleAnimated
// 0x0048 (0x0078 - 0x0030)
class URadarChartSetNormalizationScaleAnimated final : public UBlueprintAsyncActionBase
{
public:
	uint8                                         Pad_30[0x28];                                      // 0x0030(0x0028)(Fixing Size After Last Property [ Rei-SdkDumper ])
	TMulticastInlineDelegate<void(float Percent)> OnUpdate;                                          // 0x0058(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(float Percent)> OnFinished;                                        // 0x0068(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)

public:
	static class URadarChartSetNormalizationScaleAnimated* SetNormalizationScaleAnimated(class URadarChart* Target, float NewScale, float Duration, uint8 FPS, EEasingFunc Ease);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("RadarChartSetNormalizationScaleAnimated")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"RadarChartSetNormalizationScaleAnimated")
	}
	static class URadarChartSetNormalizationScaleAnimated* GetDefaultObj()
	{
		return GetDefaultObjImpl<URadarChartSetNormalizationScaleAnimated>();
	}
};
DUMPER7_ASSERTS_URadarChartSetNormalizationScaleAnimated;

}

