#pragma once

/*
* SDK generated by Rei-SdkDumper
* Based on Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Richman

#include "Basic.hpp"


namespace SDK
{

// Enum Richman.ERichmanOverType
// NumValues: 0x0005
enum class ERichmanOverType : uint8
{
	None                                     = 0,
	Money                                    = 1,
	RoundOver                                = 2,
	TotalDeath                               = 3,
	ERichmanOverType_MAX                     = 4,
};

// Enum Richman.EFaceObjectType
// NumValues: 0x0008
enum class EFaceObjectType : uint8
{
	None                                     = 0,
	Bomb                                     = 1,
	Explosive                                = 2,
	Landmine                                 = 3,
	Barrier                                  = 4,
	Telephone                                = 5,
	Missile                                  = 6,
	Max                                      = 7,
};

// Enum Richman.ERichmanCameraFollowType
// NumValues: 0x0006
enum class ERichmanCameraFollowType : uint8
{
	NotFollow                                = 0,
	AutoFollow                               = 1,
	ManualFollow                             = 2,
	CameraShow                               = 3,
	CameraShowStop                           = 4,
	ERichmanCameraFollowType_MAX             = 5,
};

// Enum Richman.ERichmanFreeCardType
// NumValues: 0x0003
enum class ERichmanFreeCardType : uint8
{
	Free                                     = 0,
	Transfer                                 = 1,
	ERichmanFreeCardType_MAX                 = 2,
};

// Enum Richman.ERichmanGameType
// NumValues: 0x0003
enum class ERichmanGameType : uint8
{
	Normal                                   = 0,
	Item                                     = 1,
	ERichmanGameType_MAX                     = 2,
};

// Enum Richman.EBombType
// NumValues: 0x0006
enum class EBombType : uint8
{
	none                                     = 0,
	landmine                                 = 1,
	explosive                                = 2,
	missile                                  = 3,
	telephone                                = 4,
	EBombType_MAX                            = 5,
};

// Enum Richman.ERichmanCharacterState
// NumValues: 0x0006
enum class ERichmanCharacterState : uint8
{
	None                                     = 0,
	MoveBefore                               = 1,
	Walking                                  = 2,
	MoveEnd                                  = 3,
	End                                      = 4,
	ERichmanCharacterState_MAX               = 5,
};

// Enum Richman.ERichmanNpcState
// NumValues: 0x0006
enum class ERichmanNpcState : uint8
{
	None                                     = 0,
	Slowly                                   = 1,
	Free                                     = 2,
	Hospital                                 = 3,
	Fishing                                  = 4,
	ERichmanNpcState_MAX                     = 5,
};

// ScriptStruct Richman.BombExistData
// 0x0010 (0x0010 - 0x0000)
struct FBombExistData final
{
public:
	class ARichman_ChessGround*                   BombGround;                                        // 0x0000(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EFaceObjectType                               Type;                                              // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_FBombExistData;

// ScriptStruct Richman.BombVictimData
// 0x0020 (0x0020 - 0x0000)
struct FBombVictimData final
{
public:
	class ARichmanCharacter*                      Character;                                         // 0x0000(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ARichman_ChessGround*                   BombGround;                                        // 0x0008(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         days;                                              // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Money;                                             // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EBombType                                     Type;                                              // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_FBombVictimData;

}

