#pragma once

/*
* SDK generated by Rei-SdkDumper
* Based on Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RichmanOL

#include "Basic.hpp"

#include "MiniGame_classes.hpp"
#include "Engine_classes.hpp"
#include "RichmanOL_structs.hpp"
#include "ChessMap_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// Class RichmanOL.RichmanOL_AIController
// 0x0038 (0x02D8 - 0x02A0)
class ARichmanOL_AIController final : public AController
{
public:
	class ARichmanOL_Character*                   CurrentChar;                                       // 0x02A0(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ARichmanOL_Mgr*                         RichmanMgr;                                        // 0x02A8(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsUIMode;                                          // 0x02B0(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2B1[0x7];                                      // 0x02B1(0x0007)(Fixing Size After Last Property [ Rei-SdkDumper ])
	class UCharacterMovementComponent*            TempMovement;                                      // 0x02B8(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          WaitCallback;                                      // 0x02C0(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C1[0x17];                                     // 0x02C1(0x0017)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])

public:
	void ExplosiveContinueMove();
	void ExplosiveFinishMove();
	void FixRotation();
	void RemoveMoveGroundTip();
	void ResetRichmanState();
	void ShowDirEffect();
	void StopMovementImmediately();

	class ARichmanOL_Character* GetCurrentChar() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("RichmanOL_AIController")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"RichmanOL_AIController")
	}
	static class ARichmanOL_AIController* GetDefaultObj()
	{
		return GetDefaultObjImpl<ARichmanOL_AIController>();
	}
};
DUMPER7_ASSERTS_ARichmanOL_AIController;

// Class RichmanOL.RichmanOL_AnimInstance
// 0x0010 (0x02D0 - 0x02C0)
class URichmanOL_AnimInstance final : public UAnimInstance
{
public:
	bool                                          IsPush;                                            // 0x02B8(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsRun;                                             // 0x02B9(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsWalk;                                            // 0x02BA(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsFaceToMoveDir;                                  // 0x02BB(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Speed;                                             // 0x02BC(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MoveToControllerAngle;                             // 0x02C0(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ScaleHorizontalSpeed;                              // 0x02C4(0x0004)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         HorizontalSpeed;                                   // 0x02C8(0x0004)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxSpeed;                                          // 0x02CC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("RichmanOL_AnimInstance")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"RichmanOL_AnimInstance")
	}
	static class URichmanOL_AnimInstance* GetDefaultObj()
	{
		return GetDefaultObjImpl<URichmanOL_AnimInstance>();
	}
};
DUMPER7_ASSERTS_URichmanOL_AnimInstance;

// Class RichmanOL.AnimNotify_OnRichmanOL_FootLanding
// 0x0000 (0x0038 - 0x0038)
class UAnimNotify_OnRichmanOL_FootLanding final : public UAnimNotify
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AnimNotify_OnRichmanOL_FootLanding")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AnimNotify_OnRichmanOL_FootLanding")
	}
	static class UAnimNotify_OnRichmanOL_FootLanding* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAnimNotify_OnRichmanOL_FootLanding>();
	}
};
DUMPER7_ASSERTS_UAnimNotify_OnRichmanOL_FootLanding;

// Class RichmanOL.RichmanOL_CameraFollow
// 0x00F8 (0x0320 - 0x0228)
class ARichmanOL_CameraFollow final : public AActor
{
public:
	class AActor*                                 Target;                                            // 0x0228(0x0008)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ARichmanOL_Mgr*                         RichmanMgr;                                        // 0x0230(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 FollowActor;                                       // 0x0238(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ARichmanOL_PlayerController*            PlayerController;                                  // 0x0240(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 ShowTarget;                                        // 0x0248(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TWeakObjectPtr<class AActor>                  CentralActor;                                      // 0x0250(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ERichmanOL_CameraFollowType                   FollowType;                                        // 0x0258(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_259[0x3];                                      // 0x0259(0x0003)(Fixing Size After Last Property [ Rei-SdkDumper ])
	float                                         MaxViewSize;                                       // 0x025C(0x0004)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MinViewSize;                                       // 0x0260(0x0004)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LightShowDistance;                                 // 0x0264(0x0004)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PerformSpeed;                                      // 0x0268(0x0004)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         NowZoom;                                           // 0x026C(0x0004)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FTransform                             CameraInitPos;                                     // 0x0270(0x0030)(Edit, DisableEditOnTemplate, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	float                                         CameraReturnDelay;                                 // 0x02A0(0x0004)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CameraReturnDuration;                              // 0x02A4(0x0004)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2A8[0x78];                                     // 0x02A8(0x0078)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])

public:
	bool CheckAutoFollowComplete();
	bool GetLockControl();
	bool IsSlidingView();
	void OnInit();
	void OnMouseMove(const struct FVector2D& DeltaPos);
	void OnZoomChange(float InZoom);
	void PlayReturnAnim(float Duration);
	void RefreshCameraRange(class AChessRegion* Region);
	void ResetCamera();
	void SetCameraShowTarget(class AActor* InTarget);
	void SetCentralActor();
	void SetFollowTarget(class AActor* InCharacter, bool Immediately);
	void SetLockControl(bool InLockControl);
	void SetSlidingView(bool bSlid);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("RichmanOL_CameraFollow")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"RichmanOL_CameraFollow")
	}
	static class ARichmanOL_CameraFollow* GetDefaultObj()
	{
		return GetDefaultObjImpl<ARichmanOL_CameraFollow>();
	}
};
DUMPER7_ASSERTS_ARichmanOL_CameraFollow;

// Class RichmanOL.RichmanOL_Character
// 0x0170 (0x0640 - 0x04D0)
class ARichmanOL_Character final : public AChessNpcBase
{
public:
	uint8                                         Pad_4C8[0x8];                                      // 0x04C8(0x0008)(Fixing Size After Last Property [ Rei-SdkDumper ])
	int32                                         TplId;                                             // 0x04D0(0x0004)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         uid;                                               // 0x04D4(0x0004)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<int32>                                 SkillIDs;                                          // 0x04D8(0x0010)(Net, ZeroConstructor, RepNotify, NativeAccessSpecifierPublic)
	int32                                         Charge;                                            // 0x04E8(0x0004)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MaxCharge;                                         // 0x04EC(0x0004)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Money;                                             // 0x04F0(0x0004)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         BuildScore;                                        // 0x04F4(0x0004)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         GuessValue;                                        // 0x04F8(0x0004)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         GuessIndex;                                        // 0x04FC(0x0004)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsAutoPlay;                                        // 0x0500(0x0001)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          InOperation;                                       // 0x0501(0x0001)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_502[0x2];                                      // 0x0502(0x0002)(Fixing Size After Last Property [ Rei-SdkDumper ])
	int32                                         StateCode;                                         // 0x0504(0x0004)(Net, ZeroConstructor, Transient, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          InIsland;                                          // 0x0508(0x0001)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_509[0x3];                                      // 0x0509(0x0003)(Fixing Size After Last Property [ Rei-SdkDumper ])
	int32                                         EscapeIslandCount;                                 // 0x050C(0x0004)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         CurrentUseCardId;                                  // 0x0510(0x0004)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TWeakObjectPtr<class AActor>                  SkillTarget;                                       // 0x0514(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Star1Value;                                        // 0x051C(0x0004)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Star2Value;                                        // 0x0520(0x0004)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Star3Value;                                        // 0x0524(0x0004)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         BitFlag;                                           // 0x0528(0x0004)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ActionID;                                          // 0x052C(0x0004)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FRichmanOL_SkillEffect>         Effects;                                           // 0x0530(0x0010)(Net, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          IsAI;                                              // 0x0540(0x0001)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_541[0x7];                                      // 0x0541(0x0007)(Fixing Size After Last Property [ Rei-SdkDumper ])
	class FString                                 PlayerName;                                        // 0x0548(0x0010)(Net, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         PlayerFaceId;                                      // 0x0558(0x0004)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         PlayerFrameId;                                     // 0x055C(0x0004)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 UniqueNetId;                                       // 0x0560(0x0010)(ZeroConstructor, Transient, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsLocalPlayer;                                     // 0x0570(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_571[0x3];                                      // 0x0571(0x0003)(Fixing Size After Last Property [ Rei-SdkDumper ])
	int32                                         DoubleCount;                                       // 0x0574(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         NextMoveStep;                                      // 0x0578(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          NextRoundTravel;                                   // 0x057C(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_57D[0x3];                                      // 0x057D(0x0003)(Fixing Size After Last Property [ Rei-SdkDumper ])
	TWeakObjectPtr<class AChessGround>            BornGround;                                        // 0x0580(0x0008)(Net, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TWeakObjectPtr<class AChessGround>            CurrentBuyGround;                                  // 0x0588(0x0008)(Net, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<int32>                                 PassiveSkills;                                     // 0x0590(0x0010)(Net, ZeroConstructor, Transient, NativeAccessSpecifierPublic)
	class ARichmanOL_Mgr*                         RichmanMgr;                                        // 0x05A0(0x0008)(Net, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         AddPassiveSkillRate;                               // 0x05A8(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TotalOfflineTime;                                  // 0x05AC(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TotalAutoTime;                                     // 0x05B0(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5B4[0x4];                                      // 0x05B4(0x0004)(Fixing Size After Last Property [ Rei-SdkDumper ])
	class URichmanOL_PlayerMovementComponent*     CharMoveComp;                                      // 0x05B8(0x0008)(Edit, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         RegionId;                                          // 0x05C0(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5C4[0x4];                                      // 0x05C4(0x0004)(Fixing Size After Last Property [ Rei-SdkDumper ])
	class ARichmanOL_PlayerController*            PlayerController;                                  // 0x05C8(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ARichmanOL_AIController*                AIController;                                      // 0x05D0(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsRun;                                             // 0x05D8(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsWalk;                                            // 0x05D9(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsRounding;                                        // 0x05DA(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          HasTransfer;                                       // 0x05DB(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsLookingAtCamera;                                 // 0x05DC(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5DD[0x3];                                      // 0x05DD(0x0003)(Fixing Size After Last Property [ Rei-SdkDumper ])
	int32                                         TopEffectId;                                       // 0x05E0(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         DebugSkillRate;                                    // 0x05E4(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5E8[0x14];                                     // 0x05E8(0x0014)(Fixing Size After Last Property [ Rei-SdkDumper ])
	float                                         AllRotateLerpSeconds;                              // 0x05FC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimMontage*                           MontageHappy;                                      // 0x0600(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimMontage*                           MontageSad;                                        // 0x0608(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimMontage*                           MontageJump;                                       // 0x0610(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimMontage*                           MontageJumpend;                                    // 0x0618(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimMontage*                           MontageGreeting;                                   // 0x0620(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimMontage*                           MontageSkill;                                      // 0x0628(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxWalkSpeed;                                      // 0x0630(0x0004)(Net, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_634[0xC];                                      // 0x0634(0x000C)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])

public:
	void AddCharge(int32 InValue);
	void AddEffect(const struct FRichmanOL_SkillEffect& Effect);
	bool AddMoney(int32 InValue);
	void DestroyTopEffect();
	void ForceSetSkillActive(int32 InSkillId, bool InValue);
	class FString GetHeadIconId();
	class FString GetLangNameKey();
	int32 GetNpcUID();
	struct FIntVector GetPosition();
	int32 GetRegionId();
	int32 GetStarValue(int32 idx);
	bool HasActiveEffect(class FName EffectName, int32* InSkillId, int32* InParam);
	bool HasEffectByName(class FName EffectName);
	void LuaImpl_NotifyInIslandChanged(bool InValue);
	void LuaImpl_NotifyInitSkills(const struct FRichmanOL_PlayerData& InData);
	void LuaImpl_NotifyMoveEnd(class ARichmanOL_ChessGround* InGround);
	void LuaImpl_NotifyThroughBornGround();
	void Multicast_DoExpression(int32 ExpressionId, int32 InRoleID);
	TArray<int32> NotifyEffectStage(ERichmanOL_FlowStage InStage, float Effective);
	void OnRep_ActionId();
	void OnRep_AutoPlay();
	void OnRep_BuildScore();
	void OnRep_Charge();
	void OnRep_GuessValue();
	void OnRep_InIsland();
	void OnRep_InOperation();
	void OnRep_Money();
	void OnRep_SkillIds();
	void OnRep_StateCode();
	void PlayTopEffect(int32 ID);
	void RemoveEffectByName(class FName InName);
	void RemoveEffectBySkillId(int32 SkillID);
	void ResetPosition();
	void SetActionId(int32 InActionId);
	void SetAutoPlay(bool InValue);
	void SetBitFlag(int32 InValue);
	void SetBuildScore(int32 InValue);
	void SetCharge(int32 InValue);
	void SetCurrentUseCardId(int32 InValue);
	void SetDebugSkillRate(int32 InValue);
	void SetGroundActor(class AChessGround* InGroundActor);
	void SetGuessIndex(int32 InValue);
	void SetGuessValue(int32 InValue);
	void SetInIsland(bool InValue);
	void SetInOperation(bool InValue);
	void SetMaxCharge(int32 InValue);
	void SetMoney(int32 InValue);
	void SetSkillIds(const TArray<int32>& InValue);
	void SetStarValue(int32 idx, int32 Value);
	void SetStateCode(int32 InValue);
	void StartMoving(int32 Steps);
	void Teleport(class ARichmanOL_ChessGround* InDestGround);
	void UpdateStandingGround();
	void UpdateWalkState(bool IsRun_0, bool IsWalk_0);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("RichmanOL_Character")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"RichmanOL_Character")
	}
	static class ARichmanOL_Character* GetDefaultObj()
	{
		return GetDefaultObjImpl<ARichmanOL_Character>();
	}
};
DUMPER7_ASSERTS_ARichmanOL_Character;

// Class RichmanOL.RichmanOL_ChessGround
// 0x0080 (0x02F8 - 0x0278)
class ARichmanOL_ChessGround final : public AChessGround
{
public:
	int32                                         Distance;                                          // 0x0278(0x0004)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         GroundIndex;                                       // 0x027C(0x0004)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ARichmanOL_BuildingObject*              BuildingObject;                                    // 0x0280(0x0008)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TollMultiplier;                                    // 0x0288(0x0004)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsColorMonopoly;                                   // 0x028C(0x0001)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_28D[0x3];                                      // 0x028D(0x0003)(Fixing Size After Last Property [ Rei-SdkDumper ])
	float                                         SkillTollMultiplier;                               // 0x0290(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SkillTollMultiplierEnemy;                          // 0x0294(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ERichmanOL_BuildingDirection                  BuildingDirection;                                 // 0x0298(0x0001)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_299[0x3];                                      // 0x0299(0x0003)(Fixing Size After Last Property [ Rei-SdkDumper ])
	float                                         ReduceTollMultUntilArrive;                         // 0x029C(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReduceTollMultUntilArriveEnemy;                    // 0x02A0(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          PowerOffUntilArrive;                               // 0x02A4(0x0001)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          TollFreeUntilArrive;                               // 0x02A5(0x0001)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2A6[0x2];                                      // 0x02A6(0x0002)(Fixing Size After Last Property [ Rei-SdkDumper ])
	struct FVector                                PosOffset;                                         // 0x02A8(0x000C)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               PlayerRotation;                                    // 0x02B4(0x000C)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	TArray<TWeakObjectPtr<class ARichmanOL_Character>> GroundCharacters;                             // 0x02C0(0x0010)(Net, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
	TWeakObjectPtr<class ARichmanOL_Mgr>          RichmanMgr;                                        // 0x02D0(0x0008)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UStaticMeshComponent*                   MeshComponent;                                     // 0x02D8(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UMaterialInterface*>             NormalMaterials;                                   // 0x02E0(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPublic)
	int32                                         TopEffectId;                                       // 0x02F0(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2F4[0x4];                                      // 0x02F4(0x0004)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])

public:
	bool CheckObjectHasTag(const class FString& InTagName);
	void DestroyBuilding();
	class ARichmanOL_BuildingObject* GetBuilding();
	class AChessObject* GetFirstObjectByTag(const class FString& InTagName);
	bool IsInFrontOfBuilding(class ARichmanOL_BuildingObject* InBuilding);
	void NotifyCharacterEntry(class ARichmanOL_Character* InCharacter, bool IsMoving);
	void NotifyCharacterLeave(class ARichmanOL_Character* InCharacter);
	void OnRep_IsColorMonopoly();
	void SetColorMonopoly(bool InValue);
	void SetSkillTollMultiplier(float InSkillTollMultiplier);
	void SetSkillTollMultiplierEnemy(float InSkillTollMultiplier);
	void UpdateTollMultiplier();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("RichmanOL_ChessGround")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"RichmanOL_ChessGround")
	}
	static class ARichmanOL_ChessGround* GetDefaultObj()
	{
		return GetDefaultObjImpl<ARichmanOL_ChessGround>();
	}
};
DUMPER7_ASSERTS_ARichmanOL_ChessGround;

// Class RichmanOL.RichmanOL_ChessObject
// 0x0000 (0x0258 - 0x0258)
class ARichmanOL_ChessObject : public AChessObject
{
public:
	class FString GetTagParam();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("RichmanOL_ChessObject")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"RichmanOL_ChessObject")
	}
	static class ARichmanOL_ChessObject* GetDefaultObj()
	{
		return GetDefaultObjImpl<ARichmanOL_ChessObject>();
	}
};
DUMPER7_ASSERTS_ARichmanOL_ChessObject;

// Class RichmanOL.RichmanOL_BuildingObject
// 0x0090 (0x02E8 - 0x0258)
class ARichmanOL_BuildingObject final : public ARichmanOL_ChessObject
{
public:
	class ARichmanOL_BuildingObject*              ParentBuilding;                                    // 0x0258(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ARichmanOL_BuildingObject*              ChildBuilding;                                     // 0x0260(0x0008)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMeshComponent*                         MeshComponent;                                     // 0x0268(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USkeletalMeshComponent*                 SkeletalMeshComponent;                             // 0x0270(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UMaterialInterface*>             NormalMaterials;                                   // 0x0278(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPublic)
	class UMeshComponent*                         ChildMeshComponent;                                // 0x0288(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UMaterialInterface*>             ChildNormalMaterials;                              // 0x0290(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPublic)
	TWeakObjectPtr<class ARichmanOL_Mgr>          RichmanMgr;                                        // 0x02A0(0x0008)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ARichmanOL_Character*                   OwnerCharacter;                                    // 0x02A8(0x0008)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Level;                                             // 0x02B0(0x0004)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InitGroundMeshHeight;                              // 0x02B4(0x0004)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ARichmanOL_ChessGround*                 ParentGround;                                      // 0x02B8(0x0008)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterialInterface*                     MyMaterial;                                        // 0x02C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterialInterface*                     EnemyMaterial;                                     // 0x02C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimSequence*                          IdleAnim;                                          // 0x02D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimSequence*                          FuncAnim;                                          // 0x02D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         EffectId;                                          // 0x02E0(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2E4[0x4];                                      // 0x02E4(0x0004)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])

public:
	void ChangeOwner(class ARichmanOL_Character* InOwner);
	int32 GetBuildingLevel();
	ERichmanOL_BuildingType GetBuildingType();
	int32 GetChildTplId();
	class ARichmanOL_Character* GetOwnerCharacter();
	void OnRep_OnChildBuildingChange();
	void OnRep_OnOwnerChange();
	void SetLevel(int32 InLevel, class ARichmanOL_Character* InOwner);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("RichmanOL_BuildingObject")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"RichmanOL_BuildingObject")
	}
	static class ARichmanOL_BuildingObject* GetDefaultObj()
	{
		return GetDefaultObjImpl<ARichmanOL_BuildingObject>();
	}
};
DUMPER7_ASSERTS_ARichmanOL_BuildingObject;

// Class RichmanOL.RichmanOL_Library
// 0x0000 (0x0028 - 0x0028)
class URichmanOL_Library final : public UBlueprintFunctionLibrary
{
public:
	static void AdjustMap(class AChessRegion* Region);
	static bool CheckSingleMonopoly(class ARichmanOL_Mgr* InMgr, class ARichmanOL_Character* InCharacter, class ARichmanOL_ChessGround* InGMGround, int32* NeedCount, TArray<class ARichmanOL_ChessGround*>* Grounds);
	static class ARichmanOL_BuildingObject* FindBuildingById(class ARichmanOL_Mgr* InMgr, int32 ID);
	static class ARichmanOL_ChessGround* FindGroundById(class ARichmanOL_Mgr* InMgr, int64 uid);
	static class AChessGround* FindGroundByPos(class ARichmanOL_Mgr* InMgr, int32 PosX, int32 PosY);
	static class ARichmanOL_ChessGround* FindGroundByUID(class ARichmanOL_Mgr* InMgr, int64 uid);
	static TArray<class ARichmanOL_ChessGround*> FindGroundListByType(class ARichmanOL_Character* InMe, ERichmanOL_GroundType InType);
	static class AChessObject* FindObjectById(class ARichmanOL_Mgr* InMgr, int64 uid);
	static class ARichmanOL_BuildingObject* GetBuildingByType(class ARichmanOL_Mgr* InMgr, ERichmanOL_BuildingType InType);
	static ERichmanOL_BuildingType GetBuildingType(int32 TplId);
	static TArray<class ARichmanOL_BuildingObject*> GetCharacterBuildings(class ARichmanOL_Mgr* InMgr, class ARichmanOL_Character* InCharacter, int32 MinLevel, int32 MaxLevel);
	static int32 GetDiceThrow(int32 Max, int32 Min);
	static class ARichmanOL_ChessGround* GetGroundByBuildingType(class ARichmanOL_Mgr* InMgr, ERichmanOL_BuildingType InType);
	static int32 GetMonopolyColorCount(class ARichmanOL_Mgr* InMgr, class ARichmanOL_Character* InCharacter, class ARichmanOL_ChessGround* InGMGround, TArray<class ARichmanOL_ChessGround*>* Grounds, int32* InMinNeed);
	static int32 GetNpcActiveSkillId(class ARichmanOL_Mgr* InMgr, int32 NpcId);
	static int32 GetObjectIcon(class ARichmanOL_Mgr* InMgr, int32 TplId);
	static class FString GetObjectName(class ARichmanOL_Mgr* InMgr, int32 TplId);
	static bool IsClient(class AActor* Owner);
	static bool IsDS(class AActor* Owner);
	static bool IsStandalone(class AActor* Owner);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("RichmanOL_Library")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"RichmanOL_Library")
	}
	static class URichmanOL_Library* GetDefaultObj()
	{
		return GetDefaultObjImpl<URichmanOL_Library>();
	}
};
DUMPER7_ASSERTS_URichmanOL_Library;

// Class RichmanOL.RichmanOL_Local
// 0x01A8 (0x03D0 - 0x0228)
class ARichmanOL_Local final : public AActor
{
public:
	uint8                                         Pad_228[0x8];                                      // 0x0228(0x0008)(Fixing Size After Last Property [ Rei-SdkDumper ])
	float                                         MaxStepDistance;                                   // 0x0230(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxStepAnimTime;                                   // 0x0234(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         StepAnimDelay;                                     // 0x0238(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_23C[0x4];                                      // 0x023C(0x0004)(Fixing Size After Last Property [ Rei-SdkDumper ])
	class ARichmanOL_PlayerController*            PlayerController;                                  // 0x0240(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ARichmanOL_CameraFollow*                CameraFollow;                                      // 0x0248(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ARichmanOL_Mgr*                         Mgr;                                               // 0x0250(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ARichmanOL_Character*                   Me;                                                // 0x0258(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ARichmanOL_Character*                   Enemy;                                             // 0x0260(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsInitOk;                                          // 0x0268(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsLuaInitOk;                                       // 0x0269(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_26A[0x6];                                      // 0x026A(0x0006)(Fixing Size After Last Property [ Rei-SdkDumper ])
	TMap<int32, class UFXSystemComponent*>        AllEffects;                                        // 0x0270(0x0050)(ExportObject, Transient, ContainsInstancedReference, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C0[0x110];                                    // 0x02C0(0x0110)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])

public:
	void DestroyEffect(int32 InEffectId);
	class UFXSystemComponent* FindEffectById(int32 InId);
	bool LuaImpl_CheckInitOK();
	void LuaImpl_NotifyColorMonopoly(class ARichmanOL_ChessGround* InGround);
	void LuaImpl_NotifyEntrySpecialBuilding(ERichmanOL_BuildingType InType, class ARichmanOL_BuildingObject* InBuilding);
	void LuaImpl_NotifyGroundBuildingChanged(class ARichmanOL_BuildingObject* InBuilding);
	void LuaImpl_NotifyInitSuccess();
	void LuaImpl_NotifyLuaTick(float InDeltaTime);
	void LuaImpl_NotifyMoveToGround(class ARichmanOL_ChessGround* InGround);
	void LuaImpl_NotifyRefreshUI(class ARichmanOL_Character* InCharacter, ERichmanOL_RefreshUIType InType);
	void LuaImpl_ShowExpression(int32 ExpressionId, int32 InRoleID);
	int32 PlayEffect(const class FString& InPath, const struct FVector& InLocation, const struct FRotator& InRotate, const struct FVector& InScale, bool IsPersistent);
	int32 PlayEffectAttached(const class FString& InPath, class USceneComponent* AttachToComponent, const struct FVector& InLocation, const struct FRotator& InRotate, const struct FVector& InScale, bool IsPersistent);
	int32 PlayEffectAttachedById(int32 ID, class USceneComponent* AttachToComponent, const struct FVector& InLocation, const struct FRotator& InRotate, bool IsPersistent);
	int32 PlayEffectById(int32 ID, const struct FVector& InLocation, const struct FRotator& InRotate, bool IsPersistent);
	void PlayGroundClickAnim(class ARichmanOL_ChessGround* InGround);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("RichmanOL_Local")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"RichmanOL_Local")
	}
	static class ARichmanOL_Local* GetDefaultObj()
	{
		return GetDefaultObjImpl<ARichmanOL_Local>();
	}
};
DUMPER7_ASSERTS_ARichmanOL_Local;

// Class RichmanOL.RichmanOL_Mgr
// 0x02E8 (0x05A0 - 0x02B8)
class ARichmanOL_Mgr final : public AMiniGameHandler
{
public:
	uint8                                         Pad_2B8[0x8];                                      // 0x02B8(0x0008)(Fixing Size After Last Property [ Rei-SdkDumper ])
	struct FRichmanOL_PlayerData                  Player1Data;                                       // 0x02C0(0x0040)(Edit, NativeAccessSpecifierPublic)
	struct FRichmanOL_PlayerData                  Player2Data;                                       // 0x0300(0x0040)(Edit, NativeAccessSpecifierPublic)
	int32                                         TestLevelId;                                       // 0x0340(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         TestPlayerCount;                                   // 0x0344(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AChessMapActor*                         ChessMapActor;                                     // 0x0348(0x0008)(Net, ZeroConstructor, Transient, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class ARichmanOL_Character*>           AllCharacters;                                     // 0x0350(0x0010)(Net, ZeroConstructor, NativeAccessSpecifierPublic)
	int32                                         VictoryScore;                                      // 0x0360(0x0004)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         PlayerCount;                                       // 0x0364(0x0004)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         FightLevelID;                                      // 0x0368(0x0004)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_36C[0x4];                                      // 0x036C(0x0004)(Fixing Size After Last Property [ Rei-SdkDumper ])
	class ARichmanOL_Character*                   CurrentCharacter;                                  // 0x0370(0x0008)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<int32>                                 ShopCards;                                         // 0x0378(0x0010)(Net, ZeroConstructor, NativeAccessSpecifierPublic)
	int32                                         InitMoney;                                         // 0x0388(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_38C[0x4];                                      // 0x038C(0x0004)(Fixing Size After Last Property [ Rei-SdkDumper ])
	TArray<class AActor*>                         AllGrounds;                                        // 0x0390(0x0010)(Net, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class ARichmanOL_AIController*>        AIControllers;                                     // 0x03A0(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPublic)
	class AChessRegion*                           CurrentRegion;                                     // 0x03B0(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsDS;                                              // 0x03B8(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsClient;                                          // 0x03B9(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsStandalone;                                      // 0x03BA(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3BB[0x1];                                      // 0x03BB(0x0001)(Fixing Size After Last Property [ Rei-SdkDumper ])
	float                                         CharacterMoveSpeed;                                // 0x03BC(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ARichmanOL_Character*                   FirstCharacter;                                    // 0x03C0(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ARichmanOL_Character*                   SecondCharacter;                                   // 0x03C8(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ERichmanOL_FlowStage                          GameStage;                                         // 0x03D0(0x0001)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3D1[0x1];                                      // 0x03D1(0x0001)(Fixing Size After Last Property [ Rei-SdkDumper ])
	int16                                         Round;                                             // 0x03D2(0x0002)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int16                                         WinWay;                                            // 0x03D4(0x0002)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3D6[0x2];                                      // 0x03D6(0x0002)(Fixing Size After Last Property [ Rei-SdkDumper ])
	class ARichmanOL_Character*                   WinCharacter;                                      // 0x03D8(0x0008)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsSwitchAction;                                    // 0x03E0(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3E1[0x3];                                      // 0x03E1(0x0003)(Fixing Size After Last Property [ Rei-SdkDumper ])
	float                                         PosOffset;                                         // 0x03E4(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                InitNpcOffset1;                                    // 0x03E8(0x000C)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                InitNpcOffset2;                                    // 0x03F4(0x000C)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TollMultiplierWhenColorMonopoly;                   // 0x0400(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_404[0x10C];                                    // 0x0404(0x010C)(Fixing Size After Last Property [ Rei-SdkDumper ])
	class ARichmanOL_Local*                       LocalPlayer;                                       // 0x0510(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_518[0x88];                                     // 0x0518(0x0088)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])

public:
	class ARichmanOL_Character* FindCharacterByUID(int32 uid);
	void GetAllCharacters(TArray<class ARichmanOL_Character*>* inArray);
	void GetAllRichmanActor(TArray<class AChessObject*>* inArray);
	class ARichmanOL_Character* GetEnemyCharacter(class ARichmanOL_Character* InMe);
	void GotoStage(ERichmanOL_FlowStage InStage);
	void LuaImpl_NotifyEntryStage(ERichmanOL_FlowStage InStage);
	void LuaImpl_NotifyExitStage(ERichmanOL_FlowStage InStage);
	void LuaImpl_NotifyTick(float DeltaTime);
	void LuaImpl_Start();
	void OnRep_ChessMapActor();
	void OnRep_CurrentCharacter();
	void OnRep_FightLevelID();
	void OnRep_GameStage();
	void OnRep_Round();
	void ResetMap();
	void SetCurrentCharacter(class ARichmanOL_Character* InCharacter);
	void SetFightLevelID(int32 InId);
	void SetPlayerOrder(class ARichmanOL_Character* InFirst, class ARichmanOL_Character* InSecond);
	void SetRound(int32 InValue);
	void StartGame(int32 LevelID, const class FString& LevelPath);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("RichmanOL_Mgr")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"RichmanOL_Mgr")
	}
	static class ARichmanOL_Mgr* GetDefaultObj()
	{
		return GetDefaultObjImpl<ARichmanOL_Mgr>();
	}
};
DUMPER7_ASSERTS_ARichmanOL_Mgr;

// Class RichmanOL.RichmanOL_PlayerController
// 0x0030 (0x05C8 - 0x0598)
class ARichmanOL_PlayerController final : public AMiniGamePlayerController
{
public:
	uint8                                         Pad_598[0x8];                                      // 0x0598(0x0008)(Fixing Size After Last Property [ Rei-SdkDumper ])
	class ARichmanOL_Mgr*                         RichmanMgr;                                        // 0x05A0(0x0008)(Net, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ARichmanOL_Character*                   CurrentCharacter;                                  // 0x05A8(0x0008)(Net, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsLoadingComplete;                                 // 0x05B0(0x0001)(Net, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5B1[0x17];                                     // 0x05B1(0x0017)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])

public:
	void CallClient(int32 InCmd, const class FString& InContent);
	void CallClient2(int32 InCmd, const class FString& InContent);
	void CallDS(int32 InCmd, const class FString& InContent);
	void CallDS2(int32 InCmd, const class FString& InContent);
	bool CanConsumeExpressionPoint();
	void ConsumeExpressionPoint();
	int32 GetBuyPrice(int32 SrcPrice);
	class AActor* GetClickActor(bool IgnoreGround);
	class ARichmanOL_Character* GetCurrentChar();
	int32 GetLevelUpPrice(int32 SrcPrice);
	int32 GetTollPrice(int32 SrcPrice);
	void GMServerCall(const class FString& FuncName, const class FString& InParam);
	void GMServerCallExec(const class FString& FuncName, const class FString& InParam);
	void LuaImpl_CallClientExec(int32 InCmd, const class FString& InContent);
	void LuaImpl_CallDSExec(int32 InCmd, const class FString& InContent);
	void NotifyClientLoadingComplete();
	void NotifyGiveupRoom();
	void OnTouch();
	void Server_RequestExpression(int32 ExpressionId);
	void SetMoveByMouse();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("RichmanOL_PlayerController")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"RichmanOL_PlayerController")
	}
	static class ARichmanOL_PlayerController* GetDefaultObj()
	{
		return GetDefaultObjImpl<ARichmanOL_PlayerController>();
	}
};
DUMPER7_ASSERTS_ARichmanOL_PlayerController;

// Class RichmanOL.RichmanOL_PlayerMovementComponent
// 0x0080 (0x0B80 - 0x0B00)
class URichmanOL_PlayerMovementComponent final : public UCharacterMovementComponent
{
public:
	uint8                                         Pad_B00[0x20];                                     // 0x0B00(0x0020)(Fixing Size After Last Property [ Rei-SdkDumper ])
