#pragma once

/*
* SDK generated by Rei-SdkDumper
* Based on Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Richman

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Richman_structs.hpp"


namespace SDK::Params
{

// Function Richman.Richman_ChessGround.CheckObjectHasTag
// 0x0018 (0x0018 - 0x0000)
struct Richman_ChessGround_CheckObjectHasTag final
{
public:
	class FString                                 InTagName;                                         // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_Richman_ChessGround_CheckObjectHasTag;

// Function Richman.Richman_ChessGround.GetBuilding
// 0x0008 (0x0008 - 0x0000)
struct Richman_ChessGround_GetBuilding final
{
public:
	class ARichman_BuildingObject*                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Richman_ChessGround_GetBuilding;

// Function Richman.Richman_ChessGround.GetObjectsByTag
// 0x0020 (0x0020 - 0x0000)
struct Richman_ChessGround_GetObjectsByTag final
{
public:
	class FString                                 InTagName;                                         // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class AChessObject*>                   ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Richman_ChessGround_GetObjectsByTag;

// Function Richman.Richman_ChessGround.HasProp
// 0x0001 (0x0001 - 0x0000)
struct Richman_ChessGround_HasProp final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Richman_ChessGround_HasProp;

// Function Richman.Richman_ChessGround.IsInFrontOfBuilding
// 0x0010 (0x0010 - 0x0000)
struct Richman_ChessGround_IsInFrontOfBuilding final
{
public:
	class ARichman_BuildingObject*                InBuilding;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_Richman_ChessGround_IsInFrontOfBuilding;

// Function Richman.Richman_ChessObject.GetTagParam
// 0x0010 (0x0010 - 0x0000)
struct Richman_ChessObject_GetTagParam final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Richman_ChessObject_GetTagParam;

// Function Richman.Richman_BuildingObject.GetOwnerCharacter
// 0x0008 (0x0008 - 0x0000)
struct Richman_BuildingObject_GetOwnerCharacter final
{
public:
	class ARichmanCharacter*                      ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Richman_BuildingObject_GetOwnerCharacter;

// Function Richman.Richman_BuildingObject.GetRealLevel
// 0x0004 (0x0004 - 0x0000)
struct Richman_BuildingObject_GetRealLevel final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Richman_BuildingObject_GetRealLevel;

// Function Richman.Richman_BuildingObject.GetRealTplId
// 0x0004 (0x0004 - 0x0000)
struct Richman_BuildingObject_GetRealTplId final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Richman_BuildingObject_GetRealTplId;

// Function Richman.RichmanAIController.LookAtTarget
// 0x0008 (0x0008 - 0x0000)
struct RichmanAIController_LookAtTarget final
{
public:
	class AChessBase*                             InActor;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RichmanAIController_LookAtTarget;

// Function Richman.RichmanAIController.SetScale
// 0x0004 (0x0004 - 0x0000)
struct RichmanAIController_SetScale final
{
public:
	float                                         InValue;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RichmanAIController_SetScale;

// Function Richman.RichmanAIController.StartMoving
// 0x0008 (0x0008 - 0x0000)
struct RichmanAIController_StartMoving final
{
public:
	int32                                         Steps;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          InForce;                                           // 0x0004(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsCustomFlag;                                      // 0x0005(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_RichmanAIController_StartMoving;

// Function Richman.RichmanAIController.UpdateWalkState
// 0x0002 (0x0002 - 0x0000)
struct RichmanAIController_UpdateWalkState final
{
public:
	bool                                          IsRun;                                             // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsWalk;                                            // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RichmanAIController_UpdateWalkState;

// Function Richman.RichmanAIController.GetCurrentChar
// 0x0008 (0x0008 - 0x0000)
struct RichmanAIController_GetCurrentChar final
{
public:
	class ARichmanCharacter*                      ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RichmanAIController_GetCurrentChar;

// Function Richman.RichmanCameraFollow.CheckAutoFollowComplete
// 0x0001 (0x0001 - 0x0000)
struct RichmanCameraFollow_CheckAutoFollowComplete final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RichmanCameraFollow_CheckAutoFollowComplete;

// Function Richman.RichmanCameraFollow.GetLockControl
// 0x0001 (0x0001 - 0x0000)
struct RichmanCameraFollow_GetLockControl final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RichmanCameraFollow_GetLockControl;

// Function Richman.RichmanCameraFollow.IsSlidingView
// 0x0001 (0x0001 - 0x0000)
struct RichmanCameraFollow_IsSlidingView final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RichmanCameraFollow_IsSlidingView;

// Function Richman.RichmanCameraFollow.OnMouseMove
// 0x0008 (0x0008 - 0x0000)
struct RichmanCameraFollow_OnMouseMove final
{
public:
	struct FVector2D                              DeltaPos;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RichmanCameraFollow_OnMouseMove;

// Function Richman.RichmanCameraFollow.OnZoomChange
// 0x0004 (0x0004 - 0x0000)
struct RichmanCameraFollow_OnZoomChange final
{
public:
	float                                         InZoom;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RichmanCameraFollow_OnZoomChange;

// Function Richman.RichmanCameraFollow.RefreshCameraRange
// 0x0008 (0x0008 - 0x0000)
struct RichmanCameraFollow_RefreshCameraRange final
{
public:
	class AChessRegion*                           Region;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RichmanCameraFollow_RefreshCameraRange;

// Function Richman.RichmanCameraFollow.SetCameraShowTarget
// 0x0008 (0x0008 - 0x0000)
struct RichmanCameraFollow_SetCameraShowTarget final
{
public:
	class AActor*                                 InTarget;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RichmanCameraFollow_SetCameraShowTarget;

// Function Richman.RichmanCameraFollow.SetFollowTarget
// 0x0010 (0x0010 - 0x0000)
struct RichmanCameraFollow_SetFollowTarget final
{
public:
	class AActor*                                 InCharacter;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Immediately;                                       // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_RichmanCameraFollow_SetFollowTarget;

// Function Richman.RichmanCameraFollow.SetLockControl
// 0x0001 (0x0001 - 0x0000)
struct RichmanCameraFollow_SetLockControl final
{
public:
	bool                                          InLockControl;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RichmanCameraFollow_SetLockControl;

// Function Richman.RichmanCameraFollow.SetSlidingView
// 0x0001 (0x0001 - 0x0000)
struct RichmanCameraFollow_SetSlidingView final
{
public:
	bool                                          bSlid;                                             // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RichmanCameraFollow_SetSlidingView;

// Function Richman.RichmanCharacter.ApplyBuyLand
// 0x0001 (0x0001 - 0x0000)
struct RichmanCharacter_ApplyBuyLand final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RichmanCharacter_ApplyBuyLand;

// Function Richman.RichmanCharacter.CheckHasObjectByParam
// 0x0018 (0x0018 - 0x0000)
struct RichmanCharacter_CheckHasObjectByParam final
{
public:
	class FString                                 InParam;                                           // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_RichmanCharacter_CheckHasObjectByParam;

// Function Richman.RichmanCharacter.CheckLandAvailabilityForPurchase
// 0x0001 (0x0001 - 0x0000)
struct RichmanCharacter_CheckLandAvailabilityForPurchase final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RichmanCharacter_CheckLandAvailabilityForPurchase;

// Function Richman.RichmanCharacter.EntryHospital
// 0x0004 (0x0004 - 0x0000)
struct RichmanCharacter_EntryHospital final
{
public:
	int32                                         InDay;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RichmanCharacter_EntryHospital;

// Function Richman.RichmanCharacter.GetAIController
// 0x0008 (0x0008 - 0x0000)
struct RichmanCharacter_GetAIController final
{
public:
	class ARichmanAIController*                   ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RichmanCharacter_GetAIController;

// Function Richman.RichmanCharacter.GetChessGround
// 0x0008 (0x0008 - 0x0000)
struct RichmanCharacter_GetChessGround final
{
public:
	class ARichman_ChessGround*                   ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RichmanCharacter_GetChessGround;

// Function Richman.RichmanCharacter.GetHeadIconId
// 0x0010 (0x0010 - 0x0000)
struct RichmanCharacter_GetHeadIconId final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RichmanCharacter_GetHeadIconId;

// Function Richman.RichmanCharacter.GetLangNameKey
// 0x0010 (0x0010 - 0x0000)
struct RichmanCharacter_GetLangNameKey final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RichmanCharacter_GetLangNameKey;

// Function Richman.RichmanCharacter.GetNpcUID
// 0x0004 (0x0004 - 0x0000)
struct RichmanCharacter_GetNpcUID final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RichmanCharacter_GetNpcUID;

// Function Richman.RichmanCharacter.GetPosition
// 0x000C (0x000C - 0x0000)
struct RichmanCharacter_GetPosition final
{
public:
	struct FIntVector                             ReturnValue;                                       // 0x0000(0x000C)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RichmanCharacter_GetPosition;

// Function Richman.RichmanCharacter.GetRegionId
// 0x0004 (0x0004 - 0x0000)
struct RichmanCharacter_GetRegionId final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RichmanCharacter_GetRegionId;

// Function Richman.RichmanCharacter.GetTeamId
// 0x0004 (0x0004 - 0x0000)
struct RichmanCharacter_GetTeamId final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RichmanCharacter_GetTeamId;

// Function Richman.RichmanCharacter.GotoFlowState
// 0x0001 (0x0001 - 0x0000)
struct RichmanCharacter_GotoFlowState final
{
public:
	ERichmanCharacterState                        InNewState;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RichmanCharacter_GotoFlowState;

// Function Richman.RichmanCharacter.IsAnyMontagePlaying
// 0x0001 (0x0001 - 0x0000)
struct RichmanCharacter_IsAnyMontagePlaying final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RichmanCharacter_IsAnyMontagePlaying;

// Function Richman.RichmanCharacter.MoveTo
// 0x0018 (0x0018 - 0x0000)
struct RichmanCharacter_MoveTo final
{
public:
	class AChessRegion*                           InRegion;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         InPosX;                                            // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         InPosY;                                            // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          InUpdate3DPos;                                     // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0011(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_RichmanCharacter_MoveTo;

// Function Richman.RichmanCharacter.OnMoveEnd
// 0x0008 (0x0008 - 0x0000)
struct RichmanCharacter_OnMoveEnd final
{
public:
	class ARichman_ChessGround*                   Ground;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RichmanCharacter_OnMoveEnd;

// Function Richman.RichmanCharacter.PlayTopEffect
// 0x0004 (0x0004 - 0x0000)
struct RichmanCharacter_PlayTopEffect final
{
public:
	int32                                         ID;                                                // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RichmanCharacter_PlayTopEffect;

// Function Richman.RichmanCharacter.SetGroundActor
// 0x0008 (0x0008 - 0x0000)
struct RichmanCharacter_SetGroundActor final
{
public:
	class AChessGround*                           InGroundActor;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RichmanCharacter_SetGroundActor;

// Function Richman.RichmanCharacter.StartMoving
// 0x0004 (0x0004 - 0x0000)
struct RichmanCharacter_StartMoving final
{
public:
	int32                                         Steps;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RichmanCharacter_StartMoving;

// Function Richman.RichmanGameMode.DestroyEffect
// 0x0004 (0x0004 - 0x0000)
struct RichmanGameMode_DestroyEffect final
{
public:
	int32                                         InEffectId;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RichmanGameMode_DestroyEffect;

// Function Richman.RichmanGameMode.PlayCustomAnim
// 0x0020 (0x0020 - 0x0000)
struct RichmanGameMode_PlayCustomAnim final
{
public:
	class FString                                 InPath;                                            // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 TargetActor;                                       // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bLooping;                                          // 0x0018(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_RichmanGameMode_PlayCustomAnim;

// Function Richman.RichmanGameMode.PlayEffect
// 0x0030 (0x0030 - 0x0000)
struct RichmanGameMode_PlayEffect final
{
public:
	class FString                                 InPath;                                            // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                InLocation;                                        // 0x0010(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               InRotate;                                          // 0x001C(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          IsPersistent;                                      // 0x0028(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Rei-SdkDumper ])
	int32                                         ReturnValue;                                       // 0x002C(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RichmanGameMode_PlayEffect;

// Function Richman.RichmanGameMode.PlayEffectAttached
// 0x0038 (0x0038 - 0x0000)
struct RichmanGameMode_PlayEffectAttached final
{
public:
	class FString                                 InPath;                                            // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USceneComponent*                        AttachToComponent;                                 // 0x0010(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                InLocation;                                        // 0x0018(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               InRotate;                                          // 0x0024(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          IsPersistent;                                      // 0x0030(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Rei-SdkDumper ])
	int32                                         ReturnValue;                                       // 0x0034(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RichmanGameMode_PlayEffectAttached;

// Function Richman.RichmanGroundSelector.GetAllCanReachGridsByCard
// 0x0020 (0x0020 - 0x0000)
struct RichmanGroundSelector_GetAllCanReachGridsByCard final
{
public:
	class ARichmanCharacter*                      InCharacter;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         InStep;                                            // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Rei-SdkDumper ])
	class FString                                 FindType;                                          // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RichmanGroundSelector_GetAllCanReachGridsByCard;

// Function Richman.RichmanGroundSelector.OnDirGroundSelected
// 0x0004 (0x0004 - 0x0000)
struct RichmanGroundSelector_OnDirGroundSelected final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RichmanGroundSelector_OnDirGroundSelected;

// Function Richman.RichmanGroundSelector.SelectGroundByIndex
// 0x0004 (0x0004 - 0x0000)
struct RichmanGroundSelector_SelectGroundByIndex final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RichmanGroundSelector_SelectGroundByIndex;

// Function Richman.RichmanGroundSelector.SetBombOrBarrier
// 0x0010 (0x0010 - 0x0000)
struct RichmanGroundSelector_SetBombOrBarrier final
{
public:
	class ARichmanCharacter*                      InCharacter;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         InStep;                                            // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          CleanFlag;                                         // 0x000C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_RichmanGroundSelector_SetBombOrBarrier;

// Function Richman.RichmanGroundSelector.SetCharacter
// 0x0010 (0x0010 - 0x0000)
struct RichmanGroundSelector_SetCharacter final
{
public:
	class ARichmanCharacter*                      InCharacter;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         InStep;                                            // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_RichmanGroundSelector_SetCharacter;

// Function Richman.RichmanLibrary.AISelectCardTarget
// 0x0018 (0x0018 - 0x0000)
struct RichmanLibrary_AISelectCardTarget final
{
public:
	class ARichmanMgr*                            InMgr;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ARichmanCharacter*                      Character;                                         // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ARichmanCharacter*                      ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RichmanLibrary_AISelectCardTarget;

// Function Richman.RichmanLibrary.AISelectCardTargetFromArray
// 0x0028 (0x0028 - 0x0000)
struct RichmanLibrary_AISelectCardTargetFromArray final
{
public:
	class ARichmanMgr*                            InMgr;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ARichmanCharacter*                      InCharacter;                                       // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class ARichmanCharacter*>              CanSelectCharacters;                               // 0x0010(0x0010)(Parm, ZeroConstructor, NativeAccessSpecifierPublic)
	class ARichmanCharacter*                      ReturnValue;                                       // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RichmanLibrary_AISelectCardTargetFromArray;

// Function Richman.RichmanLibrary.ChainExplosion
// 0x0038 (0x0038 - 0x0000)
struct RichmanLibrary_ChainExplosion final
{
public:
	class ARichmanMgr*                            InMgr;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ARichman_ChessGround*                   Ground;                                            // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ARichmanCharacter*                      Character;                                         // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FBombExistData>                 BombExistDatas;                                    // 0x0018(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FBombVictimData>                ReturnValue;                                       // 0x0028(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RichmanLibrary_ChainExplosion;

// Function Richman.RichmanLibrary.ChainExplosion_Nearest
// 0x0038 (0x0038 - 0x0000)
struct RichmanLibrary_ChainExplosion_Nearest final
{
public:
	class ARichmanMgr*                            InMgr;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ARichman_ChessGround*                   Ground;                                            // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ARichmanCharacter*                      Character;                                         // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FBombExistData>                 BombExistDatas;                                    // 0x0018(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FBombVictimData>                ReturnValue;                                       // 0x0028(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RichmanLibrary_ChainExplosion_Nearest;

// Function Richman.RichmanLibrary.CheckCanLevelup
// 0x0018 (0x0018 - 0x0000)
struct RichmanLibrary_CheckCanLevelup final
{
public:
	class ARichmanMgr*                            InMgr;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ARichman_ChessObject*                   InChessObject;                                     // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_RichmanLibrary_CheckCanLevelup;

// Function Richman.RichmanLibrary.CheckObjectIsBuilding
// 0x0018 (0x0018 - 0x0000)
struct RichmanLibrary_CheckObjectIsBuilding final
{
public:
	class ARichmanMgr*                            InMgr;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ARichman_ChessObject*                   InGround;                                          // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_RichmanLibrary_CheckObjectIsBuilding;

// Function Richman.RichmanLibrary.GetAllMoveDirs
// 0x0028 (0x0028 - 0x0000)
struct RichmanLibrary_GetAllMoveDirs final
{
public:
	class ARichmanCharacter*                      InCharacter;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ARichman_ChessGround*                   InGround;                                          // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<int32>                                 AllCanReachGirds;                                  // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	int32                                         BackDir;                                           // 0x0020(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0024(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RichmanLibrary_GetAllMoveDirs;

// Function Richman.RichmanLibrary.GetAllSurviveCharacter
// 0x0028 (0x0028 - 0x0000)
struct RichmanLibrary_GetAllSurviveCharacter final
{
public:
	class ARichmanMgr*                            InMgr;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ARichmanCharacter*                      InCharacter;                                       // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          CanInHospital;                                     // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          CanIncludeSelf;                                    // 0x0011(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Rei-SdkDumper ])
	TArray<class ARichmanCharacter*>              ReturnValue;                                       // 0x0018(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RichmanLibrary_GetAllSurviveCharacter;

// Function Richman.RichmanLibrary.GetAllSurviveCharacterForwardGround
// 0x0020 (0x0020 - 0x0000)
struct RichmanLibrary_GetAllSurviveCharacterForwardGround final
{
public:
	class ARichmanMgr*                            InMgr;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ARichmanCharacter*                      InCharacter;                                       // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class ARichman_ChessGround*>           ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RichmanLibrary_GetAllSurviveCharacterForwardGround;

// Function Richman.RichmanLibrary.GetBuildingBuyPrice
// 0x0010 (0x0010 - 0x0000)
struct RichmanLibrary_GetBuildingBuyPrice final
{
public:
	class ARichmanMgr*                            InMgr;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         InTplId;                                           // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x000C(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RichmanLibrary_GetBuildingBuyPrice;

// Function Richman.RichmanLibrary.GetBuildingBuyPriceSrc
// 0x0010 (0x0010 - 0x0000)
struct RichmanLibrary_GetBuildingBuyPriceSrc final
{
public:
	class ARichmanMgr*                            InMgr;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         InTplId;                                           // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x000C(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RichmanLibrary_GetBuildingBuyPriceSrc;

// Function Richman.RichmanLibrary.GetBuildingDescKey
// 0x0020 (0x0020 - 0x0000)
struct RichmanLibrary_GetBuildingDescKey final
{
public:
	class ARichmanMgr*                            InMgr;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         InTplId;                                           // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Rei-SdkDumper ])
	class FString                                 ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RichmanLibrary_GetBuildingDescKey;

// Function Richman.RichmanLibrary.GetBuildingLevelUpId
// 0x0010 (0x0010 - 0x0000)
struct RichmanLibrary_GetBuildingLevelUpId final
{
public:
	class ARichmanMgr*                            InMgr;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         InTplId;                                           // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x000C(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RichmanLibrary_GetBuildingLevelUpId;

// Function Richman.RichmanLibrary.GetBuildingLevelUpIdByGround
// 0x0018 (0x0018 - 0x0000)
struct RichmanLibrary_GetBuildingLevelUpIdByGround final
{
public:
	class ARichmanMgr*                            InMgr;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AChessGround*                           InGround;                                          // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_RichmanLibrary_GetBuildingLevelUpIdByGround;

// Function Richman.RichmanLibrary.GetBuildingLevelUpPrice
// 0x0010 (0x0010 - 0x0000)
struct RichmanLibrary_GetBuildingLevelUpPrice final
{
public:
	class ARichmanMgr*                            InMgr;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         InTplId;                                           // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x000C(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RichmanLibrary_GetBuildingLevelUpPrice;

// Function Richman.RichmanLibrary.GetBuildingNameKey
// 0x0020 (0x0020 - 0x0000)
struct RichmanLibrary_GetBuildingNameKey final
{
public:
	class ARichmanMgr*                            InMgr;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         InTplId;                                           // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Rei-SdkDumper ])
	class FString                                 ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RichmanLibrary_GetBuildingNameKey;

// Function Richman.RichmanLibrary.GetBuildingOwnerCharacter
// 0x0010 (0x0010 - 0x0000)
struct RichmanLibrary_GetBuildingOwnerCharacter final
{
public:
	class ARichman_BuildingObject*                InBuilding;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ARichmanCharacter*                      ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RichmanLibrary_GetBuildingOwnerCharacter;

// Function Richman.RichmanLibrary.GetBuildingOwnerCharacterTeamId
// 0x0010 (0x0010 - 0x0000)
struct RichmanLibrary_GetBuildingOwnerCharacterTeamId final
{
public:
	class ARichman_BuildingObject*                InBuilding;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_RichmanLibrary_GetBuildingOwnerCharacterTeamId;

// Function Richman.RichmanLibrary.GetBuildingTollPrice
// 0x0010 (0x0010 - 0x0000)
struct RichmanLibrary_GetBuildingTollPrice final
{
public:
	class ARichmanMgr*                            InMgr;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         InTplId;                                           // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x000C(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RichmanLibrary_GetBuildingTollPrice;

// Function Richman.RichmanLibrary.GetBuildingToMaxLevel
// 0x0010 (0x0010 - 0x0000)
struct RichmanLibrary_GetBuildingToMaxLevel final
{
public:
	class ARichmanMgr*                            InMgr;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         InTplId;                                           // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x000C(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RichmanLibrary_GetBuildingToMaxLevel;

// Function Richman.RichmanLibrary.GetBuildingTplId
// 0x0018 (0x0018 - 0x0000)
struct RichmanLibrary_GetBuildingTplId final
{
public:
	class ARichmanMgr*                            InMgr;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         InBaseTplId;                                       // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         InLevel;                                           // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_RichmanLibrary_GetBuildingTplId;

// Function Richman.RichmanLibrary.GetCharacterBuildings
// 0x0018 (0x0018 - 0x0000)
struct RichmanLibrary_GetCharacterBuildings final
{
public:
	class ARichmanCharacter*                      InCharacter;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class ARichman_BuildingObject*>        ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RichmanLibrary_GetCharacterBuildings;

// Function Richman.RichmanLibrary.GetDiceThrow
// 0x000C (0x000C - 0x0000)
struct RichmanLibrary_GetDiceThrow final
{
public:
	int32                                         Max;                                               // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Min;                                               // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RichmanLibrary_GetDiceThrow;

// Function Richman.RichmanLibrary.GetDropIdFromRandomItemGround
// 0x0018 (0x0018 - 0x0000)
struct RichmanLibrary_GetDropIdFromRandomItemGround final
{
public:
	class ARichmanMgr*                            InMgr;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ARichman_ChessGround*                   Ground;                                            // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_RichmanLibrary_GetDropIdFromRandomItemGround;

// Function Richman.RichmanLibrary.GetNearbyBuilding
// 0x0020 (0x0020 - 0x0000)
struct RichmanLibrary_GetNearbyBuilding final
{
public:
	class ARichman_BuildingObject*                InBuilding;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ARichmanCharacter*                      InCharacter;                                       // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class ARichman_BuildingObject*>        ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RichmanLibrary_GetNearbyBuilding;

// Function Richman.RichmanLibrary.GetNoOwnerBuildings
// 0x0018 (0x0018 - 0x0000)
struct RichmanLibrary_GetNoOwnerBuildings final
{
public:
	class ARichmanMgr*                            InMgr;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class ARichman_BuildingObject*>        ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RichmanLibrary_GetNoOwnerBuildings;

// Function Richman.RichmanLibrary.GetRandomItemIdFromRandomGround
// 0x0018 (0x0018 - 0x0000)
struct RichmanLibrary_GetRandomItemIdFromRandomGround final
{
public:
	class ARichmanMgr*                            InMgr;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ARichman_ChessGround*                   Ground;                                            // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_RichmanLibrary_GetRandomItemIdFromRandomGround;

// Function Richman.RichmanLibrary.IsBarrierHere
// 0x0020 (0x0020 - 0x0000)
struct RichmanLibrary_IsBarrierHere final
{
public:
	class ARichmanMgr*                            InMgr;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ARichmanCharacter*                      Character;                                         // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ARichman_ChessGround*                   Ground;                                            // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_RichmanLibrary_IsBarrierHere;

// Function Richman.RichmanLibrary.IsBomb_item
// 0x0038 (0x0038 - 0x0000)
struct RichmanLibrary_IsBomb_item final
{
public:
	class ARichmanMgr*                            InMgr;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ARichmanCharacter*                      Character;                                         // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ARichman_ChessGround*                   Ground;                                            // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FBombExistData>                 BombExistDatas;                                    // 0x0018(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FBombVictimData>                ReturnValue;                                       // 0x0028(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RichmanLibrary_IsBomb_item;

// Function Richman.RichmanLibrary.IsBomb_item_Nearest
// 0x0038 (0x0038 - 0x0000)
struct RichmanLibrary_IsBomb_item_Nearest final
{
public:
