#pragma once

/*
* SDK generated by Rei-SdkDumper
* Based on Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RichmanOL

#include "Basic.hpp"


namespace SDK
{

// Enum RichmanOL.ERichmanOL_CameraFollowType
// NumValues: 0x0006
enum class ERichmanOL_CameraFollowType : uint8
{
	NotFollow                                = 0,
	AutoFollow                               = 1,
	ManualFollow                             = 2,
	CameraShow                               = 3,
	CameraShowStop                           = 4,
	ERichmanOL_MAX                           = 5,
};

// Enum RichmanOL.ERichmanOL_BuildingType
// NumValues: 0x0006
enum class ERichmanOL_BuildingType : uint8
{
	Normal                                   = 0,
	Born                                     = 1,
	Island                                   = 2,
	Shop                                     = 3,
	Railway                                  = 4,
	ERichmanOL_MAX                           = 5,
};

// Enum RichmanOL.ERichmanOL_GroundType
// NumValues: 0x0008
enum class ERichmanOL_GroundType : uint8
{
	Empty                                    = 0,
	Self                                     = 1,
	SelfButNotLandmark                       = 2,
	Enemy                                    = 3,
	EnemyButNotLandmark                      = 4,
	RailwayGround                            = 5,
	All                                      = 6,
	ERichmanOL_MAX                           = 7,
};

// Enum RichmanOL.ERichmanOL_BuildingDirection
// NumValues: 0x0006
enum class ERichmanOL_BuildingDirection : uint8
{
	None                                     = 0,
	Up                                       = 1,
	Down                                     = 2,
	Left                                     = 3,
	Right                                    = 4,
	Max                                      = 5,
};

// Enum RichmanOL.ERichmanOL_RefreshUIType
// NumValues: 0x000F
enum class ERichmanOL_RefreshUIType : uint8
{
	None                                     = 0,
	Charge                                   = 1,
	Money                                    = 2,
	BuildScore                               = 3,
	Skill                                    = 4,
	GuessValue                               = 5,
	AutoPlay                                 = 6,
	CurrentCharacterChanged                  = 7,
	StageChanged                             = 8,
	RoundChanged                             = 9,
	InOperation                              = 10,
	InIsland                                 = 11,
	ActionID                                 = 12,
	StateCode                                = 13,
	ERichmanOL_MAX                           = 14,
};

// Enum RichmanOL.ERichmanOL_FlowStage
// NumValues: 0x0019
enum class ERichmanOL_FlowStage : uint8
{
	None                                     = 0,
	Waiting                                  = 1,
	Begin                                    = 2,
	Init                                     = 3,
	Guess                                    = 4,
	Start                                    = 5,
	NewRoundBegin                            = 10,
	CharacterRoundBegin                      = 11,
	Ready                                    = 12,
	EntryIsland                              = 13,
	EscapeFromIsland                         = 14,
	Operation                                = 15,
	CastSkill                                = 16,
	Touzi                                    = 17,
	Moving                                   = 18,
	MovingEnd                                = 19,
	CharacterRoundEnd                        = 20,
	GM                                       = 30,
	TouZiEnd                                 = 50,
	Skill_TouziDouble3                       = 51,
	Skill_TollEnd                            = 52,
	Skill_AfterUseSkill                      = 53,
	Skill_ThroughBornGround                  = 54,
	GameEnd                                  = 99,
	ERichmanOL_MAX                           = 100,
};

// ScriptStruct RichmanOL.RichmanOL_SkillEffect
// 0x0014 (0x0014 - 0x0000)
struct FRichmanOL_SkillEffect final
{
public:
	class FName                                   Name;                                              // 0x0000(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int16                                         SkillID;                                           // 0x0008(0x0002)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int16                                         Rate;                                              // 0x000A(0x0002)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int16                                         Param1;                                            // 0x000C(0x0002)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Active;                                            // 0x000E(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ERichmanOL_FlowStage                          ActiveStage;                                       // 0x000F(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ERichmanOL_FlowStage                          ResetStage;                                        // 0x0010(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ERichmanOL_FlowStage                          DeleteStage;                                       // 0x0011(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_12[0x2];                                       // 0x0012(0x0002)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_FRichmanOL_SkillEffect;

// ScriptStruct RichmanOL.RichmanOL_PlayerData
// 0x0040 (0x0040 - 0x0000)
struct FRichmanOL_PlayerData final
{
public:
	int32                                         NpcId;                                             // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Rei-SdkDumper ])
	TArray<int32>                                 PassiveSkills;                                     // 0x0008(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	class FString                                 PlayerName;                                        // 0x0018(0x0010)(ZeroConstructor, Transient, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         PlayerFace;                                        // 0x0028(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         PlayerFrame;                                       // 0x002C(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 UniqueNetId;                                       // 0x0030(0x0010)(ZeroConstructor, Transient, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FRichmanOL_PlayerData;

}

