#pragma once

/*
* SDK generated by Rei-SdkDumper
* Based on Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RichmanLove

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "RichmanLove_structs.hpp"


namespace SDK::Params
{

// Function RichmanLove.RichmanLove_ChessGround.CheckHasObject
// 0x0001 (0x0001 - 0x0000)
struct RichmanLove_ChessGround_CheckHasObject final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RichmanLove_ChessGround_CheckHasObject;

// Function RichmanLove.RichmanLove_ChessGround.CheckObjectHasTag
// 0x0018 (0x0018 - 0x0000)
struct RichmanLove_ChessGround_CheckObjectHasTag final
{
public:
	class FString                                 InTagName;                                         // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_RichmanLove_ChessGround_CheckObjectHasTag;

// Function RichmanLove.RichmanLove_ChessGround.GetObjectsByTag
// 0x0020 (0x0020 - 0x0000)
struct RichmanLove_ChessGround_GetObjectsByTag final
{
public:
	class FString                                 InTagName;                                         // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class AChessObject*>                   ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RichmanLove_ChessGround_GetObjectsByTag;

// Function RichmanLove.RichmanLove_ChessGround.HasProp
// 0x0001 (0x0001 - 0x0000)
struct RichmanLove_ChessGround_HasProp final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RichmanLove_ChessGround_HasProp;

// Function RichmanLove.RichmanLove_ChessObject.GetTagParam
// 0x0010 (0x0010 - 0x0000)
struct RichmanLove_ChessObject_GetTagParam final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RichmanLove_ChessObject_GetTagParam;

// Function RichmanLove.RichmanLoveCameraFollow.CheckAutoFollowComplete
// 0x0001 (0x0001 - 0x0000)
struct RichmanLoveCameraFollow_CheckAutoFollowComplete final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RichmanLoveCameraFollow_CheckAutoFollowComplete;

// Function RichmanLove.RichmanLoveCameraFollow.GetLockControl
// 0x0001 (0x0001 - 0x0000)
struct RichmanLoveCameraFollow_GetLockControl final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RichmanLoveCameraFollow_GetLockControl;

// Function RichmanLove.RichmanLoveCameraFollow.IsSlidingView
// 0x0001 (0x0001 - 0x0000)
struct RichmanLoveCameraFollow_IsSlidingView final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RichmanLoveCameraFollow_IsSlidingView;

// Function RichmanLove.RichmanLoveCameraFollow.OnMouseMove
// 0x0008 (0x0008 - 0x0000)
struct RichmanLoveCameraFollow_OnMouseMove final
{
public:
	struct FVector2D                              DeltaPos;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RichmanLoveCameraFollow_OnMouseMove;

// Function RichmanLove.RichmanLoveCameraFollow.OnZoomChange
// 0x0004 (0x0004 - 0x0000)
struct RichmanLoveCameraFollow_OnZoomChange final
{
public:
	float                                         InZoom;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RichmanLoveCameraFollow_OnZoomChange;

// Function RichmanLove.RichmanLoveCameraFollow.RefreshCameraRange
// 0x0008 (0x0008 - 0x0000)
struct RichmanLoveCameraFollow_RefreshCameraRange final
{
public:
	class AChessRegion*                           Region;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RichmanLoveCameraFollow_RefreshCameraRange;

// Function RichmanLove.RichmanLoveCameraFollow.SetFollowTarget
// 0x0010 (0x0010 - 0x0000)
struct RichmanLoveCameraFollow_SetFollowTarget final
{
public:
	class AActor*                                 InCharacter;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Immediately;                                       // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_RichmanLoveCameraFollow_SetFollowTarget;

// Function RichmanLove.RichmanLoveCameraFollow.SetLockControl
// 0x0001 (0x0001 - 0x0000)
struct RichmanLoveCameraFollow_SetLockControl final
{
public:
	bool                                          InLockControl;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RichmanLoveCameraFollow_SetLockControl;

// Function RichmanLove.RichmanLoveCameraFollow.SetSlidingView
// 0x0001 (0x0001 - 0x0000)
struct RichmanLoveCameraFollow_SetSlidingView final
{
public:
	bool                                          bSlid;                                             // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RichmanLoveCameraFollow_SetSlidingView;

// Function RichmanLove.RichmanLoveGroundSelector.GetAllCanReachGridsByCard
// 0x0020 (0x0020 - 0x0000)
struct RichmanLoveGroundSelector_GetAllCanReachGridsByCard final
{
public:
	class AActor*                                 InCharacter;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         InStep;                                            // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Rei-SdkDumper ])
	class FString                                 FindType;                                          // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RichmanLoveGroundSelector_GetAllCanReachGridsByCard;

// Function RichmanLove.RichmanLoveGroundSelector.OnDirGroundSelected
// 0x0004 (0x0004 - 0x0000)
struct RichmanLoveGroundSelector_OnDirGroundSelected final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RichmanLoveGroundSelector_OnDirGroundSelected;

// Function RichmanLove.RichmanLoveGroundSelector.SetCharacter
// 0x0010 (0x0010 - 0x0000)
struct RichmanLoveGroundSelector_SetCharacter final
{
public:
	class AActor*                                 InCharacter;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         InStep;                                            // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_RichmanLoveGroundSelector_SetCharacter;

// Function RichmanLove.RichmanLoveLibrary.GetAllMoveDirs
// 0x0030 (0x0030 - 0x0000)
struct RichmanLoveLibrary_GetAllMoveDirs final
{
public:
	class AActor*                                 InCharacter;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ARichmanLove_ChessGround*               InGround;                                          // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ARichmanLoveMgr*                        InMgr;                                             // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<int32>                                 AllCanReachGirds;                                  // 0x0018(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	int32                                         BackDir;                                           // 0x0028(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x002C(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RichmanLoveLibrary_GetAllMoveDirs;

// Function RichmanLove.RichmanLoveLibrary.GetBuildingDescKey
// 0x0020 (0x0020 - 0x0000)
struct RichmanLoveLibrary_GetBuildingDescKey final
{
public:
	class ARichmanLoveMgr*                        InMgr;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         InTplId;                                           // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Rei-SdkDumper ])
	class FString                                 ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RichmanLoveLibrary_GetBuildingDescKey;

// Function RichmanLove.RichmanLoveLibrary.GetBuildingNameKey
// 0x0020 (0x0020 - 0x0000)
struct RichmanLoveLibrary_GetBuildingNameKey final
{
public:
	class ARichmanLoveMgr*                        InMgr;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         InTplId;                                           // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Rei-SdkDumper ])
	class FString                                 ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RichmanLoveLibrary_GetBuildingNameKey;

// Function RichmanLove.RichmanLoveLibrary.GetDiceThrow
// 0x000C (0x000C - 0x0000)
struct RichmanLoveLibrary_GetDiceThrow final
{
public:
	int32                                         Max;                                               // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Min;                                               // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RichmanLoveLibrary_GetDiceThrow;

// Function RichmanLove.RichmanLoveLibrary.SetSelectWalkDirection
// 0x0018 (0x0018 - 0x0000)
struct RichmanLoveLibrary_SetSelectWalkDirection final
{
public:
	class ARichmanLoveMgr*                        InMgr;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 InCharacter;                                       // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_RichmanLoveLibrary_SetSelectWalkDirection;

// Function RichmanLove.RichmanLoveMgr.ActiveNiagara
// 0x0001 (0x0001 - 0x0000)
struct RichmanLoveMgr_ActiveNiagara final
{
public:
	bool                                          Inactive;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RichmanLoveMgr_ActiveNiagara;

// Function RichmanLove.RichmanLoveMgr.CheckHaveGirl
// 0x0001 (0x0001 - 0x0000)
struct RichmanLoveMgr_CheckHaveGirl final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RichmanLoveMgr_CheckHaveGirl;

// Function RichmanLove.RichmanLoveMgr.CheckIsGameOver
// 0x0001 (0x0001 - 0x0000)
struct RichmanLoveMgr_CheckIsGameOver final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RichmanLoveMgr_CheckIsGameOver;

// Function RichmanLove.RichmanLoveMgr.DestroyEffect
// 0x0004 (0x0004 - 0x0000)
struct RichmanLoveMgr_DestroyEffect final
{
public:
	int32                                         InEffectId;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RichmanLoveMgr_DestroyEffect;

// Function RichmanLove.RichmanLoveMgr.GetClickActor
// 0x0010 (0x0010 - 0x0000)
struct RichmanLoveMgr_GetClickActor final
{
public:
	bool                                          IgnoreGround;                                      // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Rei-SdkDumper ])
	class AActor*                                 ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RichmanLoveMgr_GetClickActor;

// Function RichmanLove.RichmanLoveMgr.GetGroundByObject
// 0x0010 (0x0010 - 0x0000)
struct RichmanLoveMgr_GetGroundByObject final
{
public:
	class AActor*                                 InActor;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AChessGround*                           ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RichmanLoveMgr_GetGroundByObject;

// Function RichmanLove.RichmanLoveMgr.InitGirlNpcTrans
// 0x0050 (0x0050 - 0x0000)
struct RichmanLoveMgr_InitGirlNpcTrans final
{
public:
	int32                                         InId;                                              // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                InRotation;                                        // 0x0004(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                InScale;                                           // 0x0010(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Rei-SdkDumper ])
	struct FTransform                             ReturnValue;                                       // 0x0020(0x0030)(Parm, OutParm, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RichmanLoveMgr_InitGirlNpcTrans;

// Function RichmanLove.RichmanLoveMgr.InitPlayerTrans
// 0x0050 (0x0050 - 0x0000)
struct RichmanLoveMgr_InitPlayerTrans final
{
public:
	bool                                          InIsFirst;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Rei-SdkDumper ])
	struct FVector                                InRotation;                                        // 0x0004(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                InScale;                                           // 0x0010(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Rei-SdkDumper ])
	struct FTransform                             ReturnValue;                                       // 0x0020(0x0030)(Parm, OutParm, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RichmanLoveMgr_InitPlayerTrans;

// Function RichmanLove.RichmanLoveMgr.MoveGirlToOtherGround
// 0x0008 (0x0008 - 0x0000)
struct RichmanLoveMgr_MoveGirlToOtherGround final
{
public:
	class AActor*                                 InGirl;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RichmanLoveMgr_MoveGirlToOtherGround;

// Function RichmanLove.RichmanLoveMgr.NotifyLuaTick
// 0x0004 (0x0004 - 0x0000)
struct RichmanLoveMgr_NotifyLuaTick final
{
public:
	float                                         InDeltaTime;                                       // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RichmanLoveMgr_NotifyLuaTick;

// Function RichmanLove.RichmanLoveMgr.OnReachGrid
// 0x0008 (0x0008 - 0x0000)
struct RichmanLoveMgr_OnReachGrid final
{
public:
	class ARichmanLove_ChessGround*               InGround;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RichmanLoveMgr_OnReachGrid;

// Function RichmanLove.RichmanLoveMgr.PlayEffectById
// 0x0024 (0x0024 - 0x0000)
struct RichmanLoveMgr_PlayEffectById final
{
public:
	int32                                         ID;                                                // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                InLocation;                                        // 0x0004(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               InRotate;                                          // 0x0010(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          IsPersistent;                                      // 0x001C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Rei-SdkDumper ])
	int32                                         ReturnValue;                                       // 0x0020(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RichmanLoveMgr_PlayEffectById;

// Function RichmanLove.RichmanLoveMgr.ShowDirEffect
// 0x0008 (0x0008 - 0x0000)
struct RichmanLoveMgr_ShowDirEffect final
{
public:
	bool                                          InIsFirst;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          InIsShowEffect;                                    // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Rei-SdkDumper ])
	int32                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RichmanLoveMgr_ShowDirEffect;

// Function RichmanLove.RichmanLoveMgr.StartGame
// 0x0038 (0x0038 - 0x0000)
struct RichmanLoveMgr_StartGame final
{
public:
	class FString                                 InDlcId;                                           // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         InMapId;                                           // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         InRegionId;                                        // 0x0014(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 InSaved;                                           // 0x0018(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 InDataPath;                                        // 0x0028(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RichmanLoveMgr_StartGame;

// Function RichmanLove.RichmanLoveMgr.StartMoving
// 0x0008 (0x0008 - 0x0000)
struct RichmanLoveMgr_StartMoving final
{
public:
	int32                                         Steps;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          InForce;                                           // 0x0004(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsCustom;                                          // 0x0005(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_RichmanLoveMgr_StartMoving;

// Function RichmanLove.RichmanLoveMgr.UpdateSpineCommunication
// 0x0008 (0x0008 - 0x0000)
struct RichmanLoveMgr_UpdateSpineCommunication final
{
public:
	class AActor*                                 InGirl;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RichmanLoveMgr_UpdateSpineCommunication;

// Function RichmanLove.RichmanLoveSaveComponent.AddAbility
// 0x0008 (0x0008 - 0x0000)
struct RichmanLoveSaveComponent_AddAbility final
{
public:
	ERichmanLovePlayerAbility                     InAbility;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Rei-SdkDumper ])
	float                                         InValue;                                           // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RichmanLoveSaveComponent_AddAbility;

// Function RichmanLove.RichmanLoveSaveComponent.AddItem
// 0x0008 (0x0008 - 0x0000)
struct RichmanLoveSaveComponent_AddItem final
{
public:
	int32                                         InTplId;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RichmanLoveSaveComponent_AddItem;

// Function RichmanLove.RichmanLoveSaveComponent.AddPlotRead
// 0x000C (0x000C - 0x0000)
struct RichmanLoveSaveComponent_AddPlotRead final
{
public:
	int32                                         InId;                                              // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         InGirlId;                                          // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_RichmanLoveSaveComponent_AddPlotRead;

// Function RichmanLove.RichmanLoveSaveComponent.AddState
// 0x000C (0x000C - 0x0000)
struct RichmanLoveSaveComponent_AddState final
{
public:
	ERichmanLovePlayerState                       InState;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Rei-SdkDumper ])
	int32                                         InDay;                                             // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RichmanLoveSaveComponent_AddState;

// Function RichmanLove.RichmanLoveSaveComponent.ApplyUseItem
// 0x0008 (0x0008 - 0x0000)
struct RichmanLoveSaveComponent_ApplyUseItem final
{
public:
	int32                                         InUId;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_RichmanLoveSaveComponent_ApplyUseItem;

// Function RichmanLove.RichmanLoveSaveComponent.CheckDuringSpWeek
// 0x0001 (0x0001 - 0x0000)
struct RichmanLoveSaveComponent_CheckDuringSpWeek final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RichmanLoveSaveComponent_CheckDuringSpWeek;

// Function RichmanLove.RichmanLoveSaveComponent.CheckHasItem
// 0x0008 (0x0008 - 0x0000)
struct RichmanLoveSaveComponent_CheckHasItem final
{
public:
	int32                                         InTplId;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_RichmanLoveSaveComponent_CheckHasItem;

// Function RichmanLove.RichmanLoveSaveComponent.CheckIsLastWeek
// 0x0001 (0x0001 - 0x0000)
struct RichmanLoveSaveComponent_CheckIsLastWeek final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RichmanLoveSaveComponent_CheckIsLastWeek;

// Function RichmanLove.RichmanLoveSaveComponent.CheckPlotIsRead
// 0x0008 (0x0008 - 0x0000)
struct RichmanLoveSaveComponent_CheckPlotIsRead final
{
public:
	int32                                         InId;                                              // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_RichmanLoveSaveComponent_CheckPlotIsRead;

// Function RichmanLove.RichmanLoveSaveComponent.DiscardPopOut
// 0x0004 (0x0004 - 0x0000)
struct RichmanLoveSaveComponent_DiscardPopOut final
{
public:
	int32                                         InUId;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RichmanLoveSaveComponent_DiscardPopOut;

// Function RichmanLove.RichmanLoveSaveComponent.DynamicAddSpGround
// 0x0001 (0x0001 - 0x0000)
struct RichmanLoveSaveComponent_DynamicAddSpGround final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RichmanLoveSaveComponent_DynamicAddSpGround;

// Function RichmanLove.RichmanLoveSaveComponent.GetAbilityValue
// 0x0008 (0x0008 - 0x0000)
struct RichmanLoveSaveComponent_GetAbilityValue final
{
public:
	ERichmanLovePlayerAbility                     InAbility;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Rei-SdkDumper ])
	float                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RichmanLoveSaveComponent_GetAbilityValue;

// Function RichmanLove.RichmanLoveSaveComponent.GetBornGround
// 0x0008 (0x0008 - 0x0000)
struct RichmanLoveSaveComponent_GetBornGround final
{
public:
	class AChessGround*                           ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RichmanLoveSaveComponent_GetBornGround;

// Function RichmanLove.RichmanLoveSaveComponent.GetCurGround
// 0x0008 (0x0008 - 0x0000)
struct RichmanLoveSaveComponent_GetCurGround final
{
public:
	class ARichmanLove_ChessGround*               ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RichmanLoveSaveComponent_GetCurGround;

// Function RichmanLove.RichmanLoveSaveComponent.GetDay
// 0x0004 (0x0004 - 0x0000)
struct RichmanLoveSaveComponent_GetDay final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RichmanLoveSaveComponent_GetDay;

// Function RichmanLove.RichmanLoveSaveComponent.GetGirlEndId
// 0x0004 (0x0004 - 0x0000)
struct RichmanLoveSaveComponent_GetGirlEndId final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RichmanLoveSaveComponent_GetGirlEndId;

// Function RichmanLove.RichmanLoveSaveComponent.GetGirlIdByGround
// 0x0010 (0x0010 - 0x0000)
struct RichmanLoveSaveComponent_GetGirlIdByGround final
{
public:
	class AChessGround*                           InGround;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_RichmanLoveSaveComponent_GetGirlIdByGround;

// Function RichmanLove.RichmanLoveSaveComponent.GetGirlLevelById
// 0x0008 (0x0008 - 0x0000)
struct RichmanLoveSaveComponent_GetGirlLevelById final
{
public:
	int32                                         InId;                                              // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RichmanLoveSaveComponent_GetGirlLevelById;

// Function RichmanLove.RichmanLoveSaveComponent.GetItemCount
// 0x0004 (0x0004 - 0x0000)
struct RichmanLoveSaveComponent_GetItemCount final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RichmanLoveSaveComponent_GetItemCount;

// Function RichmanLove.RichmanLoveSaveComponent.GetItemTplIdByIndex
// 0x0008 (0x0008 - 0x0000)
struct RichmanLoveSaveComponent_GetItemTplIdByIndex final
{
public:
	int32                                         InIndex;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RichmanLoveSaveComponent_GetItemTplIdByIndex;

// Function RichmanLove.RichmanLoveSaveComponent.GetItemUIdByIndex
// 0x0008 (0x0008 - 0x0000)
struct RichmanLoveSaveComponent_GetItemUIdByIndex final
{
public:
	int32                                         InIndex;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RichmanLoveSaveComponent_GetItemUIdByIndex;

// Function RichmanLove.RichmanLoveSaveComponent.GetMaxStep
// 0x0004 (0x0004 - 0x0000)
struct RichmanLoveSaveComponent_GetMaxStep final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RichmanLoveSaveComponent_GetMaxStep;

// Function RichmanLove.RichmanLoveSaveComponent.GetPlayerForwardVector
// 0x000C (0x000C - 0x0000)
struct RichmanLoveSaveComponent_GetPlayerForwardVector final
{
public:
	struct FVector                                ReturnValue;                                       // 0x0000(0x000C)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RichmanLoveSaveComponent_GetPlayerForwardVector;

// Function RichmanLove.RichmanLoveSaveComponent.GetPlayerScaleDir
// 0x0004 (0x0004 - 0x0000)
struct RichmanLoveSaveComponent_GetPlayerScaleDir final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RichmanLoveSaveComponent_GetPlayerScaleDir;

// Function RichmanLove.RichmanLoveSaveComponent.GetSpecificCardUID
// 0x0008 (0x0008 - 0x0000)
struct RichmanLoveSaveComponent_GetSpecificCardUID final
{
public:
	int32                                         InTplId;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RichmanLoveSaveComponent_GetSpecificCardUID;

// Function RichmanLove.RichmanLoveSaveComponent.GetSpecifiedCardType
// 0x0004 (0x0004 - 0x0000)
struct RichmanLoveSaveComponent_GetSpecifiedCardType final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RichmanLoveSaveComponent_GetSpecifiedCardType;

// Function RichmanLove.RichmanLoveSaveComponent.GetSpWeek
// 0x0004 (0x0004 - 0x0000)
struct RichmanLoveSaveComponent_GetSpWeek final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RichmanLoveSaveComponent_GetSpWeek;

// Function RichmanLove.RichmanLoveSaveComponent.GetSpWeekType
// 0x0004 (0x0004 - 0x0000)
struct RichmanLoveSaveComponent_GetSpWeekType final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RichmanLoveSaveComponent_GetSpWeekType;

// Function RichmanLove.RichmanLoveSaveComponent.GetStateLastDay
// 0x0008 (0x0008 - 0x0000)
struct RichmanLoveSaveComponent_GetStateLastDay final
{
public:
	ERichmanLovePlayerState                       InState;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Rei-SdkDumper ])
	int32                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RichmanLoveSaveComponent_GetStateLastDay;

// Function RichmanLove.RichmanLoveSaveComponent.LoadSaved
// 0x0018 (0x0018 - 0x0000)
struct RichmanLoveSaveComponent_LoadSaved final
{
public:
	class FString                                 InContent;                                         // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_RichmanLoveSaveComponent_LoadSaved;

// Function RichmanLove.RichmanLoveSaveComponent.PlayerHasState
// 0x0002 (0x0002 - 0x0000)
struct RichmanLoveSaveComponent_PlayerHasState final
{
public:
	ERichmanLovePlayerState                       InState;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RichmanLoveSaveComponent_PlayerHasState;

// Function RichmanLove.RichmanLoveSaveComponent.Save
// 0x0010 (0x0010 - 0x0000)
struct RichmanLoveSaveComponent_Save final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RichmanLoveSaveComponent_Save;

// Function RichmanLove.RichmanLoveSaveComponent.SetCurGround
// 0x0008 (0x0008 - 0x0000)
struct RichmanLoveSaveComponent_SetCurGround final
{
public:
	class ARichmanLove_ChessGround*               InGround;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RichmanLoveSaveComponent_SetCurGround;

// Function RichmanLove.RichmanLoveSaveComponent.SetDuringSpWeek
// 0x0001 (0x0001 - 0x0000)
struct RichmanLoveSaveComponent_SetDuringSpWeek final
{
public:
	bool                                          InValue;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RichmanLoveSaveComponent_SetDuringSpWeek;

// Function RichmanLove.RichmanLoveSaveComponent.SetGirlEndId
// 0x0004 (0x0004 - 0x0000)
struct RichmanLoveSaveComponent_SetGirlEndId final
{
public:
	int32                                         InId;                                              // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RichmanLoveSaveComponent_SetGirlEndId;

// Function RichmanLove.RichmanLoveSaveComponent.SetMaxStep
// 0x0004 (0x0004 - 0x0000)
struct RichmanLoveSaveComponent_SetMaxStep final
{
public:
	int32                                         InStep;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RichmanLoveSaveComponent_SetMaxStep;

// Function RichmanLove.RichmanLoveSaveComponent.SetPlayerForwardVector
// 0x000C (0x000C - 0x0000)
struct RichmanLoveSaveComponent_SetPlayerForwardVector final
{
public:
	struct FVector                                InVector;                                          // 0x0000(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RichmanLoveSaveComponent_SetPlayerForwardVector;

// Function RichmanLove.RichmanLoveSaveComponent.SetSpecifiedCardType
// 0x0004 (0x0004 - 0x0000)
struct RichmanLoveSaveComponent_SetSpecifiedCardType final
{
public:
	int32                                         InType;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RichmanLoveSaveComponent_SetSpecifiedCardType;

// Function RichmanLove.RichmanLoveSaveComponent.SetSpGroundTplId
// 0x0004 (0x0004 - 0x0000)
struct RichmanLoveSaveComponent_SetSpGroundTplId final
{
public:
	int32                                         InTplId;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RichmanLoveSaveComponent_SetSpGroundTplId;

// Function RichmanLove.RichmanLoveSaveComponent.SetSpWeek
// 0x0004 (0x0004 - 0x0000)
struct RichmanLoveSaveComponent_SetSpWeek final
{
public:
	int32                                         InValue;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RichmanLoveSaveComponent_SetSpWeek;

// Function RichmanLove.RichmanLoveSaveComponent.SetSpWeekType
// 0x0004 (0x0004 - 0x0000)
struct RichmanLoveSaveComponent_SetSpWeekType final
{
public:
	int32                                         InType;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RichmanLoveSaveComponent_SetSpWeekType;

}

