#pragma once

/*
* SDK generated by Rei-SdkDumper
* Based on Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RichmanLove

#include "Basic.hpp"

#include "ChessMap_classes.hpp"
#include "RichmanLove_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class RichmanLove.RichmanLove_ChessGround
// 0x0010 (0x0288 - 0x0278)
class ARichmanLove_ChessGround final : public AChessGround
{
public:
	TArray<class AChessObject*>                   BesideObjects;                                     // 0x0278(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)

public:
	bool CheckHasObject();
	bool CheckObjectHasTag(const class FString& InTagName);
	TArray<class AChessObject*> GetObjectsByTag(const class FString& InTagName);
	bool HasProp();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("RichmanLove_ChessGround")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"RichmanLove_ChessGround")
	}
	static class ARichmanLove_ChessGround* GetDefaultObj()
	{
		return GetDefaultObjImpl<ARichmanLove_ChessGround>();
	}
};
DUMPER7_ASSERTS_ARichmanLove_ChessGround;

// Class RichmanLove.RichmanLove_ChessObject
// 0x0030 (0x0288 - 0x0258)
class ARichmanLove_ChessObject final : public AChessObject
{
public:
	class UStaticMeshComponent*                   MeshComponent;                                     // 0x0258(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UMaterialInterface*>             NormalMaterials;                                   // 0x0260(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPublic)
	TArray<class UMaterialInterface*>             SpMaterials;                                       // 0x0270(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPublic)
	uint8                                         Pad_280[0x8];                                      // 0x0280(0x0008)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])

public:
	class FString GetTagParam();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("RichmanLove_ChessObject")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"RichmanLove_ChessObject")
	}
	static class ARichmanLove_ChessObject* GetDefaultObj()
	{
		return GetDefaultObjImpl<ARichmanLove_ChessObject>();
	}
};
DUMPER7_ASSERTS_ARichmanLove_ChessObject;

// Class RichmanLove.RichmanLoveCameraFollow
// 0x0070 (0x0298 - 0x0228)
class ARichmanLoveCameraFollow final : public AActor
{
public:
	class AActor*                                 Target;                                            // 0x0228(0x0008)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ACameraActor*                           TemplateCameraActor;                               // 0x0230(0x0008)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 FollowActor;                                       // 0x0238(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class APlayerController*                      PlayerController;                                  // 0x0240(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ERichmanLoveCameraFollowType                  FollowType;                                        // 0x0248(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_249[0x3];                                      // 0x0249(0x0003)(Fixing Size After Last Property [ Rei-SdkDumper ])
	float                                         MaxViewSize;                                       // 0x024C(0x0004)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MinViewSize;                                       // 0x0250(0x0004)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LightShowDistance;                                 // 0x0254(0x0004)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PerformSpeed;                                      // 0x0258(0x0004)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_25C[0x3C];                                     // 0x025C(0x003C)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])

public:
	bool CheckAutoFollowComplete();
	bool GetLockControl();
	bool IsSlidingView();
	void OnMouseMove(const struct FVector2D& DeltaPos);
	void OnZoomChange(float InZoom);
	void RefreshCameraRange(class AChessRegion* Region);
	void ResetCamera();
	void SetFollowTarget(class AActor* InCharacter, bool Immediately);
	void SetLockControl(bool InLockControl);
	void SetSlidingView(bool bSlid);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("RichmanLoveCameraFollow")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"RichmanLoveCameraFollow")
	}
	static class ARichmanLoveCameraFollow* GetDefaultObj()
	{
		return GetDefaultObjImpl<ARichmanLoveCameraFollow>();
	}
};
DUMPER7_ASSERTS_ARichmanLoveCameraFollow;

// Class RichmanLove.RichmanLoveGroundSelector
// 0x0068 (0x0290 - 0x0228)
class ARichmanLoveGroundSelector final : public AActor
{
public:
	TDelegate<void(int32 InStep)>                 OnSelected;                                        // 0x0228(0x0010)(ZeroConstructor, Transient, InstancedReference, NoDestructor, NativeAccessSpecifierPublic)
	class AActor*                                 Character;                                         // 0x0238(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 BlinkCharacter;                                    // 0x0240(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ARichmanLoveMgr*                        Mgr;                                               // 0x0248(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class AChessGround*>                   Grounds;                                           // 0x0250(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPublic)
	TArray<class AChessGround*>                   GroundCustomDiceArray;                             // 0x0260(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPublic)
	uint8                                         Pad_270[0x20];                                     // 0x0270(0x0020)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])

public:
	void Cleanup();
	void GetAllCanReachGridsByCard(class AActor* InCharacter, int32 InStep, const class FString& FindType);
	void OnClick();
	void OnDirGroundSelected(int32 Index_0);
	void Reset();
	void Reset_CustomDice();
	void SetCharacter(class AActor* InCharacter, int32 InStep);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("RichmanLoveGroundSelector")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"RichmanLoveGroundSelector")
	}
	static class ARichmanLoveGroundSelector* GetDefaultObj()
	{
		return GetDefaultObjImpl<ARichmanLoveGroundSelector>();
	}
};
DUMPER7_ASSERTS_ARichmanLoveGroundSelector;

// Class RichmanLove.RichmanLoveLibrary
// 0x0000 (0x0028 - 0x0028)
class URichmanLoveLibrary final : public UBlueprintFunctionLibrary
{
public:
	static int32 GetAllMoveDirs(class AActor* InCharacter, class ARichmanLove_ChessGround* InGround, class ARichmanLoveMgr* InMgr, TArray<int32>* AllCanReachGirds, int32* BackDir);
	static class FString GetBuildingDescKey(class ARichmanLoveMgr* InMgr, int32 InTplId);
	static class FString GetBuildingNameKey(class ARichmanLoveMgr* InMgr, int32 InTplId);
	static int32 GetDiceThrow(int32 Max, int32 Min);
	static bool SetSelectWalkDirection(class ARichmanLoveMgr* InMgr, class AActor* InCharacter);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("RichmanLoveLibrary")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"RichmanLoveLibrary")
	}
	static class URichmanLoveLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<URichmanLoveLibrary>();
	}
};
DUMPER7_ASSERTS_URichmanLoveLibrary;

// Class RichmanLove.RichmanLoveMgr
// 0x0468 (0x0690 - 0x0228)
class ARichmanLoveMgr final : public AActor
{
public:
	TMulticastInlineDelegate<void(class AActor* InCharacter, int32 Num)> EventOnCharacterSelectDirection; // 0x0228(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              EventOnCharacterAbilityChanged;                    // 0x0238(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              EventOnEntrySpWeek;                                // 0x0248(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              EventOnExitSpWeek;                                 // 0x0258(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class AChessMapActor*                         ChessMapActor;                                     // 0x0268(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class AActor*>                         AllGrounds;                                        // 0x0270(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPublic)
	class ARichmanLoveCameraFollow*               CameraFollow;                                      // 0x0280(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ARichmanLoveGroundSelector*             GroundSelector;                                    // 0x0288(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 PlayerActor;                                       // 0x0290(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AChessGround*                           LastShowDirGround;                                 // 0x0298(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class AChessGround*>                   PathActors;                                        // 0x02A0(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPublic)
	int32                                         MoveGridIndex;                                     // 0x02B0(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          EnableTick;                                        // 0x02B4(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2B5[0x3];                                      // 0x02B5(0x0003)(Fixing Size After Last Property [ Rei-SdkDumper ])
	class URichmanLoveSaveComponent*              SaveComponent;                                     // 0x02B8(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C0[0x350];                                    // 0x02C0(0x0350)(Fixing Size After Last Property [ Rei-SdkDumper ])
	TMap<int32, class UFXSystemComponent*>        AllEffects;                                        // 0x0610(0x0050)(ExportObject, Transient, ContainsInstancedReference, NativeAccessSpecifierPublic)
	uint8                                         Pad_660[0x30];                                     // 0x0660(0x0030)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])

public:
	void ActiveNiagara(bool Inactive);
	bool CheckHaveGirl();
	bool CheckIsGameOver();
	void DestroyEffect(int32 InEffectId);
	class AActor* GetClickActor(bool IgnoreGround);
	class AChessGround* GetGroundByObject(class AActor* InActor);
	struct FTransform InitGirlNpcTrans(int32 InId, const struct FVector& InRotation, const struct FVector& InScale);
	struct FTransform InitPlayerTrans(bool InIsFirst, const struct FVector& InRotation, const struct FVector& InScale);
	void LuaBeginPlay();
	void MoveGirlToOtherGround(class AActor* InGirl);
	void NotifyLuaTick(float InDeltaTime);
	void OnReachGrid(class ARichmanLove_ChessGround* InGround);
	int32 PlayEffectById(int32 ID, const struct FVector& InLocation, const struct FRotator& InRotate, bool IsPersistent);
	void RemoveMoveGroundTip();
	void ResetMap();
	int32 ShowDirEffect(bool InIsFirst, bool InIsShowEffect);
	void SpineCommunicateFinish();
	void StartGame(const class FString& InDlcId, int32 InMapId, int32 InRegionId, const class FString& InSaved, const class FString& InDataPath);
	void StartMoving(int32 Steps, bool InForce, bool IsCustom);
	void UpdateSpineCommunication(class AActor* InGirl);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("RichmanLoveMgr")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"RichmanLoveMgr")
	}
	static class ARichmanLoveMgr* GetDefaultObj()
	{
		return GetDefaultObjImpl<ARichmanLoveMgr>();
	}
};
DUMPER7_ASSERTS_ARichmanLoveMgr;

// Class RichmanLove.RichmanLoveSaveComponent
// 0x01C0 (0x0270 - 0x00B0)
class URichmanLoveSaveComponent final : public UActorComponent
{
public:
	class ARichmanLoveMgr*                        Mgr;                                               // 0x00B0(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MaxDay;                                            // 0x00B8(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         DayForSettlement;                                  // 0x00BC(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C0[0x10C];                                     // 0x00C0(0x010C)(Fixing Size After Last Property [ Rei-SdkDumper ])
	int32                                         CurStep;                                           // 0x01CC(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1D0[0xA0];                                     // 0x01D0(0x00A0)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])

public:
	void AddAbility(ERichmanLovePlayerAbility InAbility, float InValue);
	int32 AddItem(int32 InTplId);
	bool AddPlotRead(int32 InId, int32 InGirlId);
	int32 AddState(ERichmanLovePlayerState InState, int32 InDay);
	bool ApplyUseItem(int32 InUId);
	bool CheckDuringSpWeek();
	bool CheckHasItem(int32 InTplId);
	bool CheckIsLastWeek();
	bool CheckPlotIsRead(int32 InId);
	void DiscardPopOut(int32 InUId);
	bool DynamicAddSpGround();
	void EntryNewRound();
	void ExitRound();
	float GetAbilityValue(ERichmanLovePlayerAbility InAbility);
	class AChessGround* GetBornGround();
	class ARichmanLove_ChessGround* GetCurGround();
	int32 GetDay();
	int32 GetGirlEndId();
	int32 GetGirlIdByGround(class AChessGround* InGround);
	int32 GetGirlLevelById(int32 InId);
	int32 GetItemCount();
	int32 GetItemTplIdByIndex(int32 InIndex);
	int32 GetItemUIdByIndex(int32 InIndex);
	int32 GetMaxStep();
	struct FVector GetPlayerForwardVector();
	int32 GetPlayerScaleDir();
	int32 GetSpecificCardUID(int32 InTplId);
	int32 GetSpecifiedCardType();
	int32 GetSpWeek();
	int32 GetSpWeekType();
	int32 GetStateLastDay(ERichmanLovePlayerState InState);
	bool LoadSaved(const class FString& InContent);
	bool PlayerHasState(ERichmanLovePlayerState InState);
	class FString Save();
	void SetCurGround(class ARichmanLove_ChessGround* InGround);
	void SetDuringSpWeek(bool InValue);
	void SetGirlEndId(int32 InId);
	void SetMaxStep(int32 InStep);
	void SetPlayerForwardVector(const struct FVector& InVector);
	void SetSpecifiedCardType(int32 InType);
	void SetSpGroundTplId(int32 InTplId);
	void SetSpWeek(int32 InValue);
	void SetSpWeekType(int32 InType);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("RichmanLoveSaveComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"RichmanLoveSaveComponent")
	}
	static class URichmanLoveSaveComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<URichmanLoveSaveComponent>();
	}
};
DUMPER7_ASSERTS_URichmanLoveSaveComponent;

}

