#pragma once

/*
* SDK generated by Rei-SdkDumper
* Based on Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RoadRunnerRuntime

#include "Basic.hpp"

#include "RoadRunnerRuntime_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class RoadRunnerRuntime.RoadRunnerTrafficJunction
// 0x0020 (0x00D0 - 0x00B0)
class URoadRunnerTrafficJunction final : public UActorComponent
{
public:
	TArray<struct FSignalPhase>                   Phases;                                            // 0x00B0(0x0010)(Edit, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	float                                         Timer;                                             // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         CurrentPhase;                                      // 0x00C4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         CurrentInterval;                                   // 0x00C8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_CC[0x4];                                       // 0x00CC(0x0004)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("RoadRunnerTrafficJunction")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"RoadRunnerTrafficJunction")
	}
	static class URoadRunnerTrafficJunction* GetDefaultObj()
	{
		return GetDefaultObjImpl<URoadRunnerTrafficJunction>();
	}
};
DUMPER7_ASSERTS_URoadRunnerTrafficJunction;

}

