#pragma once

/*
* SDK generated by Rei-SdkDumper
* Based on Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SeasunAsset

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "SeasunAsset_structs.hpp"
#include "CoreUObject_classes.hpp"


namespace SDK
{

// Class SeasunAsset.SeasunAssetLib
// 0x0000 (0x0028 - 0x0028)
class USeasunAssetLib final : public UBlueprintFunctionLibrary
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SeasunAssetLib")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SeasunAssetLib")
	}
	static class USeasunAssetLib* GetDefaultObj()
	{
		return GetDefaultObjImpl<USeasunAssetLib>();
	}
};
DUMPER7_ASSERTS_USeasunAssetLib;

// Class SeasunAsset.SeasunAssetManager
// 0x0000 (0x0458 - 0x0458)
class USeasunAssetManager : public UAssetManager
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SeasunAssetManager")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SeasunAssetManager")
	}
	static class USeasunAssetManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<USeasunAssetManager>();
	}
};
DUMPER7_ASSERTS_USeasunAssetManager;

// Class SeasunAsset.SeasunAssetSetting
// 0x00F0 (0x0118 - 0x0028)
class USeasunAssetSetting final : public UObject
{
public:
	bool                                          bCookOnlyAppData;                                  // 0x0028(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCustomCookSplit;                                  // 0x0029(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Size After Last Property [ Rei-SdkDumper ])
	TArray<struct FFilePath>                      FilesInApp;                                        // 0x0030(0x0010)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPublic)
	TArray<struct FDirectoryPath>                 DirectoryInApp;                                    // 0x0040(0x0010)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPublic)
	TArray<struct FFilePath>                      FilesInPaks;                                       // 0x0050(0x0010)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPublic)
	TArray<struct FDirectoryPath>                 DirectoryInPaks;                                   // 0x0060(0x0010)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPublic)
	TArray<struct FFilePath>                      IgnoreFiles;                                       // 0x0070(0x0010)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPublic)
	TArray<struct FDirectoryPath>                 IgnoreDirectories;                                 // 0x0080(0x0010)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPublic)
	struct FDirectorySplitDesc                    DefaultSplitMethod;                                // 0x0090(0x0018)(Edit, Config, NativeAccessSpecifierPublic)
	TArray<struct FDirectorySplitDesc>            SpliteMethods;                                     // 0x00A8(0x0010)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPublic)
	TArray<struct FDirectorySplitDesc>            NonAssetSpliteMethos_APP;                          // 0x00B8(0x0010)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPublic)
	TArray<struct FDirectorySplitDesc>            NonAssetSpliteMethos_OutAPP;                       // 0x00C8(0x0010)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPublic)
	bool                                          bSaveCookFile;                                     // 0x00D8(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCalCRC;                                           // 0x00D9(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bGenerateFileOpenOrder;                            // 0x00DA(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCookSingleFile;                                   // 0x00DB(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_DC[0x4];                                       // 0x00DC(0x0004)(Fixing Size After Last Property [ Rei-SdkDumper ])
	struct FFilePath                              SingleFilePath;                                    // 0x00E0(0x0010)(Edit, Config, NativeAccessSpecifierPublic)
	TArray<class UClass*>                         CookIgnoreClasses;                                 // 0x00F0(0x0010)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPublic)
	uint8                                         Pad_100[0x18];                                     // 0x0100(0x0018)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SeasunAssetSetting")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SeasunAssetSetting")
	}
	static class USeasunAssetSetting* GetDefaultObj()
	{
		return GetDefaultObjImpl<USeasunAssetSetting>();
	}
};
DUMPER7_ASSERTS_USeasunAssetSetting;

// Class SeasunAsset.ResourceCollector
// 0x0030 (0x0058 - 0x0028)
class UResourceCollector final : public UObject
{
public:
	TArray<struct FFilePath>                      Files;                                             // 0x0028(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FDirectoryPath>                 Dirs;                                              // 0x0038(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	class FString                                 CollectorName;                                     // 0x0048(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ResourceCollector")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ResourceCollector")
	}
	static class UResourceCollector* GetDefaultObj()
	{
		return GetDefaultObjImpl<UResourceCollector>();
	}
};
DUMPER7_ASSERTS_UResourceCollector;

// Class SeasunAsset.ResourceSplitter
// 0x0020 (0x0048 - 0x0028)
class UResourceSplitter final : public UObject
{
public:
	TArray<class UResourceCollector*>             Collectors;                                        // 0x0028(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	struct FDirectoryPath                         CollectorPath;                                     // 0x0038(0x0010)(Edit, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ResourceSplitter")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ResourceSplitter")
	}
	static class UResourceSplitter* GetDefaultObj()
	{
		return GetDefaultObjImpl<UResourceSplitter>();
	}
};
DUMPER7_ASSERTS_UResourceSplitter;

}

