#pragma once

/*
* SDK generated by Rei-SdkDumper
* Based on Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SeasunAsset

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK
{

// Enum SeasunAsset.EPakSplitType
// NumValues: 0x0004
enum class EPakSplitType : uint8
{
	Pak                                      = 0,
	FolderPak                                = 1,
	FilePak                                  = 2,
	EPakSplitType_MAX                        = 3,
};

// Enum SeasunAsset.EResSplitStage
// NumValues: 0x0004
enum class EResSplitStage : uint8
{
	RESAPP                                   = 0,
	RESFIRSTCHAPTER                          = 1,
	RESAFTERFIRSTCHAPTER                     = 2,
	EResSplitStage_MAX                       = 3,
};

// ScriptStruct SeasunAsset.HotPatchCookBackupPak
// 0x0020 (0x0020 - 0x0000)
struct FHotPatchCookBackupPak final
{
public:
	class FString                                 Filename;                                          // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FString>                         Assets;                                            // 0x0010(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FHotPatchCookBackupPak;

// ScriptStruct SeasunAsset.HotPatchCookBackupSplit
// 0x0018 (0x0018 - 0x0000)
struct FHotPatchCookBackupSplit final
{
public:
	class FString                                 Filename;                                          // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MaxIndex;                                          // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_FHotPatchCookBackupSplit;

// ScriptStruct SeasunAsset.HotPatchCookBackupHash
// 0x0020 (0x0020 - 0x0000)
struct FHotPatchCookBackupHash final
{
public:
	class FString                                 Filename;                                          // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Hash;                                              // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FHotPatchCookBackupHash;

// ScriptStruct SeasunAsset.HotPatchCookBackup
// 0x0030 (0x0030 - 0x0000)
struct FHotPatchCookBackup final
{
public:
	TArray<struct FHotPatchCookBackupPak>         Paks;                                              // 0x0000(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FHotPatchCookBackupSplit>       PakSplits;                                         // 0x0010(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FHotPatchCookBackupHash>        Hashes;                                            // 0x0020(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FHotPatchCookBackup;

// ScriptStruct SeasunAsset.AssetInfo
// 0x0038 (0x0038 - 0x0000)
struct FAssetInfo final
{
public:
	class FString                                 AssetPath;                                         // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 AssetType;                                         // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         AssetNumber;                                       // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Rei-SdkDumper ])
	TArray<class FString>                         DependecyList;                                     // 0x0028(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FAssetInfo;

// ScriptStruct SeasunAsset.AssetInfoList
// 0x0010 (0x0010 - 0x0000)
struct FAssetInfoList final
{
public:
	TArray<struct FAssetInfo>                     AssetList;                                         // 0x0000(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FAssetInfoList;

// ScriptStruct SeasunAsset.CookedAssetInfo
// 0x0018 (0x0018 - 0x0000)
struct FCookedAssetInfo final
{
public:
	class FString                                 AssetPath;                                         // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint32                                        CrcCode;                                           // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_FCookedAssetInfo;

// ScriptStruct SeasunAsset.CookedAssetInfoFile
// 0x0020 (0x0020 - 0x0000)
struct FCookedAssetInfoFile final
{
public:
	class FString                                 CookedTime;                                        // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FCookedAssetInfo>               AssetsInfos;                                       // 0x0010(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FCookedAssetInfoFile;

// ScriptStruct SeasunAsset.SeasunPakInfo
// 0x0050 (0x0050 - 0x0000)
struct FSeasunPakInfo final
{
public:
	TArray<class FString>                         Files;                                             // 0x0000(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	struct FDirectoryPath                         Dir;                                               // 0x0010(0x0010)(NativeAccessSpecifierPublic)
	class FString                                 RealPath;                                          // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 PakName;                                           // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                         Size;                                              // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bFixedPackage;                                     // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPakSplitType                                 SpliteType;                                        // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bNonAsset;                                         // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4B[0x5];                                       // 0x004B(0x0005)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_FSeasunPakInfo;

// ScriptStruct SeasunAsset.PakManifest
// 0x0050 (0x0050 - 0x0000)
struct FPakManifest
{
public:
	struct FSeasunPakInfo                         PakInfo;                                           // 0x0000(0x0050)(NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FPakManifest;

// ScriptStruct SeasunAsset.IncPakManifest
// 0x0010 (0x0060 - 0x0050)
struct FIncPakManifest final : public FPakManifest
{
public:
	TArray<class FString>                         HistoryLongPackageName;                            // 0x0050(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FIncPakManifest;

// ScriptStruct SeasunAsset.ProjectCookManifest
// 0x0040 (0x0040 - 0x0000)
struct FProjectCookManifest final
{
public:
	class FString                                 DistribVersion;                                    // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FPakManifest>                   InAppManifest;                                     // 0x0010(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FPakManifest>                   OutAppManifest;                                    // 0x0020(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FIncPakManifest>                IncrementalManifest;                               // 0x0030(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FProjectCookManifest;

// ScriptStruct SeasunAsset.DirectorySplitDesc
// 0x0018 (0x0018 - 0x0000)
struct FDirectorySplitDesc final
{
public:
	struct FDirectoryPath                         Directory;                                         // 0x0000(0x0010)(Edit, NativeAccessSpecifierPublic)
	EPakSplitType                                 SplitType;                                         // 0x0010(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Rei-SdkDumper ])
	float                                         SizeMB;                                            // 0x0014(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FDirectorySplitDesc;

// ScriptStruct SeasunAsset.DirCookAssets
// 0x0038 (0x0038 - 0x0000)
struct FDirCookAssets final
{
public:
	struct FDirectorySplitDesc                    Desc;                                              // 0x0000(0x0018)(NativeAccessSpecifierPublic)
	class FString                                 RealPath;                                          // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FString>                         AssetsList;                                        // 0x0028(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FDirCookAssets;

// ScriptStruct SeasunAsset.SeasunPakInfos
// 0x0030 (0x0030 - 0x0000)
struct FSeasunPakInfos final
{
public:
	TArray<struct FSeasunPakInfo>                 InAppPaks;                                         // 0x0000(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FSeasunPakInfo>                 OutAppPaks;                                        // 0x0010(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FSeasunPakInfo>                 PatchPaks;                                         // 0x0020(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FSeasunPakInfos;

// ScriptStruct SeasunAsset.DownloadPakDesc
// 0x0020 (0x0020 - 0x0000)
struct FDownloadPakDesc final
{
public:
	class FString                                 Pak;                                               // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint32                                        CRC;                                               // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Type;                                              // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDownloaded;                                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Rei-SdkDumper ])
	int32                                         Size;                                              // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FDownloadPakDesc;

// ScriptStruct SeasunAsset.SeasunPatchInfo
// 0x0030 (0x0030 - 0x0000)
struct FSeasunPatchInfo final
{
public:
	class FString                                 Version;                                           // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ProjectVersion;                                    // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FDownloadPakDesc>               Paks;                                              // 0x0020(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FSeasunPatchInfo;

}

