#pragma once

/*
* SDK generated by Rei-SdkDumper
* Based on Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SeasunAnimGraph

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "SeasunAnimGraph_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"


namespace SDK
{

// Class SeasunAnimGraph.CurveSequenceAssetBase
// 0x0010 (0x0040 - 0x0030)
class UCurveSequenceAssetBase : public UDataAsset
{
public:
	uint8                                         Pad_30[0x8];                                       // 0x0030(0x0008)(Fixing Size After Last Property [ Rei-SdkDumper ])
	bool                                          bIsLooping;                                        // 0x0038(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CurveSequenceAssetBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CurveSequenceAssetBase")
	}
	static class UCurveSequenceAssetBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCurveSequenceAssetBase>();
	}
};
DUMPER7_ASSERTS_UCurveSequenceAssetBase;

// Class SeasunAnimGraph.CurveSequenceAsset
// 0x00A8 (0x00E8 - 0x0040)
class UCurveSequenceAsset final : public UCurveSequenceAssetBase
{
public:
	uint8                                         Pad_40[0x8];                                       // 0x0040(0x0008)(Fixing Size After Last Property [ Rei-SdkDumper ])
	struct FAlphaBlend                            BlendIn;                                           // 0x0048(0x0030)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FAlphaBlend                            BlendOut;                                          // 0x0078(0x0030)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	float                                         CoolDownTime;                                      // 0x00A8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ECurveSequenceSlot                            SlotType;                                          // 0x00AC(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_AD[0x3];                                       // 0x00AD(0x0003)(Fixing Size After Last Property [ Rei-SdkDumper ])
	float                                         MaxTranslation_X;                                  // 0x00B0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxTranslation_Y;                                  // 0x00B4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxTranslation_Z;                                  // 0x00B8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxAngle_Pitch;                                    // 0x00BC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxAngle_Yaw;                                      // 0x00C0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxAngle_Roll;                                     // 0x00C4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                RandomRotationOffsetMultiplier;                    // 0x00C8(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D4[0x4];                                       // 0x00D4(0x0004)(Fixing Size After Last Property [ Rei-SdkDumper ])
	TArray<struct FCurveSequenceEffectorSetup>    EffectorSetups;                                    // 0x00D8(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CurveSequenceAsset")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CurveSequenceAsset")
	}
	static class UCurveSequenceAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCurveSequenceAsset>();
	}
};
DUMPER7_ASSERTS_UCurveSequenceAsset;

// Class SeasunAnimGraph.CurveSequence_RecoilAnimation
// 0x05C0 (0x0600 - 0x0040)
class UCurveSequence_RecoilAnimation final : public UCurveSequenceAssetBase
{
public:
	struct FRuntimeFloatCurve                     GunPitch;                                          // 0x0040(0x0088)(Edit, NativeAccessSpecifierPublic)
	struct FRuntimeFloatCurve                     GunTranslation;                                    // 0x00C8(0x0088)(Edit, NativeAccessSpecifierPublic)
	struct FRuntimeFloatCurve                     BodyPitch;                                         // 0x0150(0x0088)(Edit, NativeAccessSpecifierPublic)
	struct FRuntimeFloatCurve                     BodyTranslation;                                   // 0x01D8(0x0088)(Edit, NativeAccessSpecifierPublic)
	struct FRuntimeFloatCurve                     RightElbowRoll;                                    // 0x0260(0x0088)(Edit, NativeAccessSpecifierPublic)
	struct FRuntimeFloatCurve                     RightElbowTranslation;                             // 0x02E8(0x0088)(Edit, NativeAccessSpecifierPublic)
	struct FVector                                RandomRotationOffsetMultiplier;                    // 0x0370(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ShoulderAffectedByGun_Rotation;                    // 0x037C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ElbowAffectedByGun_Rotation;                       // 0x0380(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ShoulderAffectedByGun_Translation;                 // 0x0384(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxPitch_Gun;                                      // 0x0388(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxYaw_Gun;                                        // 0x038C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxRoll_Gun;                                       // 0x0390(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxTranslation_Gun;                                // 0x0394(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxPitch_Body;                                     // 0x0398(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxTranslation_Body;                               // 0x039C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxRoll_RightElbow;                                // 0x03A0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxTranslation__RightElbow;                        // 0x03A4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRuntimeFloatCurve                     LeftClavicleAlphaCurve;                            // 0x03A8(0x0088)(Edit, NativeAccessSpecifierPublic)
	struct FRuntimeFloatCurve                     LeftClavicleMaxAlphaCurve;                         // 0x0430(0x0088)(Edit, NativeAccessSpecifierPublic)
	struct FVector                                MaxLeftClavicleRandomRotation;                     // 0x04B8(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                MinLeftClavicleRandomRotation;                     // 0x04C4(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRuntimeFloatCurve                     RightClavicleAlphaCurve;                           // 0x04D0(0x0088)(Edit, NativeAccessSpecifierPublic)
	struct FRuntimeFloatCurve                     RightClavicleMaxAlphaCurve;                        // 0x0558(0x0088)(Edit, NativeAccessSpecifierPublic)
	struct FVector                                MaxRightClavicleRandomRotation;                    // 0x05E0(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                MinRightClavicleRandomRotation;                    // 0x05EC(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DefaultValidTime;                                  // 0x05F8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5FC[0x4];                                      // 0x05FC(0x0004)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CurveSequence_RecoilAnimation")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CurveSequence_RecoilAnimation")
	}
	static class UCurveSequence_RecoilAnimation* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCurveSequence_RecoilAnimation>();
	}
};
DUMPER7_ASSERTS_UCurveSequence_RecoilAnimation;

// Class SeasunAnimGraph.CurveSequence_PhysicalRecoilAnimation
// 0x01A8 (0x01E8 - 0x0040)
class UCurveSequence_PhysicalRecoilAnimation final : public UCurveSequenceAssetBase
{
public:
	struct FRuntimeFloatCurve                     PhysicsAlpha_Hair;                                 // 0x0040(0x0088)(Edit, NativeAccessSpecifierPublic)
	struct FRuntimeFloatCurve                     PhysicsAlpha_Cloth;                                // 0x00C8(0x0088)(Edit, NativeAccessSpecifierPublic)
	struct FRuntimeFloatCurve                     PhysicsAlpha_Hat;                                  // 0x0150(0x0088)(Edit, NativeAccessSpecifierPublic)
	float                                         MaxValue_Hair;                                     // 0x01D8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxValue_Cloth;                                    // 0x01DC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxValue_Hat;                                      // 0x01E0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1E4[0x4];                                      // 0x01E4(0x0004)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CurveSequence_PhysicalRecoilAnimation")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CurveSequence_PhysicalRecoilAnimation")
	}
	static class UCurveSequence_PhysicalRecoilAnimation* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCurveSequence_PhysicalRecoilAnimation>();
	}
};
DUMPER7_ASSERTS_UCurveSequence_PhysicalRecoilAnimation;

// Class SeasunAnimGraph.CurveSequenceControllerAnimInstance
// 0x0160 (0x0420 - 0x02C0)
class UCurveSequenceControllerAnimInstance : public UAnimInstance
{
public:
	uint8                                         Pad_2B8[0x10];                                     // 0x02B8(0x0010)(Fixing Size After Last Property [ Rei-SdkDumper ])
	TMulticastInlineDelegate<void(TScriptInterface<class ICurveSequenceInterface> CurveSequence, bool bInterrupted)> OnCurveSequenceBlendingOut; // 0x02C8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(TScriptInterface<class ICurveSequenceInterface> CurveSequence)> OnCurveSequenceStarted; // 0x02D8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(TScriptInterface<class ICurveSequenceInterface> CurveSequence, bool bInterrupted)> OnCurveSequenceEnded; // 0x02E8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnAllCurveSequenceInstancesEnded;                  // 0x02F8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_308[0x50];                                     // 0x0308(0x0050)(Fixing Size After Last Property [ Rei-SdkDumper ])
	uint8                                         bQueueCurveSequenceEvents : 1;                     // 0x0358(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate))
	ECustomPhysicCalcMode                         CustomPhysicMode;                                  // 0x0359(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	ECustomPhysicState                            CustomPhysicState;                                 // 0x035A(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_35B[0x5];                                      // 0x035B(0x0005)(Fixing Size After Last Property [ Rei-SdkDumper ])
	struct FAnimHitSystem                         AnimHitSystem;                                     // 0x0360(0x00A0)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	struct FBoneReference                         PelvisBone;                                        // 0x0400(0x0010)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic)
	TArray<struct FBoneReference>                 FootBones;                                         // 0x0410(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)

public:
	void ApplyStandardDirectionProcess(class UCurveSequenceAsset* Curve, const struct FHitResult& Hit);
	float CurveSequence_Play(TScriptInterface<class ICurveSequenceInterface> CurveSequenceToPlay, float InPlayRate, float InTimeToStartCurveSequenceAt);
	void CurveSequence_Stop(float InBlendOutTime, const TScriptInterface<class ICurveSequenceInterface> CurveSequence);
	ECustomPhysicCalcMode GetCustomPhysicMode();
	ECustomPhysicState GetCustomPhysicState();
	void SetCustomPhysicMode(ECustomPhysicCalcMode InState);
	void SetCustomPhysicState(ECustomPhysicState InState);

	float CurveSequence_GetPosition(TScriptInterface<class ICurveSequenceInterface> CurveSequence) const;
	bool CurveSequence_IsActive(TScriptInterface<class ICurveSequenceInterface> CurveSequence) const;
	bool CurveSequence_IsPlaying(TScriptInterface<class ICurveSequenceInterface> CurveSequence) const;
	bool HasCurveEffect() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CurveSequenceControllerAnimInstance")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CurveSequenceControllerAnimInstance")
	}
	static class UCurveSequenceControllerAnimInstance* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCurveSequenceControllerAnimInstance>();
	}
};
DUMPER7_ASSERTS_UCurveSequenceControllerAnimInstance;

// Class SeasunAnimGraph.CurveSequenceInterface
// 0x0000 (0x0000 - 0x0000)
class ICurveSequenceInterface final
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CurveSequenceInterface")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CurveSequenceInterface")
	}
	static class ICurveSequenceInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<ICurveSequenceInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_ICurveSequenceInterface;

// Class SeasunAnimGraph.CurveSequenceTestActor
// 0x0010 (0x0238 - 0x0228)
class ACurveSequenceTestActor final : public AActor
{
public:
	class USkeletalMeshComponent*                 Mesh;                                              // 0x0228(0x0008)(Edit, ExportObject, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UHitReactData*                          HitReactData;                                      // 0x0230(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CurveSequenceTestActor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CurveSequenceTestActor")
	}
	static class ACurveSequenceTestActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<ACurveSequenceTestActor>();
	}
};
DUMPER7_ASSERTS_ACurveSequenceTestActor;

// Class SeasunAnimGraph.GrounderInterface
// 0x0000 (0x0000 - 0x0000)
class IGrounderInterface final
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GrounderInterface")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GrounderInterface")
	}
	static class IGrounderInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IGrounderInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IGrounderInterface;

// Class SeasunAnimGraph.HitReactCondition
// 0x0000 (0x0028 - 0x0028)
class UHitReactCondition : public UObject
{
public:
	bool K2_Accepts(const struct FHitResult& Hit) const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("HitReactCondition")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"HitReactCondition")
	}
	static class UHitReactCondition* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHitReactCondition>();
	}
};
DUMPER7_ASSERTS_UHitReactCondition;

// Class SeasunAnimGraph.HitReactCondition_TurnDirection
// 0x0008 (0x0030 - 0x0028)
class UHitReactCondition_TurnDirection final : public UHitReactCondition
{
public:
	bool                                          bShouldTurnRight;                                  // 0x0028(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("HitReactCondition_TurnDirection")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"HitReactCondition_TurnDirection")
	}
	static class UHitReactCondition_TurnDirection* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHitReactCondition_TurnDirection>();
	}
};
DUMPER7_ASSERTS_UHitReactCondition_TurnDirection;

// Class SeasunAnimGraph.HitReactData
// 0x0020 (0x0050 - 0x0030)
class UHitReactData final : public UDataAsset
{
public:
	TArray<struct FHitReactCurveSequenceContainerMap> HitReactSequencesContainer;                    // 0x0030(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FHitReactCurveSequenceContainer> HitReactSequences;                                // 0x0040(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)

public:
	bool GetCaclHitDirectionFromHitResult(const struct FHitResult& Hit, int32 WeaponType) const;
	class UCurveSequenceAsset* GetCurveSequenceFromHitResult(const struct FHitResult& Hit, int32 WeaponType) const;
	TArray<class UCurveSequenceAsset*> GetCurveSequencesFromHitResult(const struct FHitResult& Hit, int32 WeaponType) const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("HitReactData")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"HitReactData")
	}
	static class UHitReactData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHitReactData>();
	}
};
DUMPER7_ASSERTS_UHitReactData;

// Class SeasunAnimGraph.AbnormalReactData
// 0x0050 (0x0080 - 0x0030)
class UAbnormalReactData final : public UDataAsset
{
public:
	TMap<uint8, class UCurveSequenceAsset*>       AbnormalReactContainer;                            // 0x0030(0x0050)(Edit, NativeAccessSpecifierPublic)

public:
	class UCurveSequenceAsset* GetCurveSequenceFromAbnormalState(uint8 InState) const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AbnormalReactData")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AbnormalReactData")
	}
	static class UAbnormalReactData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAbnormalReactData>();
	}
};
DUMPER7_ASSERTS_UAbnormalReactData;

// Class SeasunAnimGraph.AttributeAbnormalReactData
// 0x0050 (0x0080 - 0x0030)
class UAttributeAbnormalReactData final : public UDataAsset
{
public:
	TMap<uint8, class UCurveSequenceAsset*>       AttributeAbnormalReactContainer;                   // 0x0030(0x0050)(Edit, NativeAccessSpecifierPublic)

public:
	class UCurveSequenceAsset* GetCurveSequenceFromAttributeAbnormalState(uint8 InState) const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AttributeAbnormalReactData")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AttributeAbnormalReactData")
	}
	static class UAttributeAbnormalReactData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAttributeAbnormalReactData>();
	}
};
DUMPER7_ASSERTS_UAttributeAbnormalReactData;

// Class SeasunAnimGraph.HitReactPhysicalData
// 0x0158 (0x0188 - 0x0030)
class UHitReactPhysicalData final : public UDataAsset
{
public:
	struct FHitPhyConfig                          DefaultHitReaction;                                // 0x0030(0x00F8)(Edit, NativeAccessSpecifierPublic)
	TMap<class FName, struct FHitPhyConfig>       HitConfigs;                                        // 0x0128(0x0050)(Edit, NativeAccessSpecifierPublic)
	class FName                                   PhyAnimProfile;                                    // 0x0178(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   ConstrainProfile;                                  // 0x0180(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("HitReactPhysicalData")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"HitReactPhysicalData")
	}
	static class UHitReactPhysicalData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHitReactPhysicalData>();
	}
};
DUMPER7_ASSERTS_UHitReactPhysicalData;

// Class SeasunAnimGraph.PhysAnimLibrary
// 0x0000 (0x0028 - 0x0028)
class UPhysAnimLibrary final : public UBlueprintFunctionLibrary
{
public:
	static bool GetBodyNameByIndex(const class USkeletalMeshComponent* Mesh, int32 Index_0, class FName* BodyName);
	static void ResetBoneSimulationInfo(class USkeletalMeshComponent* Mesh);
	static void SetBodySimulateWeightByIndex(class USkeletalMeshComponent* Mesh, int32 BodyIndex, float Weight);
	static void SetBodySimulationWeight(class USkeletalMeshComponent* Mesh, const class FName& BoneName, float Weight);
	static void SetBoneSimulationInfo(class USkeletalMeshComponent* Mesh, const struct FHitBoneSimulationInfo& SimulationInfo, struct FPhysAnimCharState* CharPhysState);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PhysAnimLibrary")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PhysAnimLibrary")
	}
	static class UPhysAnimLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPhysAnimLibrary>();
	}
};
DUMPER7_ASSERTS_UPhysAnimLibrary;

// Class SeasunAnimGraph.CachedBoneTransform
// 0x0050 (0x0078 - 0x0028)
class UCachedBoneTransform final : public UAssetUserData
{
public:
	uint8                                         Pad_28[0x50];                                      // 0x0028(0x0050)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CachedBoneTransform")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CachedBoneTransform")
	}
	static class UCachedBoneTransform* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCachedBoneTransform>();
	}
};
DUMPER7_ASSERTS_UCachedBoneTransform;

// Class SeasunAnimGraph.KawaiiPhysicsLimitsDataAsset
// 0x0030 (0x0060 - 0x0030)
class UKawaiiPhysicsLimitsDataAsset final : public UDataAsset
{
public:
	TArray<struct FSphericalLimit>                SphericalLimits;                                   // 0x0030(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FCapsuleLimit>                  CapsuleLimits;                                     // 0x0040(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FPlanarLimit>                   PlanarLimits;                                      // 0x0050(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("KawaiiPhysicsLimitsDataAsset")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"KawaiiPhysicsLimitsDataAsset")
	}
	static class UKawaiiPhysicsLimitsDataAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKawaiiPhysicsLimitsDataAsset>();
	}
};
DUMPER7_ASSERTS_UKawaiiPhysicsLimitsDataAsset;

// Class SeasunAnimGraph.CachedKawaiiPhysicsSettings
// 0x0018 (0x0048 - 0x0030)
class UCachedKawaiiPhysicsSettings final : public UDataAsset
{
public:
	class USkeleton*                              TargetSkeleton;                                    // 0x0030(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FCachedKawaiiPhysicsSetting>    ExternalKawaiiPhysicSettingContainer;              // 0x0038(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CachedKawaiiPhysicsSettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CachedKawaiiPhysicsSettings")
	}
	static class UCachedKawaiiPhysicsSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCachedKawaiiPhysicsSettings>();
	}
};
DUMPER7_ASSERTS_UCachedKawaiiPhysicsSettings;

// Class SeasunAnimGraph.SeasunAnimFunctionLibrary
// 0x0000 (0x0028 - 0x0028)
class USeasunAnimFunctionLibrary final : public UBlueprintFunctionLibrary
{
public:
	static float AngleBetweenVectors(const struct FVector& v1, const struct FVector& v2);
	static void ApplyRecoilForce(const struct FAnimRecoilSystem& InRecoilSystem, const struct FRecoilStrength& InStrength);
