#pragma once

/*
* SDK generated by Rei-SdkDumper
* Based on Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SeasunVehicle

#include "Basic.hpp"

#include "PhysXVehicles_classes.hpp"
#include "SeasunVehicle_structs.hpp"
#include "Engine_classes.hpp"
#include "PhysicsControl_structs.hpp"


namespace SDK
{

// Class SeasunVehicle.BaseWheeledMovementComponent
// 0x0000 (0x0410 - 0x0410)
class UBaseWheeledMovementComponent : public UWheeledVehicleMovementComponent4W
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BaseWheeledMovementComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BaseWheeledMovementComponent")
	}
	static class UBaseWheeledMovementComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBaseWheeledMovementComponent>();
	}
};
DUMPER7_ASSERTS_UBaseWheeledMovementComponent;

// Class SeasunVehicle.BaseWheeledVehicle
// 0x0000 (0x0298 - 0x0298)
class ABaseWheeledVehicle : public AWheeledVehicle
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BaseWheeledVehicle")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BaseWheeledVehicle")
	}
	static class ABaseWheeledVehicle* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABaseWheeledVehicle>();
	}
};
DUMPER7_ASSERTS_ABaseWheeledVehicle;

// Class SeasunVehicle.VehiclePhysicsControlData
// 0x01A8 (0x01D8 - 0x0030)
class UVehiclePhysicsControlData final : public UDataAsset
{
public:
	class FName                                   ConstraintProfile;                                 // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FPhysicsControlLimbSetupData>   LimbSetupData;                                     // 0x0038(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TMap<class FName, struct FVehicleParamNameToSet> BodyModifiersToSet;                             // 0x0048(0x0050)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	TArray<struct FVehicleMovementTypeInSet>      MovementTypesInSet;                                // 0x0098(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TMap<class FName, struct FVehicleParamNameToSet> ControlToSet;                                   // 0x00A8(0x0050)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	TArray<struct FVehicleControlDataInSet>       InSetControlData;                                  // 0x00F8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TMap<class FName, struct FPhysicsControlMultiplier> ControlMultiplier;                           // 0x0108(0x0050)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FPhysicsControlData                    WorldSpaceControlData;                             // 0x0158(0x0020)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	struct FPhysicsControlSettings                WorldSpaceControlSettings;                         // 0x0178(0x0018)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bEnableWorldSpaceControls;                         // 0x0190(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_191[0x3];                                      // 0x0191(0x0003)(Fixing Size After Last Property [ Rei-SdkDumper ])
	struct FPhysicsControlData                    ParentSpaceControlData;                            // 0x0194(0x0020)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	struct FPhysicsControlSettings                ParentSpaceControlSettings;                        // 0x01B4(0x0018)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bEnableParentSpaceControls;                        // 0x01CC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPhysicsMovementType                          PhysicsMovementType;                               // 0x01CD(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1CE[0x2];                                      // 0x01CE(0x0002)(Fixing Size After Last Property [ Rei-SdkDumper ])
	float                                         GravityMultiplier;                                 // 0x01D0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PhysicsBlendWeight;                                // 0x01D4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("VehiclePhysicsControlData")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"VehiclePhysicsControlData")
	}
	static class UVehiclePhysicsControlData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVehiclePhysicsControlData>();
	}
};
DUMPER7_ASSERTS_UVehiclePhysicsControlData;

// Class SeasunVehicle.DemoVehicle
// 0x0028 (0x02C0 - 0x0298)
class ADemoVehicle final : public AWheeledVehicle
{
public:
	class UDemoVehicleMovementComponent*          DemoMovementComponent;                             // 0x0298(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USkeletalMeshComponent*                 SkeletalMeshComponent;                             // 0x02A0(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPhysicsControlComponent*               PhysicsControlComponent;                           // 0x02A8(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnablePhyx;                                       // 0x02B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2B1[0x7];                                      // 0x02B1(0x0007)(Fixing Size After Last Property [ Rei-SdkDumper ])
	class UVehiclePhysicsControlData*             PhysicsControlData;                                // 0x02B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DemoVehicle")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DemoVehicle")
	}
	static class ADemoVehicle* GetDefaultObj()
	{
		return GetDefaultObjImpl<ADemoVehicle>();
	}
};
DUMPER7_ASSERTS_ADemoVehicle;

// Class SeasunVehicle.DemoVehicleMovementComponent
// 0x0008 (0x0418 - 0x0410)
class UDemoVehicleMovementComponent final : public UWheeledVehicleMovementComponent4W
{
public:
	float                                         RollLimit;                                         // 0x0410(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         PitchLimit;                                        // 0x0414(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DemoVehicleMovementComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DemoVehicleMovementComponent")
	}
	static class UDemoVehicleMovementComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDemoVehicleMovementComponent>();
	}
};
DUMPER7_ASSERTS_UDemoVehicleMovementComponent;

}

