#pragma once

/*
* SDK generated by Rei-SdkDumper
* Based on Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SM_BaseMonster_Abnormal

#include "Basic.hpp"

#include "SMSystem_structs.hpp"
#include "SMSystem_classes.hpp"
#include "Engine_structs.hpp"
#include "Game_structs.hpp"


namespace SDK
{

// SMBlueprintGeneratedClass SM_BaseMonster_Abnormal.SM_BaseMonster_Abnormal_C
// 0x2068 (0x26B0 - 0x0648)
class USM_BaseMonster_Abnormal_C final : public USMInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0648(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FSMTransition                          SM_BaseMonster_Abnormal_SM_BaseMonster_Abnormal_C; // 0x0650(0x01A8)()
	struct FSMTransition                          SM_BaseMonster_Abnormal_SM_BaseMonster_Abnormal_C_0; // 0x07F8(0x01A8)()
	struct FSMTransition                          SM_BaseMonster_Abnormal_SM_BaseMonster_Abnormal_C_1; // 0x09A0(0x01A8)()
	struct FSMTransition                          SM_BaseMonster_Abnormal_SM_BaseMonster_Abnormal_C_2; // 0x0B48(0x01A8)()
	struct FSMTransition                          SM_BaseMonster_Abnormal_SM_BaseMonster_Abnormal_C_3; // 0x0CF0(0x01A8)()
	struct FSMTransition                          SM_BaseMonster_Abnormal_SM_BaseMonster_Abnormal_C_4; // 0x0E98(0x01A8)()
	struct FSMTransition                          SM_BaseMonster_Abnormal_SM_BaseMonster_Abnormal_C_5; // 0x1040(0x01A8)()
	struct FSMTransition                          SM_BaseMonster_Abnormal_SM_BaseMonster_Abnormal_C_6; // 0x11E8(0x01A8)()
	struct FSMTransition                          SM_BaseMonster_Abnormal_SM_BaseMonster_Abnormal_C_7; // 0x1390(0x01A8)()
	struct FSMTransition                          SM_BaseMonster_Abnormal_SM_BaseMonster_Abnormal_C_8; // 0x1538(0x01A8)()
	struct FSMTransition                          SM_BaseMonster_Abnormal_SM_BaseMonster_Abnormal_C_9; // 0x16E0(0x01A8)()
	struct FSMTransition                          SM_BaseMonster_Abnormal_SM_BaseMonster_Abnormal_C_10; // 0x1888(0x01A8)()
	struct FSMState                               SM_BaseMonster_Abnormal_SM_BaseMonster_Abnormal_C_11; // 0x1A30(0x01C8)()
	struct FSMState                               SM_BaseMonster_Abnormal_SM_BaseMonster_Abnormal_C_12; // 0x1BF8(0x01C8)()
	struct FSMState                               SM_BaseMonster_Abnormal_SM_BaseMonster_Abnormal_C_13; // 0x1DC0(0x01C8)()
	struct FSMState                               SM_BaseMonster_Abnormal_SM_BaseMonster_Abnormal_C_14; // 0x1F88(0x01C8)()
	struct FSMState                               SM_BaseMonster_Abnormal_SM_BaseMonster_Abnormal_C_15; // 0x2150(0x01C8)()
	struct FSMConduit                             SM_BaseMonster_Abnormal_SM_BaseMonster_Abnormal_C_16; // 0x2318(0x01B8)()
	struct FSMState                               SM_BaseMonster_Abnormal_SM_BaseMonster_Abnormal_C_17; // 0x24D0(0x01C8)()
	class UObject*                                AbnormalSM;                                        // 0x2698(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityComponent*                      Ability;                                           // 0x26A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAbnormalState                                AbnormalState;                                     // 0x26A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Func_SM_BaseMonster_Abnormal_SM_BaseMonster_Abnormal_C_0();
	void Func_SM_BaseMonster_Abnormal_SM_BaseMonster_Abnormal_C_1();
	void Func_SM_BaseMonster_Abnormal_SM_BaseMonster_Abnormal_C_2();
	void Func_SM_BaseMonster_Abnormal_SM_BaseMonster_Abnormal_C_3();
	void Func_SM_BaseMonster_Abnormal_SM_BaseMonster_Abnormal_C_4();
	void Func_SM_BaseMonster_Abnormal_SM_BaseMonster_Abnormal_C_5();
	void Func_SM_BaseMonster_Abnormal_SM_BaseMonster_Abnormal_C_6();
	void Func_SM_BaseMonster_Abnormal_SM_BaseMonster_Abnormal_C_7();
	void Func_SM_BaseMonster_Abnormal_SM_BaseMonster_Abnormal_C_8();
	void Func_SM_BaseMonster_Abnormal_SM_BaseMonster_Abnormal_C_9();
	void Func_SM_BaseMonster_Abnormal_SM_BaseMonster_Abnormal_C_10();
	void Func_SM_BaseMonster_Abnormal_SM_BaseMonster_Abnormal_C_11();
	void Func_SM_BaseMonster_Abnormal_SM_BaseMonster_Abnormal_C_12();
	void Func_SM_BaseMonster_Abnormal_SM_BaseMonster_Abnormal_C_13();
	void Func_SM_BaseMonster_Abnormal_SM_BaseMonster_Abnormal_C_14();
	void Func_SM_BaseMonster_Abnormal_SM_BaseMonster_Abnormal_C_15();
	void Func_SM_BaseMonster_Abnormal_SM_BaseMonster_Abnormal_C_16();
	void Func_SM_BaseMonster_Abnormal_SM_BaseMonster_Abnormal_C_17();
	void Func_SM_BaseMonster_Abnormal_SM_BaseMonster_Abnormal_C_18();
	void Func_SM_BaseMonster_Abnormal_SM_BaseMonster_Abnormal_C_19();
	void OnStateMachineStart();
	void OnStateMachineUpdate(float DeltaSeconds);
	void ExecuteUbergraph_SM_BaseMonster_Abnormal(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("SM_BaseMonster_Abnormal_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SM_BaseMonster_Abnormal_C")
	}
	static class USM_BaseMonster_Abnormal_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USM_BaseMonster_Abnormal_C>();
	}
};
DUMPER7_ASSERTS_USM_BaseMonster_Abnormal_C;

}

