#pragma once

/*
* SDK generated by Rei-SdkDumper
* Based on Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SMExtendedRuntime

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "SMSystem_structs.hpp"


namespace SDK
{

// ScriptStruct SMExtendedRuntime.SMTextSerializer
// 0x0010 (0x0010 - 0x0000)
struct FSMTextSerializer final
{
public:
	TArray<class FName>                           ToTextFunctionNames;                               // 0x0000(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FSMTextSerializer;

// ScriptStruct SMExtendedRuntime.SMTextNodeWidgetInfo
// 0x0A77 (0x0A78 - 0x0001)
struct FSMTextNodeWidgetInfo final : public FSMTextDisplayWidgetInfo
{
public:
	struct FInlineEditableTextBlockStyle          EditableTextStyle;                                 // 0x0000(0x0A70)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	float                                         WrapTextAt;                                        // 0x0A70(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A74[0x4];                                      // 0x0A74(0x0004)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_FSMTextNodeWidgetInfo;

// ScriptStruct SMExtendedRuntime.SMTextGraphProperty
// 0x0AA0 (0x0BB0 - 0x0110)
struct FSMTextGraphProperty final : public FSMGraphProperty_Base
{
public:
	class FText                                   Result;                                            // 0x0110(0x0018)(BlueprintVisible, NativeAccessSpecifierPublic)
	struct FSMTextSerializer                      TextSerializer;                                    // 0x0128(0x0010)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FSMTextNodeWidgetInfo                  WidgetInfo;                                        // 0x0138(0x0A78)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FSMTextGraphProperty;

// ScriptStruct SMExtendedRuntime.SMTextGraphProperty_Runtime
// 0x0028 (0x0078 - 0x0050)
struct FSMTextGraphProperty_Runtime final : public FSMGraphProperty_Base_Runtime
{
public:
	class FText                                   Result;                                            // 0x0050(0x0018)(BlueprintVisible, NativeAccessSpecifierPublic)
	struct FSMTextSerializer                      TextSerializer;                                    // 0x0068(0x0010)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FSMTextGraphProperty_Runtime;

}

