#pragma once

/*
* SDK generated by Rei-SdkDumper
* Based on Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SMSystem

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// Enum SMSystem.ESMNetworkConfigurationType
// NumValues: 0x0004
enum class ESMNetworkConfigurationType : uint8
{
	SM_Client                                = 0,
	SM_Server                                = 1,
	SM_ClientAndServer                       = 2,
	SM_MAX                                   = 3,
};

// Enum SMSystem.ESMBlackboardMask
// NumValues: 0x0006
enum class ESMBlackboardMask : uint8
{
	All                                      = 0,
	First8Bit                                = 1,
	Second8Bit                               = 2,
	Third8Bit                                = 3,
	Fourth8Bit                               = 4,
	ESMBlackboardMask_MAX                    = 5,
};

// Enum SMSystem.ESMTransactionType
// NumValues: 0x0003
enum class ESMTransactionType : uint8
{
	SM_Transition                            = 0,
	SM_State                                 = 1,
	SM_MAX                                   = 2,
};

// Enum SMSystem.ESMConditionalEvaluationType
// NumValues: 0x0005
enum class ESMConditionalEvaluationType : uint8
{
	SM_Graph                                 = 0,
	SM_NodeInstance                          = 1,
	SM_AlwaysFalse                           = 2,
	SM_AlwaysTrue                            = 3,
	SM_MAX                                   = 4,
};

// ScriptStruct SMSystem.SMNodeClassRule
// 0x0010 (0x0010 - 0x0000)
struct alignas(0x08) FSMNodeClassRule
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Size After Last Property [ Rei-SdkDumper ])
	bool                                          bIncludeChildren;                                  // 0x0008(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bNOT;                                              // 0x0009(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_FSMNodeClassRule;

// ScriptStruct SMSystem.SMStateClassRule
// 0x0028 (0x0038 - 0x0010)
struct FSMStateClassRule final : public FSMNodeClassRule
{
public:
	TSoftClassPtr<class UClass>                   StateClass;                                        // 0x0010(0x0028)(Edit, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FSMStateClassRule;

// ScriptStruct SMSystem.SMStateMachineClassRule
// 0x0028 (0x0038 - 0x0010)
struct FSMStateMachineClassRule final : public FSMNodeClassRule
{
public:
	TSoftClassPtr<class UClass>                   StateMachineClass;                                 // 0x0010(0x0028)(Edit, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FSMStateMachineClassRule;

// ScriptStruct SMSystem.SMNodeConnectionRule
// 0x00A8 (0x00A8 - 0x0000)
struct FSMNodeConnectionRule final
{
public:
	struct FSMStateClassRule                      FromState;                                         // 0x0000(0x0038)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FSMStateClassRule                      ToState;                                           // 0x0038(0x0038)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FSMStateMachineClassRule               InStateMachine;                                    // 0x0070(0x0038)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FSMNodeConnectionRule;

// ScriptStruct SMSystem.SMInfo_Base
// 0x0060 (0x0060 - 0x0000)
struct FSMInfo_Base
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Size After Last Property [ Rei-SdkDumper ])
	class FString                                 NodeName;                                          // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGuid                                  Guid;                                              // 0x0018(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGuid                                  OwnerGuid;                                         // 0x0028(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGuid                                  NodeGuid;                                          // 0x0038(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGuid                                  OwnerNodeGuid;                                     // 0x0048(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USMNodeInstance*                        NodeInstance;                                      // 0x0058(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FSMInfo_Base;

// ScriptStruct SMSystem.SMExposedFunctionHandler
// 0x0020 (0x0020 - 0x0000)
struct FSMExposedFunctionHandler final
{
public:
	class FName                                   BoundFunction;                                     // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFunction*                              Function;                                          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UObject*                                OwnerObject;                                       // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_18[0x8];                                       // 0x0018(0x0008)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_FSMExposedFunctionHandler;

// ScriptStruct SMSystem.SMGraphProperty_Base_Runtime
// 0x0050 (0x0050 - 0x0000)
struct FSMGraphProperty_Base_Runtime
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Size After Last Property [ Rei-SdkDumper ])
	struct FSMExposedFunctionHandler              GraphEvaluator;                                    // 0x0008(0x0020)(NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Rei-SdkDumper ])
	struct FGuid                                  Guid;                                              // 0x0030(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGuid                                  OwnerGuid;                                         // 0x0040(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
};
DUMPER7_ASSERTS_FSMGraphProperty_Base_Runtime;

// ScriptStruct SMSystem.SMNode_Base
// 0x0108 (0x0108 - 0x0000)
struct FSMNode_Base
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Size After Last Property [ Rei-SdkDumper ])
	struct FSMExposedFunctionHandler              GraphEvaluator;                                    // 0x0008(0x0020)(NoDestructor, NativeAccessSpecifierPublic)
	float                                         TimeInState;                                       // 0x0028(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsInEndState;                                     // 0x002C(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bHasUpdated;                                       // 0x002D(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2E[0x2];                                       // 0x002E(0x0002)(Fixing Size After Last Property [ Rei-SdkDumper ])
	TArray<struct FSMExposedFunctionHandler>      TransitionInitializedGraphEvaluators;              // 0x0030(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FSMExposedFunctionHandler>      TransitionShutdownGraphEvaluators;                 // 0x0040(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	int32                                         DuplicateId;                                       // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGuid                                  Guid;                                              // 0x0054(0x0010)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGuid                                  OwnerGuid;                                         // 0x0064(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGuid                                  PathGuid;                                          // 0x0074(0x0010)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_84[0xC];                                       // 0x0084(0x000C)(Fixing Size After Last Property [ Rei-SdkDumper ])
	class FString                                 NodeName;                                          // 0x0090(0x0010)(ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                   TemplateName;                                      // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class FName>                           StackTemplateNames;                                // 0x00A8(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TArray<class USMNodeInstance*>                StackNodeInstances;                                // 0x00B8(0x0010)(BlueprintVisible, ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
	class USMInstance*                            OwningInstance;                                    // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class USMNodeInstance*                        NodeInstance;                                      // 0x00D0(0x0008)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_D8[0x10];                                      // 0x00D8(0x0010)(Fixing Size After Last Property [ Rei-SdkDumper ])
	TArray<struct FSMGraphProperty_Base_Runtime>  VariableGraphProperties;                           // 0x00E8(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	class UClass*                                 NodeInstanceClass;                                 // 0x00F8(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_100[0x8];                                      // 0x0100(0x0008)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_FSMNode_Base;

// ScriptStruct SMSystem.SMState_Base
// 0x0080 (0x0188 - 0x0108)
struct FSMState_Base : public FSMNode_Base
{
public:
	uint8                                         bIsRootNode : 1;                                   // 0x0108(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bAlwaysUpdate : 1;                                 // 0x0108(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bEvalTransitionsOnStart : 1;                       // 0x0108(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bDisableTickTransitionEvaluation : 1;              // 0x0108(0x0001)(BitIndex: 0x03, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bStayActiveOnStateChange : 1;                      // 0x0108(0x0001)(BitIndex: 0x04, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bAllowParallelReentry : 1;                         // 0x0108(0x0001)(BitIndex: 0x05, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_109[0x7];                                      // 0x0109(0x0007)(Fixing Size After Last Property [ Rei-SdkDumper ])
	struct FSMExposedFunctionHandler              OnRootStateMachineStartedGraphEvaluator;           // 0x0110(0x0020)(NoDestructor, NativeAccessSpecifierPublic)
	struct FSMExposedFunctionHandler              OnRootStateMachineStoppedGraphEvaluator;           // 0x0130(0x0020)(NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_150[0x38];                                     // 0x0150(0x0038)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_FSMState_Base;

// ScriptStruct SMSystem.SMConduit
// 0x0030 (0x01B8 - 0x0188)
struct FSMConduit final : public FSMState_Base
{
public:
	uint8                                         bCanEnterTransition : 1;                           // 0x0188(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bCanEvaluate : 1;                                  // 0x0188(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bEvalWithTransitions : 1;                          // 0x0188(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_189[0x7];                                      // 0x0189(0x0007)(Fixing Size After Last Property [ Rei-SdkDumper ])
	struct FSMExposedFunctionHandler              ConduitEnteredGraphEvaluator;                      // 0x0190(0x0020)(NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_1B0[0x8];                                      // 0x01B0(0x0008)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_FSMConduit;

// ScriptStruct SMSystem.SMConnectionValidator
// 0x0000 (0x0000 - 0x0000)
#pragma pack(push, 0x1)
struct alignas(0x01) FSMConnectionValidator
{
};
#pragma pack(pop)
DUMPER7_ASSERTS_FSMConnectionValidator;

// ScriptStruct SMSystem.SMTransitionConnectionValidator
// 0x0010 (0x0010 - 0x0000)
struct FSMTransitionConnectionValidator final : public FSMConnectionValidator
{
public:
	TArray<struct FSMNodeConnectionRule>          AllowedConnections;                                // 0x0000(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FSMTransitionConnectionValidator;

// ScriptStruct SMSystem.SMTransitionInfo
// 0x0030 (0x0090 - 0x0060)
struct FSMTransitionInfo final : public FSMInfo_Base
{
public:
	struct FGuid                                  FromStateGuid;                                     // 0x0060(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGuid                                  ToStateGuid;                                       // 0x0070(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Priority;                                          // 0x0080(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_84[0xC];                                       // 0x0084(0x000C)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_FSMTransitionInfo;

// ScriptStruct SMSystem.SMStateInfo
// 0x0020 (0x0080 - 0x0060)
struct FSMStateInfo final : public FSMInfo_Base
{
public:
	TArray<struct FSMTransitionInfo>              OutgoingTransitions;                               // 0x0060(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          bIsEndState;                                       // 0x0070(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_71[0xF];                                       // 0x0071(0x000F)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_FSMStateInfo;

// ScriptStruct SMSystem.SMGraphProperty_Base
// 0x00C0 (0x0110 - 0x0050)
struct FSMGraphProperty_Base : public FSMGraphProperty_Base_Runtime
{
public:
	class FName                                   VariableName;                                      // 0x0050(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FEdGraphPinType                        VariableType;                                      // 0x0058(0x0058)(NoDestructor, NativeAccessSpecifierPublic)
	struct FMemberReference                       MemberReference;                                   // 0x00B0(0x0038)(NativeAccessSpecifierPublic)
	bool                                          bIsInArray;                                        // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_E9[0x3];                                       // 0x00E9(0x0003)(Fixing Size After Last Property [ Rei-SdkDumper ])
	struct FGuid                                  GuidUnmodified;                                    // 0x00EC(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGuid                                  TemplateGuid;                                      // 0x00FC(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         GuidIndex;                                         // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
};
DUMPER7_ASSERTS_FSMGraphProperty_Base;

// ScriptStruct SMSystem.SMGraphProperty
// 0x0000 (0x0110 - 0x0110)
struct FSMGraphProperty final : public FSMGraphProperty_Base
{
};
DUMPER7_ASSERTS_FSMGraphProperty;

// ScriptStruct SMSystem.SMGraphProperty_Runtime
// 0x0000 (0x0050 - 0x0050)
struct FSMGraphProperty_Runtime final : public FSMGraphProperty_Base_Runtime
{
};
DUMPER7_ASSERTS_FSMGraphProperty_Runtime;

// ScriptStruct SMSystem.SMDebugStateMachine
// 0x0001 (0x0001 - 0x0000)
struct FSMDebugStateMachine final
{
public:
	uint8                                         Pad_0[0x1];                                        // 0x0000(0x0001)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_FSMDebugStateMachine;

// ScriptStruct SMSystem.SMNetworkedTransaction
// 0x0040 (0x0040 - 0x0000)
struct FSMNetworkedTransaction final
{
public:
	struct FGuid                                  StateMachineGuid;                                  // 0x0000(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGuid                                  BaseGuid;                                          // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGuid                                  TransactionGuid;                                   // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FDateTime                              Timestamp;                                         // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         TransactionType : 1;                               // 0x0038(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bIsActive : 1;                                     // 0x0038(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_FSMNetworkedTransaction;

// ScriptStruct SMSystem.SMNodeDescription
// 0x0038 (0x0038 - 0x0000)
struct FSMNodeDescription final
{
public:
	class FName                                   Name;                                              // 0x0000(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                   Category;                                          // 0x0008(0x0018)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	class FText                                   Description;                                       // 0x0020(0x0018)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FSMNodeDescription;

// ScriptStruct SMSystem.SMStateMachineNodePlacementValidator
// 0x0018 (0x0018 - 0x0000)
struct FSMStateMachineNodePlacementValidator final : public FSMConnectionValidator
{
public:
	TArray<struct FSMStateClassRule>              AllowedStates;                                     // 0x0000(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	bool                                          bAllowReferences;                                  // 0x0010(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAllowParents;                                     // 0x0011(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_FSMStateMachineNodePlacementValidator;

// ScriptStruct SMSystem.SMStateConnectionValidator
// 0x0030 (0x0030 - 0x0000)
struct FSMStateConnectionValidator final : public FSMConnectionValidator
{
public:
	TArray<struct FSMStateClassRule>              AllowedInboundStates;                              // 0x0000(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TArray<struct FSMStateClassRule>              AllowedOutboundStates;                             // 0x0010(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TArray<struct FSMStateMachineClassRule>       AllowedInStateMachines;                            // 0x0020(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FSMStateConnectionValidator;

// ScriptStruct SMSystem.SMNodeWidgetInfo
// 0x0000 (0x0000 - 0x0000)
#pragma pack(push, 0x1)
struct alignas(0x01) FSMNodeWidgetInfo
{
};
#pragma pack(pop)
DUMPER7_ASSERTS_FSMNodeWidgetInfo;

// ScriptStruct SMSystem.SMTextDisplayWidgetInfo
// 0x0001 (0x0001 - 0x0000)
#pragma pack(push, 0x1)
struct alignas(0x01) FSMTextDisplayWidgetInfo : public FSMNodeWidgetInfo
{
public:
	uint8                                         Pad_0[0x1];                                        // 0x0000(0x0001)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
#pragma pack(pop)
DUMPER7_ASSERTS_FSMTextDisplayWidgetInfo;

// ScriptStruct SMSystem.SMState
// 0x0040 (0x01C8 - 0x0188)
struct FSMState final : public FSMState_Base
{
public:
	struct FSMExposedFunctionHandler              UpdateStateGraphEvaluator;                         // 0x0188(0x0020)(NoDestructor, NativeAccessSpecifierPublic)
	struct FSMExposedFunctionHandler              EndStateGraphEvaluator;                            // 0x01A8(0x0020)(NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FSMState;

// ScriptStruct SMSystem.SMStateMachine
// 0x0238 (0x03C0 - 0x0188)
struct FSMStateMachine final : public FSMState_Base
{
public:
	bool                                          bHasAdditionalLogic;                               // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bReuseCurrentState;                                // 0x0189(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOnlyReuseIfNotEndState;                           // 0x018A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAllowIndependentTick;                             // 0x018B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCallReferenceTickOnManualUpdate;                  // 0x018C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bReuseReference;                                   // 0x018D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bWaitForEndState;                                  // 0x018E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_18F[0x1];                                      // 0x018F(0x0001)(Fixing Size After Last Property [ Rei-SdkDumper ])
	struct FSMExposedFunctionHandler              UpdateStateGraphEvaluator;                         // 0x0190(0x0020)(NoDestructor, NativeAccessSpecifierPublic)
	struct FSMExposedFunctionHandler              EndStateGraphEvaluator;                            // 0x01B0(0x0020)(NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_1D0[0x28];                                     // 0x01D0(0x0028)(Fixing Size After Last Property [ Rei-SdkDumper ])
	TMap<struct FGuid, struct FSMNetworkedTransaction> PreviousTransactions;                         // 0x01F8(0x0050)(Transient, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_248[0x140];                                    // 0x0248(0x0140)(Fixing Size After Last Property [ Rei-SdkDumper ])
	class UClass*                                 ReferencedStateMachineClass;                       // 0x0388(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                   ReferencedTemplateName;                            // 0x0390(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class USMInstance*                            ReferencedStateMachine;                            // 0x0398(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class USMInstance*                            IsReferencedByInstance;                            // 0x03A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_3A8[0x18];                                     // 0x03A8(0x0018)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_FSMStateMachine;

// ScriptStruct SMSystem.SMTransition
// 0x00A0 (0x01A8 - 0x0108)
struct FSMTransition final : public FSMNode_Base
{
public:
	struct FSMExposedFunctionHandler              TransitionEnteredGraphEvaluator;                   // 0x0108(0x0020)(NoDestructor, NativeAccessSpecifierPublic)
	struct FSMExposedFunctionHandler              TransitionPreEvaluateGraphEvaluator;               // 0x0128(0x0020)(NoDestructor, NativeAccessSpecifierPublic)
	struct FSMExposedFunctionHandler              TransitionPostEvaluateGraphEvaluator;              // 0x0148(0x0020)(NoDestructor, NativeAccessSpecifierPublic)
	int32                                         Priority;                                          // 0x0168(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bCanEnterTransition : 1;                           // 0x016C(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bCanEnterTransitionFromEvent : 1;                  // 0x016C(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bIsEvaluating : 1;                                 // 0x016C(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bCanEvaluate : 1;                                  // 0x016C(0x0001)(BitIndex: 0x03, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bCanEvaluateFromEvent : 1;                         // 0x016C(0x0001)(BitIndex: 0x04, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bRunParallel : 1;                                  // 0x016C(0x0001)(BitIndex: 0x05, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bEvalIfNextStateActive : 1;                        // 0x016C(0x0001)(BitIndex: 0x06, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bCanEvalWithStartState : 1;                        // 0x016C(0x0001)(BitIndex: 0x07, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bAlwaysFalse : 1;                                  // 0x016D(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_16E[0x2];                                      // 0x016E(0x0002)(Fixing Size After Last Property [ Rei-SdkDumper ])
	struct FGuid                                  FromGuid;                                          // 0x0170(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGuid                                  ToGuid;                                            // 0x0180(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESMConditionalEvaluationType                  ConditionalEvaluationType;                         // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_191[0x17];                                     // 0x0191(0x0017)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_FSMTransition;

}

