#pragma once

/*
* SDK generated by Rei-SdkDumper
* Based on Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SpinePlugin

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function SpinePlugin.SpineBoneDriverComponent.BeforeUpdateWorldTransform
// 0x0008 (0x0008 - 0x0000)
struct SpineBoneDriverComponent_BeforeUpdateWorldTransform final
{
public:
	class USpineSkeletonComponent*                Skeleton;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SpineBoneDriverComponent_BeforeUpdateWorldTransform;

// Function SpinePlugin.TrackEntry.GetAlpha
// 0x0004 (0x0004 - 0x0000)
struct TrackEntry_GetAlpha final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_TrackEntry_GetAlpha;

// Function SpinePlugin.TrackEntry.getAnimationDuration
// 0x0004 (0x0004 - 0x0000)
struct TrackEntry_getAnimationDuration final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_TrackEntry_getAnimationDuration;

// Function SpinePlugin.TrackEntry.GetAnimationEnd
// 0x0004 (0x0004 - 0x0000)
struct TrackEntry_GetAnimationEnd final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_TrackEntry_GetAnimationEnd;

// Function SpinePlugin.TrackEntry.GetAnimationLast
// 0x0004 (0x0004 - 0x0000)
struct TrackEntry_GetAnimationLast final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_TrackEntry_GetAnimationLast;

// Function SpinePlugin.TrackEntry.getAnimationName
// 0x0010 (0x0010 - 0x0000)
struct TrackEntry_getAnimationName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_TrackEntry_getAnimationName;

// Function SpinePlugin.TrackEntry.GetAnimationStart
// 0x0004 (0x0004 - 0x0000)
struct TrackEntry_GetAnimationStart final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_TrackEntry_GetAnimationStart;

// Function SpinePlugin.TrackEntry.GetAttachmentThreshold
// 0x0004 (0x0004 - 0x0000)
struct TrackEntry_GetAttachmentThreshold final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_TrackEntry_GetAttachmentThreshold;

// Function SpinePlugin.TrackEntry.GetDelay
// 0x0004 (0x0004 - 0x0000)
struct TrackEntry_GetDelay final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_TrackEntry_GetDelay;

// Function SpinePlugin.TrackEntry.GetDrawOrderThreshold
// 0x0004 (0x0004 - 0x0000)
struct TrackEntry_GetDrawOrderThreshold final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_TrackEntry_GetDrawOrderThreshold;

// Function SpinePlugin.TrackEntry.GetEventThreshold
// 0x0004 (0x0004 - 0x0000)
struct TrackEntry_GetEventThreshold final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_TrackEntry_GetEventThreshold;

// Function SpinePlugin.TrackEntry.GetLoop
// 0x0001 (0x0001 - 0x0000)
struct TrackEntry_GetLoop final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_TrackEntry_GetLoop;

// Function SpinePlugin.TrackEntry.GetMixDuration
// 0x0004 (0x0004 - 0x0000)
struct TrackEntry_GetMixDuration final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_TrackEntry_GetMixDuration;

// Function SpinePlugin.TrackEntry.GetMixTime
// 0x0004 (0x0004 - 0x0000)
struct TrackEntry_GetMixTime final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_TrackEntry_GetMixTime;

// Function SpinePlugin.TrackEntry.GetTimeScale
// 0x0004 (0x0004 - 0x0000)
struct TrackEntry_GetTimeScale final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_TrackEntry_GetTimeScale;

// Function SpinePlugin.TrackEntry.GetTrackEnd
// 0x0004 (0x0004 - 0x0000)
struct TrackEntry_GetTrackEnd final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_TrackEntry_GetTrackEnd;

// Function SpinePlugin.TrackEntry.GetTrackIndex
// 0x0004 (0x0004 - 0x0000)
struct TrackEntry_GetTrackIndex final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_TrackEntry_GetTrackIndex;

// Function SpinePlugin.TrackEntry.GetTrackTime
// 0x0004 (0x0004 - 0x0000)
struct TrackEntry_GetTrackTime final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_TrackEntry_GetTrackTime;

// Function SpinePlugin.TrackEntry.isValidAnimation
// 0x0004 (0x0004 - 0x0000)
struct TrackEntry_isValidAnimation final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_TrackEntry_isValidAnimation;

// Function SpinePlugin.TrackEntry.SetAlpha
// 0x0004 (0x0004 - 0x0000)
struct TrackEntry_SetAlpha final
{
public:
	float                                         Alpha;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_TrackEntry_SetAlpha;

// Function SpinePlugin.TrackEntry.SetAnimationEnd
// 0x0004 (0x0004 - 0x0000)
struct TrackEntry_SetAnimationEnd final
{
public:
	float                                         animationEnd_0;                                    // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_TrackEntry_SetAnimationEnd;

// Function SpinePlugin.TrackEntry.SetAnimationLast
// 0x0004 (0x0004 - 0x0000)
struct TrackEntry_SetAnimationLast final
{
public:
	float                                         animationLast;                                     // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_TrackEntry_SetAnimationLast;

// Function SpinePlugin.TrackEntry.SetAnimationStart
// 0x0004 (0x0004 - 0x0000)
struct TrackEntry_SetAnimationStart final
{
public:
	float                                         animationStart_0;                                  // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_TrackEntry_SetAnimationStart;

// Function SpinePlugin.TrackEntry.SetAttachmentThreshold
// 0x0004 (0x0004 - 0x0000)
struct TrackEntry_SetAttachmentThreshold final
{
public:
	float                                         attachmentThreshold;                               // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_TrackEntry_SetAttachmentThreshold;

// Function SpinePlugin.TrackEntry.SetDelay
// 0x0004 (0x0004 - 0x0000)
struct TrackEntry_SetDelay final
{
public:
	float                                         Delay;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_TrackEntry_SetDelay;

// Function SpinePlugin.TrackEntry.SetDrawOrderThreshold
// 0x0004 (0x0004 - 0x0000)
struct TrackEntry_SetDrawOrderThreshold final
{
public:
	float                                         drawOrderThreshold;                                // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_TrackEntry_SetDrawOrderThreshold;

// Function SpinePlugin.TrackEntry.SetEventThreshold
// 0x0004 (0x0004 - 0x0000)
struct TrackEntry_SetEventThreshold final
{
public:
	float                                         eventThreshold;                                    // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_TrackEntry_SetEventThreshold;

// Function SpinePlugin.TrackEntry.SetLoop
// 0x0001 (0x0001 - 0x0000)
struct TrackEntry_SetLoop final
{
public:
	bool                                          Loop;                                              // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_TrackEntry_SetLoop;

// Function SpinePlugin.TrackEntry.SetMixDuration
// 0x0004 (0x0004 - 0x0000)
struct TrackEntry_SetMixDuration final
{
public:
	float                                         mixDuration;                                       // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_TrackEntry_SetMixDuration;

// Function SpinePlugin.TrackEntry.SetMixTime
// 0x0004 (0x0004 - 0x0000)
struct TrackEntry_SetMixTime final
{
public:
	float                                         mixTime;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_TrackEntry_SetMixTime;

// Function SpinePlugin.TrackEntry.SetTimeScale
// 0x0004 (0x0004 - 0x0000)
struct TrackEntry_SetTimeScale final
{
public:
	float                                         TimeScale;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_TrackEntry_SetTimeScale;

// Function SpinePlugin.TrackEntry.SetTrackEnd
// 0x0004 (0x0004 - 0x0000)
struct TrackEntry_SetTrackEnd final
{
public:
	float                                         trackEnd;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_TrackEntry_SetTrackEnd;

// Function SpinePlugin.TrackEntry.SetTrackTime
// 0x0004 (0x0004 - 0x0000)
struct TrackEntry_SetTrackTime final
{
public:
	float                                         TrackTime;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_TrackEntry_SetTrackTime;

// Function SpinePlugin.SpineSkeletonComponent.ActivateBone
// 0x0018 (0x0018 - 0x0000)
struct SpineSkeletonComponent_ActivateBone final
{
public:
	class FString                                 BoneName;                                          // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bActivate;                                         // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_SpineSkeletonComponent_ActivateBone;

// Function SpinePlugin.SpineSkeletonComponent.getAnimationDuration
// 0x0018 (0x0018 - 0x0000)
struct SpineSkeletonComponent_getAnimationDuration final
{
public:
	class FString                                 AnimationName;                                     // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_SpineSkeletonComponent_getAnimationDuration;

// Function SpinePlugin.SpineSkeletonComponent.GetAnimations
// 0x0010 (0x0010 - 0x0000)
struct SpineSkeletonComponent_GetAnimations final
{
public:
	TArray<class FString>                         Animations;                                        // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SpineSkeletonComponent_GetAnimations;

// Function SpinePlugin.SpineSkeletonComponent.GetBones
// 0x0010 (0x0010 - 0x0000)
struct SpineSkeletonComponent_GetBones final
{
public:
	TArray<class FString>                         Bones;                                             // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SpineSkeletonComponent_GetBones;

// Function SpinePlugin.SpineSkeletonComponent.GetBoneWorldTransform
// 0x0040 (0x0040 - 0x0000)
struct SpineSkeletonComponent_GetBoneWorldTransform final
{
public:
	class FString                                 BoneName;                                          // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FTransform                             ReturnValue;                                       // 0x0010(0x0030)(Parm, OutParm, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SpineSkeletonComponent_GetBoneWorldTransform;

// Function SpinePlugin.SpineSkeletonComponent.GetScaleX
// 0x0004 (0x0004 - 0x0000)
struct SpineSkeletonComponent_GetScaleX final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SpineSkeletonComponent_GetScaleX;

// Function SpinePlugin.SpineSkeletonComponent.GetScaleY
// 0x0004 (0x0004 - 0x0000)
struct SpineSkeletonComponent_GetScaleY final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SpineSkeletonComponent_GetScaleY;

// Function SpinePlugin.SpineSkeletonComponent.GetSkins
// 0x0010 (0x0010 - 0x0000)
struct SpineSkeletonComponent_GetSkins final
{
public:
	TArray<class FString>                         Skins;                                             // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SpineSkeletonComponent_GetSkins;

// Function SpinePlugin.SpineSkeletonComponent.GetSlots
// 0x0010 (0x0010 - 0x0000)
struct SpineSkeletonComponent_GetSlots final
{
public:
	TArray<class FString>                         Slots;                                             // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SpineSkeletonComponent_GetSlots;

// Function SpinePlugin.SpineSkeletonComponent.HasAnimation
// 0x0018 (0x0018 - 0x0000)
struct SpineSkeletonComponent_HasAnimation final
{
public:
	class FString                                 AnimationName;                                     // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_SpineSkeletonComponent_HasAnimation;

// Function SpinePlugin.SpineSkeletonComponent.HasBone
// 0x0018 (0x0018 - 0x0000)
struct SpineSkeletonComponent_HasBone final
{
public:
	class FString                                 BoneName;                                          // 0x0000(0x0010)(ConstParm, Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_SpineSkeletonComponent_HasBone;

// Function SpinePlugin.SpineSkeletonComponent.HasSkin
// 0x0018 (0x0018 - 0x0000)
struct SpineSkeletonComponent_HasSkin final
{
public:
	class FString                                 SkinName;                                          // 0x0000(0x0010)(ConstParm, Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_SpineSkeletonComponent_HasSkin;

// Function SpinePlugin.SpineSkeletonComponent.HasSlot
// 0x0018 (0x0018 - 0x0000)
struct SpineSkeletonComponent_HasSlot final
{
public:
	class FString                                 SlotName;                                          // 0x0000(0x0010)(ConstParm, Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_SpineSkeletonComponent_HasSlot;

// Function SpinePlugin.SpineSkeletonComponent.SetAttachment
// 0x0028 (0x0028 - 0x0000)
struct SpineSkeletonComponent_SetAttachment final
{
public:
	class FString                                 SlotName;                                          // 0x0000(0x0010)(ConstParm, Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 attachmentName;                                    // 0x0010(0x0010)(ConstParm, Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_SpineSkeletonComponent_SetAttachment;

// Function SpinePlugin.SpineSkeletonComponent.SetBoneWorldPosition
// 0x0020 (0x0020 - 0x0000)
struct SpineSkeletonComponent_SetBoneWorldPosition final
{
public:
	class FString                                 BoneName;                                          // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Position;                                          // 0x0010(0x000C)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_SpineSkeletonComponent_SetBoneWorldPosition;

// Function SpinePlugin.SpineSkeletonComponent.SetScale
// 0x0004 (0x0004 - 0x0000)
struct SpineSkeletonComponent_SetScale final
{
public:
	float                                         InScale;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SpineSkeletonComponent_SetScale;

// Function SpinePlugin.SpineSkeletonComponent.SetScaleX
// 0x0004 (0x0004 - 0x0000)
struct SpineSkeletonComponent_SetScaleX final
{
public:
	float                                         ScaleX;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SpineSkeletonComponent_SetScaleX;

// Function SpinePlugin.SpineSkeletonComponent.SetScaleY
// 0x0004 (0x0004 - 0x0000)
struct SpineSkeletonComponent_SetScaleY final
{
public:
	float                                         ScaleY;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SpineSkeletonComponent_SetScaleY;

// Function SpinePlugin.SpineSkeletonComponent.SetSkin
// 0x0018 (0x0018 - 0x0000)
struct SpineSkeletonComponent_SetSkin final
{
public:
	class FString                                 SkinName;                                          // 0x0000(0x0010)(ConstParm, Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_SpineSkeletonComponent_SetSkin;

// Function SpinePlugin.SpineSkeletonComponent.SetSkins
// 0x0018 (0x0018 - 0x0000)
struct SpineSkeletonComponent_SetSkins final
{
public:
	TArray<class FString>                         SkinNames;                                         // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_SpineSkeletonComponent_SetSkins;

// Function SpinePlugin.SpineSkeletonAnimationComponent.AddAnimation
// 0x0028 (0x0028 - 0x0000)
struct SpineSkeletonAnimationComponent_AddAnimation final
{
public:
	int32                                         TrackIndex;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Rei-SdkDumper ])
	class FString                                 AnimationName;                                     // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Loop;                                              // 0x0018(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Rei-SdkDumper ])
	float                                         Delay;                                             // 0x001C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTrackEntry*                            ReturnValue;                                       // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SpineSkeletonAnimationComponent_AddAnimation;

// Function SpinePlugin.SpineSkeletonAnimationComponent.AddEmptyAnimation
// 0x0018 (0x0018 - 0x0000)
struct SpineSkeletonAnimationComponent_AddEmptyAnimation final
{
public:
	int32                                         TrackIndex;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         mixDuration;                                       // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Delay;                                             // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Rei-SdkDumper ])
	class UTrackEntry*                            ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SpineSkeletonAnimationComponent_AddEmptyAnimation;

// Function SpinePlugin.SpineSkeletonAnimationComponent.ClearTrack
// 0x0004 (0x0004 - 0x0000)
struct SpineSkeletonAnimationComponent_ClearTrack final
{
public:
	int32                                         TrackIndex;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SpineSkeletonAnimationComponent_ClearTrack;

// Function SpinePlugin.SpineSkeletonAnimationComponent.GetCurrent
// 0x0010 (0x0010 - 0x0000)
struct SpineSkeletonAnimationComponent_GetCurrent final
{
public:
	int32                                         TrackIndex;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Rei-SdkDumper ])
	class UTrackEntry*                            ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SpineSkeletonAnimationComponent_GetCurrent;

// Function SpinePlugin.SpineSkeletonAnimationComponent.GetTimeScale
// 0x0004 (0x0004 - 0x0000)
struct SpineSkeletonAnimationComponent_GetTimeScale final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SpineSkeletonAnimationComponent_GetTimeScale;

// Function SpinePlugin.SpineSkeletonAnimationComponent.SetAnimation
// 0x0028 (0x0028 - 0x0000)
struct SpineSkeletonAnimationComponent_SetAnimation final
{
public:
	int32                                         TrackIndex;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Rei-SdkDumper ])
	class FString                                 AnimationName;                                     // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Loop;                                              // 0x0018(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Rei-SdkDumper ])
	class UTrackEntry*                            ReturnValue;                                       // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SpineSkeletonAnimationComponent_SetAnimation;

// Function SpinePlugin.SpineSkeletonAnimationComponent.SetAutoPlay
// 0x0001 (0x0001 - 0x0000)
struct SpineSkeletonAnimationComponent_SetAutoPlay final
{
public:
	bool                                          bInAutoPlays;                                      // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SpineSkeletonAnimationComponent_SetAutoPlay;

// Function SpinePlugin.SpineSkeletonAnimationComponent.SetEmptyAnimation
// 0x0010 (0x0010 - 0x0000)
struct SpineSkeletonAnimationComponent_SetEmptyAnimation final
{
public:
	int32                                         TrackIndex;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         mixDuration;                                       // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTrackEntry*                            ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SpineSkeletonAnimationComponent_SetEmptyAnimation;

// Function SpinePlugin.SpineSkeletonAnimationComponent.SetPlaybackTime
// 0x0008 (0x0008 - 0x0000)
struct SpineSkeletonAnimationComponent_SetPlaybackTime final
{
public:
	float                                         InPlaybackTime;                                    // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCallDelegates;                                    // 0x0004(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_SpineSkeletonAnimationComponent_SetPlaybackTime;

// Function SpinePlugin.SpineSkeletonAnimationComponent.SetTimeScale
// 0x0004 (0x0004 - 0x0000)
struct SpineSkeletonAnimationComponent_SetTimeScale final
{
public:
	float                                         TimeScale;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SpineSkeletonAnimationComponent_SetTimeScale;

// Function SpinePlugin.SpineWidget.ActivateBone
// 0x0018 (0x0018 - 0x0000)
struct SpineWidget_ActivateBone final
{
public:
	class FString                                 BoneName;                                          // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bActivate;                                         // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_SpineWidget_ActivateBone;

// Function SpinePlugin.SpineWidget.AddAnimation
// 0x0028 (0x0028 - 0x0000)
struct SpineWidget_AddAnimation final
{
public:
	int32                                         TrackIndex;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Rei-SdkDumper ])
	class FString                                 AnimationName;                                     // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Loop;                                              // 0x0018(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Rei-SdkDumper ])
	float                                         Delay;                                             // 0x001C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTrackEntry*                            ReturnValue;                                       // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SpineWidget_AddAnimation;

// Function SpinePlugin.SpineWidget.AddEmptyAnimation
// 0x0018 (0x0018 - 0x0000)
struct SpineWidget_AddEmptyAnimation final
{
public:
	int32                                         TrackIndex;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         mixDuration;                                       // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Delay;                                             // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Rei-SdkDumper ])
	class UTrackEntry*                            ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SpineWidget_AddEmptyAnimation;

// Function SpinePlugin.SpineWidget.ClearTrack
// 0x0004 (0x0004 - 0x0000)
struct SpineWidget_ClearTrack final
{
public:
	int32                                         TrackIndex;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SpineWidget_ClearTrack;

// Function SpinePlugin.SpineWidget.getAnimationDuration
// 0x0018 (0x0018 - 0x0000)
struct SpineWidget_getAnimationDuration final
{
public:
	class FString                                 AnimationName;                                     // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_SpineWidget_getAnimationDuration;

// Function SpinePlugin.SpineWidget.GetAnimations
// 0x0010 (0x0010 - 0x0000)
struct SpineWidget_GetAnimations final
{
public:
	TArray<class FString>                         Animations;                                        // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SpineWidget_GetAnimations;

// Function SpinePlugin.SpineWidget.GetBones
// 0x0010 (0x0010 - 0x0000)
struct SpineWidget_GetBones final
{
public:
	TArray<class FString>                         Bones;                                             // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SpineWidget_GetBones;

// Function SpinePlugin.SpineWidget.GetCurrent
// 0x0010 (0x0010 - 0x0000)
struct SpineWidget_GetCurrent final
{
public:
	int32                                         TrackIndex;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Rei-SdkDumper ])
	class UTrackEntry*                            ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SpineWidget_GetCurrent;

// Function SpinePlugin.SpineWidget.GetScaleX
// 0x0004 (0x0004 - 0x0000)
struct SpineWidget_GetScaleX final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SpineWidget_GetScaleX;

// Function SpinePlugin.SpineWidget.GetScaleY
// 0x0004 (0x0004 - 0x0000)
struct SpineWidget_GetScaleY final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SpineWidget_GetScaleY;

// Function SpinePlugin.SpineWidget.GetSkins
// 0x0010 (0x0010 - 0x0000)
struct SpineWidget_GetSkins final
{
public:
	TArray<class FString>                         Skins;                                             // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SpineWidget_GetSkins;

// Function SpinePlugin.SpineWidget.GetSlots
// 0x0010 (0x0010 - 0x0000)
struct SpineWidget_GetSlots final
{
public:
	TArray<class FString>                         Slots;                                             // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SpineWidget_GetSlots;

// Function SpinePlugin.SpineWidget.GetTimeScale
// 0x0004 (0x0004 - 0x0000)
struct SpineWidget_GetTimeScale final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SpineWidget_GetTimeScale;

// Function SpinePlugin.SpineWidget.HasAnimation
// 0x0018 (0x0018 - 0x0000)
struct SpineWidget_HasAnimation final
{
public:
	class FString                                 AnimationName;                                     // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_SpineWidget_HasAnimation;

// Function SpinePlugin.SpineWidget.HasBone
// 0x0018 (0x0018 - 0x0000)
struct SpineWidget_HasBone final
{
public:
	class FString                                 BoneName;                                          // 0x0000(0x0010)(ConstParm, Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_SpineWidget_HasBone;

// Function SpinePlugin.SpineWidget.HasSkin
// 0x0018 (0x0018 - 0x0000)
struct SpineWidget_HasSkin final
{
public:
	class FString                                 SkinName;                                          // 0x0000(0x0010)(ConstParm, Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_SpineWidget_HasSkin;

// Function SpinePlugin.SpineWidget.HasSlot
// 0x0018 (0x0018 - 0x0000)
struct SpineWidget_HasSlot final
{
public:
	class FString                                 SlotName;                                          // 0x0000(0x0010)(ConstParm, Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_SpineWidget_HasSlot;

// Function SpinePlugin.SpineWidget.SetAnimation
// 0x0028 (0x0028 - 0x0000)
struct SpineWidget_SetAnimation final
{
public:
	int32                                         TrackIndex;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Rei-SdkDumper ])
	class FString                                 AnimationName;                                     // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Loop;                                              // 0x0018(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Rei-SdkDumper ])
	class UTrackEntry*                            ReturnValue;                                       // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SpineWidget_SetAnimation;

// Function SpinePlugin.SpineWidget.SetAttachment
// 0x0028 (0x0028 - 0x0000)
struct SpineWidget_SetAttachment final
{
public:
	class FString                                 SlotName;                                          // 0x0000(0x0010)(ConstParm, Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 attachmentName;                                    // 0x0010(0x0010)(ConstParm, Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_SpineWidget_SetAttachment;

// Function SpinePlugin.SpineWidget.SetAutoPlay
// 0x0001 (0x0001 - 0x0000)
struct SpineWidget_SetAutoPlay final
{
public:
	bool                                          bInAutoPlays;                                      // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SpineWidget_SetAutoPlay;

// Function SpinePlugin.SpineWidget.SetEmptyAnimation
// 0x0010 (0x0010 - 0x0000)
struct SpineWidget_SetEmptyAnimation final
{
public:
	int32                                         TrackIndex;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         mixDuration;                                       // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTrackEntry*                            ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SpineWidget_SetEmptyAnimation;

// Function SpinePlugin.SpineWidget.SetIsTalk
// 0x0001 (0x0001 - 0x0000)
struct SpineWidget_SetIsTalk final
{
public:
	bool                                          InValue;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SpineWidget_SetIsTalk;

// Function SpinePlugin.SpineWidget.SetPlaybackTime
// 0x0008 (0x0008 - 0x0000)
struct SpineWidget_SetPlaybackTime final
{
public:
	float                                         InPlaybackTime;                                    // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCallDelegates;                                    // 0x0004(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_SpineWidget_SetPlaybackTime;

// Function SpinePlugin.SpineWidget.SetScale
// 0x0004 (0x0004 - 0x0000)
struct SpineWidget_SetScale final
{
public:
	float                                         InScale;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SpineWidget_SetScale;

// Function SpinePlugin.SpineWidget.SetScaleX
// 0x0004 (0x0004 - 0x0000)
struct SpineWidget_SetScaleX final
{
public:
	float                                         ScaleX;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SpineWidget_SetScaleX;

// Function SpinePlugin.SpineWidget.SetScaleXY
// 0x0008 (0x0008 - 0x0000)
struct SpineWidget_SetScaleXY final
{
public:
	struct FVector2D                              InValue;                                           // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SpineWidget_SetScaleXY;

// Function SpinePlugin.SpineWidget.SetScaleY
// 0x0004 (0x0004 - 0x0000)
struct SpineWidget_SetScaleY final
{
public:
	float                                         ScaleY;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SpineWidget_SetScaleY;

// Function SpinePlugin.SpineWidget.SetSkin
// 0x0018 (0x0018 - 0x0000)
struct SpineWidget_SetSkin final
{
public:
	class FString                                 SkinName;                                          // 0x0000(0x0010)(ConstParm, Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_SpineWidget_SetSkin;

// Function SpinePlugin.SpineWidget.SetSkins
// 0x0018 (0x0018 - 0x0000)
struct SpineWidget_SetSkins final
{
public:
	TArray<class FString>                         SkinNames;                                         // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_SpineWidget_SetSkins;

// Function SpinePlugin.SpineWidget.SetTimeScale
// 0x0004 (0x0004 - 0x0000)
struct SpineWidget_SetTimeScale final
{
public:
	float                                         TimeScale;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SpineWidget_SetTimeScale;

// Function SpinePlugin.SpineWidget.Tick
// 0x0008 (0x0008 - 0x0000)
struct SpineWidget_Tick final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          CallDelegates;                                     // 0x0004(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_SpineWidget_Tick;

// Function SpinePlugin.SpineWidgetSection.AddScalarParameterKey
// 0x0010 (0x0010 - 0x0000)
struct SpineWidgetSection_AddScalarParameterKey final
{
public:
	class FName                                   InParameterName;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FFrameNumber                           InTime;                                            // 0x0008(0x0004)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InValue;                                           // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SpineWidgetSection_AddScalarParameterKey;

// Function SpinePlugin.SpineWidgetSection.RemoveScalarParameter
// 0x000C (0x000C - 0x0000)
struct SpineWidgetSection_RemoveScalarParameter final
{
public:
	class FName                                   InParameterName;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_SpineWidgetSection_RemoveScalarParameter;

// Function SpinePlugin.SpineWidgetWithoutTrackData.AddAnimation
// 0x0028 (0x0028 - 0x0000)
struct SpineWidgetWithoutTrackData_AddAnimation final
{
public:
	int32                                         TrackIndex;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Rei-SdkDumper ])
	class FString                                 AnimationName;                                     // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Loop;                                              // 0x0018(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Rei-SdkDumper ])
	float                                         Delay;                                             // 0x001C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_SpineWidgetWithoutTrackData_AddAnimation;

// Function SpinePlugin.SpineWidgetWithoutTrackData.AddEmptyAnimation
// 0x0010 (0x0010 - 0x0000)
struct SpineWidgetWithoutTrackData_AddEmptyAnimation final
{
public:
