#pragma once

/*
* SDK generated by Rei-SdkDumper
* Based on Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SubstanceCore

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "SubstanceCore_structs.hpp"


namespace SDK::Params
{

// Function SubstanceCore.SubstanceUtility.AsyncRendering
// 0x0008 (0x0008 - 0x0000)
struct SubstanceUtility_AsyncRendering final
{
public:
	class USubstanceGraphInstance*                InstancesToRender;                                 // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SubstanceUtility_AsyncRendering;

// Function SubstanceCore.SubstanceUtility.CopyInputParameters
// 0x0010 (0x0010 - 0x0000)
struct SubstanceUtility_CopyInputParameters final
{
public:
	class USubstanceGraphInstance*                SourceGraphInstance;                               // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USubstanceGraphInstance*                DestGraphInstance;                                 // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SubstanceUtility_CopyInputParameters;

// Function SubstanceCore.SubstanceUtility.CreateAggregateSubstanceFactory
// 0x0038 (0x0038 - 0x0000)
struct SubstanceUtility_CreateAggregateSubstanceFactory final
{
public:
	class USubstanceInstanceFactory*              OutputFactory;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         OutputFactoryGraphIndex;                           // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Rei-SdkDumper ])
	class USubstanceInstanceFactory*              InputFactory;                                      // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         InputFactoryGraphIndex;                            // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Rei-SdkDumper ])
	TArray<struct FSubstanceConnection>           Connections;                                       // 0x0020(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	class USubstanceInstanceFactory*              ReturnValue;                                       // 0x0030(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SubstanceUtility_CreateAggregateSubstanceFactory;

// Function SubstanceCore.SubstanceUtility.CreateGraphInstance
// 0x0038 (0x0038 - 0x0000)
struct SubstanceUtility_CreateGraphInstance final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USubstanceInstanceFactory*              Factory;                                           // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         GraphDescIndex;                                    // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Rei-SdkDumper ])
	class UMaterial*                              ParentMaterial;                                    // 0x0018(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 InstanceName;                                      // 0x0020(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USubstanceGraphInstance*                ReturnValue;                                       // 0x0030(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SubstanceUtility_CreateGraphInstance;

// Function SubstanceCore.SubstanceUtility.DisableInstanceOutputs
// 0x0020 (0x0020 - 0x0000)
struct SubstanceUtility_DisableInstanceOutputs final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USubstanceGraphInstance*                GraphInstance;                                     // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<int32>                                 OutputIndices;                                     // 0x0010(0x0010)(Parm, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SubstanceUtility_DisableInstanceOutputs;

// Function SubstanceCore.SubstanceUtility.DuplicateGraphInstance
// 0x0018 (0x0018 - 0x0000)
struct SubstanceUtility_DuplicateGraphInstance final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USubstanceGraphInstance*                GraphInstance;                                     // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USubstanceGraphInstance*                ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SubstanceUtility_DuplicateGraphInstance;

// Function SubstanceCore.SubstanceUtility.EnableInstanceOutputs
// 0x0020 (0x0020 - 0x0000)
struct SubstanceUtility_EnableInstanceOutputs final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USubstanceGraphInstance*                GraphInstance;                                     // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<int32>                                 OutputIndices;                                     // 0x0010(0x0010)(Parm, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SubstanceUtility_EnableInstanceOutputs;

// Function SubstanceCore.SubstanceUtility.GetFactoryName
// 0x0018 (0x0018 - 0x0000)
struct SubstanceUtility_GetFactoryName final
{
public:
	class USubstanceGraphInstance*                GraphInstance;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SubstanceUtility_GetFactoryName;

// Function SubstanceCore.SubstanceUtility.GetGraphName
// 0x0018 (0x0018 - 0x0000)
struct SubstanceUtility_GetGraphName final
{
public:
	class USubstanceGraphInstance*                GraphInstance;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SubstanceUtility_GetGraphName;

// Function SubstanceCore.SubstanceUtility.GetSubstanceLoadingProgress
// 0x0004 (0x0004 - 0x0000)
struct SubstanceUtility_GetSubstanceLoadingProgress final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SubstanceUtility_GetSubstanceLoadingProgress;

// Function SubstanceCore.SubstanceUtility.GetSubstances
// 0x0018 (0x0018 - 0x0000)
struct SubstanceUtility_GetSubstances final
{
public:
	class UMaterialInterface*                     Material;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class USubstanceGraphInstance*>        ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SubstanceUtility_GetSubstances;

// Function SubstanceCore.SubstanceUtility.GetSubstanceTextures
// 0x0018 (0x0018 - 0x0000)
struct SubstanceUtility_GetSubstanceTextures final
{
public:
	class USubstanceGraphInstance*                GraphInstance;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UTexture2D*>                     ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SubstanceUtility_GetSubstanceTextures;

// Function SubstanceCore.SubstanceUtility.ResetInputParameters
// 0x0008 (0x0008 - 0x0000)
struct SubstanceUtility_ResetInputParameters final
{
public:
	class USubstanceGraphInstance*                GraphInstance;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SubstanceUtility_ResetInputParameters;

// Function SubstanceCore.SubstanceUtility.SetGraphInstanceOutputSize
// 0x0010 (0x0010 - 0x0000)
struct SubstanceUtility_SetGraphInstanceOutputSize final
{
public:
	class USubstanceGraphInstance*                GraphInstance;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESubstanceTextureSize                         Width;                                             // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESubstanceTextureSize                         Height;                                            // 0x0009(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_SubstanceUtility_SetGraphInstanceOutputSize;

// Function SubstanceCore.SubstanceUtility.SetGraphInstanceOutputSizeInt
// 0x0010 (0x0010 - 0x0000)
struct SubstanceUtility_SetGraphInstanceOutputSizeInt final
{
public:
	class USubstanceGraphInstance*                GraphInstance;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Width;                                             // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Height;                                            // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SubstanceUtility_SetGraphInstanceOutputSizeInt;

// Function SubstanceCore.SubstanceUtility.SyncRendering
// 0x0008 (0x0008 - 0x0000)
struct SubstanceUtility_SyncRendering final
{
public:
	class USubstanceGraphInstance*                InstancesToRender;                                 // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SubstanceUtility_SyncRendering;

// Function SubstanceCore.SubstanceGraphInstance.GetDynamicMaterialInstance
// 0x0018 (0x0018 - 0x0000)
struct SubstanceGraphInstance_GetDynamicMaterialInstance final
{
public:
	class FName                                   Name_0;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterial*                              InParentMaterial;                                  // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterialInstanceDynamic*               ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SubstanceGraphInstance_GetDynamicMaterialInstance;

// Function SubstanceCore.SubstanceGraphInstance.GetFloatInputDesc
// 0x0058 (0x0058 - 0x0000)
struct SubstanceGraphInstance_GetFloatInputDesc final
{
public:
	class FString                                 Identifier;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSubstanceFloatInputDesc               ReturnValue;                                       // 0x0010(0x0048)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SubstanceGraphInstance_GetFloatInputDesc;

// Function SubstanceCore.SubstanceGraphInstance.GetInputBool
// 0x0018 (0x0018 - 0x0000)
struct SubstanceGraphInstance_GetInputBool final
{
public:
	class FString                                 Identifier;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_SubstanceGraphInstance_GetInputBool;

// Function SubstanceCore.SubstanceGraphInstance.GetInputColor
// 0x0020 (0x0020 - 0x0000)
struct SubstanceGraphInstance_GetInputColor final
{
public:
	class FString                                 Identifier;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SubstanceGraphInstance_GetInputColor;

// Function SubstanceCore.SubstanceGraphInstance.GetInputFloat
// 0x0020 (0x0020 - 0x0000)
struct SubstanceGraphInstance_GetInputFloat final
{
public:
	class FString                                 Identifier;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<float>                                 ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SubstanceGraphInstance_GetInputFloat;

// Function SubstanceCore.SubstanceGraphInstance.GetInputInt
// 0x0020 (0x0020 - 0x0000)
struct SubstanceGraphInstance_GetInputInt final
{
public:
	class FString                                 Identifier;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<int32>                                 ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SubstanceGraphInstance_GetInputInt;

// Function SubstanceCore.SubstanceGraphInstance.GetInputNames
// 0x0010 (0x0010 - 0x0000)
struct SubstanceGraphInstance_GetInputNames final
{
public:
	TArray<class FString>                         ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SubstanceGraphInstance_GetInputNames;

// Function SubstanceCore.SubstanceGraphInstance.GetInputString
// 0x0020 (0x0020 - 0x0000)
struct SubstanceGraphInstance_GetInputString final
{
public:
	class FString                                 Identifier;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SubstanceGraphInstance_GetInputString;

// Function SubstanceCore.SubstanceGraphInstance.GetInputType
// 0x0018 (0x0018 - 0x0000)
struct SubstanceGraphInstance_GetInputType final
{
public:
	class FString                                 InputName;                                         // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESubstanceInputType                           ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_SubstanceGraphInstance_GetInputType;

// Function SubstanceCore.SubstanceGraphInstance.GetInstanceDesc
// 0x0020 (0x0020 - 0x0000)
struct SubstanceGraphInstance_GetInstanceDesc final
{
public:
	struct FSubstanceInstanceDesc                 ReturnValue;                                       // 0x0000(0x0020)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SubstanceGraphInstance_GetInstanceDesc;

// Function SubstanceCore.SubstanceGraphInstance.GetIntInputDesc
// 0x0058 (0x0058 - 0x0000)
struct SubstanceGraphInstance_GetIntInputDesc final
{
public:
	class FString                                 Identifier;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSubstanceIntInputDesc                 ReturnValue;                                       // 0x0010(0x0048)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SubstanceGraphInstance_GetIntInputDesc;

// Function SubstanceCore.SubstanceGraphInstance.SetInputBool
// 0x0018 (0x0018 - 0x0000)
struct SubstanceGraphInstance_SetInputBool final
{
public:
	class FString                                 Identifier;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Bool;                                              // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_SubstanceGraphInstance_SetInputBool;

// Function SubstanceCore.SubstanceGraphInstance.SetInputColor
// 0x0020 (0x0020 - 0x0000)
struct SubstanceGraphInstance_SetInputColor final
{
public:
	class FString                                 Identifier;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           Color;                                             // 0x0010(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SubstanceGraphInstance_SetInputColor;

// Function SubstanceCore.SubstanceGraphInstance.SetInputFloat
// 0x0020 (0x0020 - 0x0000)
struct SubstanceGraphInstance_SetInputFloat final
{
public:
	class FString                                 Identifier;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<float>                                 InputValues;                                       // 0x0010(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SubstanceGraphInstance_SetInputFloat;

// Function SubstanceCore.SubstanceGraphInstance.SetInputImg
// 0x0020 (0x0020 - 0x0000)
struct SubstanceGraphInstance_SetInputImg final
{
public:
	class FString                                 InputName;                                         // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                Value;                                             // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_SubstanceGraphInstance_SetInputImg;

// Function SubstanceCore.SubstanceGraphInstance.SetInputInt
// 0x0020 (0x0020 - 0x0000)
struct SubstanceGraphInstance_SetInputInt final
{
public:
	class FString                                 Identifier;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<int32>                                 InputValues;                                       // 0x0010(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SubstanceGraphInstance_SetInputInt;

// Function SubstanceCore.SubstanceGraphInstance.SetInputString
// 0x0020 (0x0020 - 0x0000)
struct SubstanceGraphInstance_SetInputString final
{
public:
	class FString                                 Identifier;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Value;                                             // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SubstanceGraphInstance_SetInputString;

}

