#pragma once

/*
* SDK generated by Rei-SdkDumper
* Based on Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TcpMessaging

#include "Basic.hpp"

#include "CoreUObject_classes.hpp"


namespace SDK
{

// Class TcpMessaging.TcpMessagingSettings
// 0x0030 (0x0058 - 0x0028)
class UTcpMessagingSettings final : public UObject
{
public:
	bool                                          EnableTransport;                                   // 0x0028(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Rei-SdkDumper ])
	class FString                                 ListenEndpoint;                                    // 0x0030(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<class FString>                         ConnectToEndpoints;                                // 0x0040(0x0010)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPrivate)
	int32                                         ConnectionRetryDelay;                              // 0x0050(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bStopServiceWhenAppDeactivates;                    // 0x0054(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_55[0x3];                                       // 0x0055(0x0003)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("TcpMessagingSettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"TcpMessagingSettings")
	}
	static class UTcpMessagingSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTcpMessagingSettings>();
	}
};
DUMPER7_ASSERTS_UTcpMessagingSettings;

}

