#pragma once

/*
* SDK generated by Rei-SdkDumper
* Based on Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TGameToolsRuntime

#include "Basic.hpp"

#include "TGameToolsRuntime_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function TGameToolsRuntime.DarkZoneFogData.LerpDarkZoneDataFog
// 0x00F8 (0x00F8 - 0x0000)
struct DarkZoneFogData_LerpDarkZoneDataFog final
{
public:
	struct FDarkZoneFogConfig                     A;                                                 // 0x0000(0x0050)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FDarkZoneFogConfig                     B;                                                 // 0x0050(0x0050)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	float                                         Alpha;                                             // 0x00A0(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A4[0x4];                                       // 0x00A4(0x0004)(Fixing Size After Last Property [ Rei-SdkDumper ])
	struct FDarkZoneFogConfig                     ReturnValue;                                       // 0x00A8(0x0050)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DarkZoneFogData_LerpDarkZoneDataFog;

// Function TGameToolsRuntime.DarkZoneFogData.LerpDarkZoneDataSnow
// 0x0188 (0x0188 - 0x0000)
struct DarkZoneFogData_LerpDarkZoneDataSnow final
{
public:
	struct FDarkZoneSnowConfig                    A;                                                 // 0x0000(0x0080)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FDarkZoneSnowConfig                    B;                                                 // 0x0080(0x0080)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	float                                         Alpha;                                             // 0x0100(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_104[0x4];                                      // 0x0104(0x0004)(Fixing Size After Last Property [ Rei-SdkDumper ])
	struct FDarkZoneSnowConfig                    ReturnValue;                                       // 0x0108(0x0080)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DarkZoneFogData_LerpDarkZoneDataSnow;

// Function TGameToolsRuntime.DarkZoneFogData.MarkaDataAssetDirty
// 0x0008 (0x0008 - 0x0000)
struct DarkZoneFogData_MarkaDataAssetDirty final
{
public:
	class UPrimaryDataAsset*                      DarkZoneConfig;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DarkZoneFogData_MarkaDataAssetDirty;

// Function TGameToolsRuntime.TGameTextureRuntimeLib.ComputeColorPercentage
// 0x0038 (0x0038 - 0x0000)
struct TGameTextureRuntimeLib_ComputeColorPercentage final
{
public:
	class UTextureRenderTarget2D*                 RTMask;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTextureRenderTarget2D*                 RT;                                                // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              StartPos;                                          // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              EndPos;                                            // 0x0018(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           thresholdColor;                                    // 0x0020(0x0010)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Threshold;                                         // 0x0030(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0034(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_TGameTextureRuntimeLib_ComputeColorPercentage;

// Function TGameToolsRuntime.TGameTextureRuntimeLib.NewComputeColorPercentage
// 0x0038 (0x0038 - 0x0000)
struct TGameTextureRuntimeLib_NewComputeColorPercentage final
{
public:
	class UTextureRenderTarget2D*                 RTMask;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTextureRenderTarget2D*                 RT;                                                // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              StartPos;                                          // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              EndPos;                                            // 0x0018(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           thresholdColor;                                    // 0x0020(0x0010)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Threshold;                                         // 0x0030(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0034(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_TGameTextureRuntimeLib_NewComputeColorPercentage;

}

