#pragma once

/*
* SDK generated by Rei-SdkDumper
* Based on Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TGameToolsRuntime

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "TGameToolsRuntime_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class TGameToolsRuntime.CharacterMeshData
// 0x0010 (0x0040 - 0x0030)
class UCharacterMeshData final : public UPrimaryDataAsset
{
public:
	TArray<struct FTransform>                     MeshTransform;                                     // 0x0030(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CharacterMeshData")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CharacterMeshData")
	}
	static class UCharacterMeshData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCharacterMeshData>();
	}
};
DUMPER7_ASSERTS_UCharacterMeshData;

// Class TGameToolsRuntime.DarkZoneFogData
// 0x00E8 (0x0118 - 0x0030)
class UDarkZoneFogData final : public UPrimaryDataAsset
{
public:
	class FString                                 DarkZoneFogDescribe;                               // 0x0030(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         DarkZoneFogIndex;                                  // 0x0040(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Rei-SdkDumper ])
	struct FDarkZoneFogConfig                     DarkZoneConfigFog_Main;                            // 0x0048(0x0050)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FDarkZoneSnowConfig                    DarkZoneConfigSnow_Main;                           // 0x0098(0x0080)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)

public:
	struct FDarkZoneFogConfig LerpDarkZoneDataFog(const struct FDarkZoneFogConfig& A, const struct FDarkZoneFogConfig& B, const float Alpha);
	struct FDarkZoneSnowConfig LerpDarkZoneDataSnow(const struct FDarkZoneSnowConfig& A, const struct FDarkZoneSnowConfig& B, const float Alpha);
	void MarkaDataAssetDirty(class UPrimaryDataAsset* DarkZoneConfig);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DarkZoneFogData")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DarkZoneFogData")
	}
	static class UDarkZoneFogData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDarkZoneFogData>();
	}
};
DUMPER7_ASSERTS_UDarkZoneFogData;

// Class TGameToolsRuntime.PerfabActor
// 0x0008 (0x0230 - 0x0228)
class APerfabActor final : public AActor
{
public:
	uint8                                         Pad_228[0x8];                                      // 0x0228(0x0008)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PerfabActor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PerfabActor")
	}
	static class APerfabActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<APerfabActor>();
	}
};
DUMPER7_ASSERTS_APerfabActor;

// Class TGameToolsRuntime.TGameTextureRuntimeLib
// 0x0000 (0x0028 - 0x0028)
class UTGameTextureRuntimeLib final : public UBlueprintFunctionLibrary
{
public:
	static float ComputeColorPercentage(class UTextureRenderTarget2D* RTMask, class UTextureRenderTarget2D* RT, const struct FVector2D& StartPos, const struct FVector2D& EndPos, const struct FLinearColor& thresholdColor, float Threshold);
	static float NewComputeColorPercentage(class UTextureRenderTarget2D* RTMask, class UTextureRenderTarget2D* RT, const struct FVector2D& StartPos, const struct FVector2D& EndPos, const struct FLinearColor& thresholdColor, float Threshold);
	static void StartComputeColorPercentage();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("TGameTextureRuntimeLib")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"TGameTextureRuntimeLib")
	}
	static class UTGameTextureRuntimeLib* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTGameTextureRuntimeLib>();
	}
};
DUMPER7_ASSERTS_UTGameTextureRuntimeLib;

}

