#pragma once

/*
* SDK generated by Rei-SdkDumper
* Based on Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMGSpline

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK
{

// Enum UMGSpline.EUMGSplineCoordinateSpace
// NumValues: 0x0004
enum class EUMGSplineCoordinateSpace : uint8
{
	Local                                    = 0,
	Viewport                                 = 1,
	Screen                                   = 2,
	EUMGSplineCoordinateSpace_MAX            = 3,
};

// Enum UMGSpline.EUMGSplineType
// NumValues: 0x0003
enum class EUMGSplineType : uint8
{
	Linear                                   = 0,
	Curve                                    = 1,
	EUMGSplineType_MAX                       = 2,
};

// ScriptStruct UMGSpline.UMGSplineCurves
// 0x0038 (0x0038 - 0x0000)
struct FUMGSplineCurves final
{
public:
	struct FInterpCurveVector2D                   Position;                                          // 0x0000(0x0018)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FInterpCurveFloat                      ReparamTable;                                      // 0x0018(0x0018)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint32                                        Version;                                           // 0x0030(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReparamStepsPerSegment;                            // 0x0034(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FUMGSplineCurves;

// ScriptStruct UMGSpline.UMGSplineDebugInfo
// 0x0014 (0x0014 - 0x0000)
struct FUMGSplineDebugInfo final
{
public:
	bool                                          bDrawWidgetBoarder;                                // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Rei-SdkDumper ])
	struct FLinearColor                           BoarderColor;                                      // 0x0004(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FUMGSplineDebugInfo;

// ScriptStruct UMGSpline.UMGSplinePoint
// 0x0010 (0x0010 - 0x0000)
struct FUMGSplinePoint final
{
public:
	struct FVector2D                              Location;                                          // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              Direction;                                         // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FUMGSplinePoint;

// ScriptStruct UMGSpline.UMGSplineInfo
// 0x00C0 (0x00C0 - 0x0000)
struct FUMGSplineInfo final
{
public:
	EUMGSplineType                                SplineType;                                        // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Rei-SdkDumper ])
	float                                         Thickness;                                         // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FUMGSplinePoint>                Points;                                            // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, Interp, NativeAccessSpecifierPublic)
	bool                                          bClosedLoop;                                       // 0x0018(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Rei-SdkDumper ])
	struct FLinearColor                           TintColor;                                         // 0x001C(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          BuildCustomVerts;                                  // 0x002C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Rei-SdkDumper ])
	struct FSlateBrush                            CustomVertsBrush;                                  // 0x0030(0x0088)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	float                                         CustomVertsVCoordScale;                            // 0x00B8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_BC[0x4];                                       // 0x00BC(0x0004)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_FUMGSplineInfo;

}

