#pragma once

/*
* SDK generated by Rei-SdkDumper
* Based on Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UniversalCameraPlugin

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "UniversalCameraPlugin_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function UniversalCameraPlugin.AsyncNode.CameraTravel
// 0x0098 (0x0098 - 0x0000)
struct AsyncNode_CameraTravel final
{
public:
	class AUniversalCamera*                       UniversalCamera;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FTargetSettings                        TargetSettings;                                    // 0x0008(0x0020)(Parm, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FTargetVector                          LocationSettings;                                  // 0x0028(0x0020)(Parm, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FOffsetSettings                        OffsetSettings;                                    // 0x0048(0x0010)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	struct FTargetFloat                           YawSettings;                                       // 0x0058(0x0008)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	struct FTargetFloat                           PitchSettings;                                     // 0x0060(0x0008)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	struct FTargetFloat                           RollSettings;                                      // 0x0068(0x0008)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	struct FTargetFloat                           ZoomSettings;                                      // 0x0070(0x0008)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	class UCurveFloat*                            Curve;                                             // 0x0078(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FTravelSpeedSettings                   SpeedSettings;                                     // 0x0080(0x000C)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          LockAllMovement;                                   // 0x008C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IgnoreLag;                                         // 0x008D(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IgnoreRestrictions;                                // 0x008E(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8F[0x1];                                       // 0x008F(0x0001)(Fixing Size After Last Property [ Rei-SdkDumper ])
	class UAsyncNode*                             ReturnValue;                                       // 0x0090(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AsyncNode_CameraTravel;

// Function UniversalCameraPlugin.AsyncNode.UseActorLocation
// 0x0020 (0x0020 - 0x0000)
struct AsyncNode_UseActorLocation final
{
public:
	struct FTargetVector                          ReturnValue;                                       // 0x0000(0x0020)(Parm, OutParm, ReturnParm, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AsyncNode_UseActorLocation;

// Function UniversalCameraPlugin.AsyncNode.UseActorValue
// 0x0008 (0x0008 - 0x0000)
struct AsyncNode_UseActorValue final
{
public:
	struct FTargetFloat                           ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AsyncNode_UseActorValue;

// Function UniversalCameraPlugin.AsyncNode.UseCustomLocation
// 0x0030 (0x0030 - 0x0000)
struct AsyncNode_UseCustomLocation final
{
public:
	struct FVector                                Location;                                          // 0x0000(0x000C)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Rei-SdkDumper ])
	struct FTargetVector                          ReturnValue;                                       // 0x0010(0x0020)(Parm, OutParm, ReturnParm, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AsyncNode_UseCustomLocation;

// Function UniversalCameraPlugin.AsyncNode.UseCustomValue
// 0x000C (0x000C - 0x0000)
struct AsyncNode_UseCustomValue final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FTargetFloat                           ReturnValue;                                       // 0x0004(0x0008)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AsyncNode_UseCustomValue;

// Function UniversalCameraPlugin.AsyncNode.UseDuration
// 0x0010 (0x0010 - 0x0000)
struct AsyncNode_UseDuration final
{
public:
	float                                         Duration;                                          // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FTravelSpeedSettings                   ReturnValue;                                       // 0x0004(0x000C)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AsyncNode_UseDuration;

// Function UniversalCameraPlugin.AsyncNode.UseSceneComponentLocation
// 0x0020 (0x0020 - 0x0000)
struct AsyncNode_UseSceneComponentLocation final
{
public:
	struct FTargetVector                          ReturnValue;                                       // 0x0000(0x0020)(Parm, OutParm, ReturnParm, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AsyncNode_UseSceneComponentLocation;

// Function UniversalCameraPlugin.AsyncNode.UseSceneComponentValue
// 0x0008 (0x0008 - 0x0000)
struct AsyncNode_UseSceneComponentValue final
{
public:
	struct FTargetFloat                           ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AsyncNode_UseSceneComponentValue;

// Function UniversalCameraPlugin.AsyncNode.UseSocketLocation
// 0x0020 (0x0020 - 0x0000)
struct AsyncNode_UseSocketLocation final
{
public:
	struct FTargetVector                          ReturnValue;                                       // 0x0000(0x0020)(Parm, OutParm, ReturnParm, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AsyncNode_UseSocketLocation;

// Function UniversalCameraPlugin.AsyncNode.UseSocketOffset
// 0x001C (0x001C - 0x0000)
struct AsyncNode_UseSocketOffset final
{
public:
	struct FVector                                SocketOffset;                                      // 0x0000(0x000C)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FOffsetSettings                        ReturnValue;                                       // 0x000C(0x0010)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AsyncNode_UseSocketOffset;

// Function UniversalCameraPlugin.AsyncNode.UseSocketValue
// 0x0008 (0x0008 - 0x0000)
struct AsyncNode_UseSocketValue final
{
public:
	struct FTargetFloat                           ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AsyncNode_UseSocketValue;

// Function UniversalCameraPlugin.AsyncNode.UseSpeed
// 0x0010 (0x0010 - 0x0000)
struct AsyncNode_UseSpeed final
{
public:
	float                                         Speed;                                             // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FTravelSpeedSettings                   ReturnValue;                                       // 0x0004(0x000C)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AsyncNode_UseSpeed;

// Function UniversalCameraPlugin.AsyncNode.UseSpline
// 0x0028 (0x0028 - 0x0000)
struct AsyncNode_UseSpline final
{
public:
	class USplineComponent*                       SplineComponent;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FTargetVector                          ReturnValue;                                       // 0x0008(0x0020)(Parm, OutParm, ReturnParm, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AsyncNode_UseSpline;

// Function UniversalCameraPlugin.AsyncNode.UseTargetOffset
// 0x001C (0x001C - 0x0000)
struct AsyncNode_UseTargetOffset final
{
public:
	struct FVector                                TargetOffset;                                      // 0x0000(0x000C)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FOffsetSettings                        ReturnValue;                                       // 0x000C(0x0010)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AsyncNode_UseTargetOffset;

// Function UniversalCameraPlugin.PlaceholderCamera.GetInfos
// 0x0018 (0x0018 - 0x0000)
struct PlaceholderCamera_GetInfos final
{
public:
	struct FPlaceholderCameraInfos                ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PlaceholderCamera_GetInfos;

// Function UniversalCameraPlugin.PlaceholderCamera.GetZoom
// 0x0004 (0x0004 - 0x0000)
struct PlaceholderCamera_GetZoom final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PlaceholderCamera_GetZoom;

// Function UniversalCameraPlugin.UniversalCamera.GetActorsLocation2D
// 0x0020 (0x0020 - 0x0000)
struct UniversalCamera_GetActorsLocation2D final
{
public:
	TArray<class AActor*>                         Actors;                                            // 0x0000(0x0010)(Parm, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FVector2D>                      ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UniversalCamera_GetActorsLocation2D;

// Function UniversalCameraPlugin.UniversalCamera.GetAlternativeForwardVector
// 0x0018 (0x0018 - 0x0000)
struct UniversalCamera_GetAlternativeForwardVector final
{
public:
	struct FRotator                               Rotation;                                          // 0x0000(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector                                ReturnValue;                                       // 0x000C(0x000C)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UniversalCamera_GetAlternativeForwardVector;

// Function UniversalCameraPlugin.UniversalCamera.GetAlternativeRightVector
// 0x0018 (0x0018 - 0x0000)
struct UniversalCamera_GetAlternativeRightVector final
{
public:
	struct FRotator                               Rotation;                                          // 0x0000(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector                                ReturnValue;                                       // 0x000C(0x000C)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UniversalCamera_GetAlternativeRightVector;

// Function UniversalCameraPlugin.UniversalCamera.GetAlternativeUpVector
// 0x0018 (0x0018 - 0x0000)
struct UniversalCamera_GetAlternativeUpVector final
{
public:
	struct FRotator                               Rotation;                                          // 0x0000(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector                                ReturnValue;                                       // 0x000C(0x000C)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UniversalCamera_GetAlternativeUpVector;

// Function UniversalCameraPlugin.UniversalCamera.GetImpactPointUnderCursor
// 0x0018 (0x0018 - 0x0000)
struct UniversalCamera_GetImpactPointUnderCursor final
{
public:
	class APlayerController*                      PlayerController;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ECollisionChannel                             TraceChannel;                                      // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          TraceComplex;                                      // 0x0009(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          DidHit;                                            // 0x000A(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B[0x1];                                        // 0x000B(0x0001)(Fixing Size After Last Property [ Rei-SdkDumper ])
	struct FVector                                ReturnValue;                                       // 0x000C(0x000C)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UniversalCamera_GetImpactPointUnderCursor;

// Function UniversalCameraPlugin.UniversalCamera.GetMousePositionRatio
// 0x0018 (0x0018 - 0x0000)
struct UniversalCamera_GetMousePositionRatio final
{
public:
	class APlayerController*                      PlayerController;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              RawPosition;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UniversalCamera_GetMousePositionRatio;

// Function UniversalCameraPlugin.UniversalCamera.UseActor
// 0x0030 (0x0030 - 0x0000)
struct UniversalCamera_UseActor final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FTargetSettings_WithTemplates          ReturnValue;                                       // 0x0008(0x0028)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UniversalCamera_UseActor;

// Function UniversalCameraPlugin.UniversalCamera.UseSceneComponent
// 0x0030 (0x0030 - 0x0000)
struct UniversalCamera_UseSceneComponent final
{
public:
	class USceneComponent*                        SceneComponent;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FTargetSettings_WithTemplates          ReturnValue;                                       // 0x0008(0x0028)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UniversalCamera_UseSceneComponent;

// Function UniversalCameraPlugin.UniversalCamera.UseSocket
// 0x0038 (0x0038 - 0x0000)
struct UniversalCamera_UseSocket final
{
public:
	class UMeshComponent*                         MeshComponent;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   Socket;                                            // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FTargetSettings_WithTemplates          ReturnValue;                                       // 0x0010(0x0028)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UniversalCamera_UseSocket;

// Function UniversalCameraPlugin.UniversalCamera.AreFeaturesEnabled
// 0x0008 (0x0008 - 0x0000)
struct UniversalCamera_AreFeaturesEnabled final
{
public:
	int32                                         FeaturesToTest;                                    // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_UniversalCamera_AreFeaturesEnabled;

// Function UniversalCameraPlugin.UniversalCamera.DisableFeatures
// 0x0004 (0x0004 - 0x0000)
struct UniversalCamera_DisableFeatures final
{
public:
	int32                                         FeaturesToDisable;                                 // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UniversalCamera_DisableFeatures;

// Function UniversalCameraPlugin.UniversalCamera.EdgeScrollingTick
// 0x0014 (0x0014 - 0x0000)
struct UniversalCamera_EdgeScrollingTick final
{
public:
	float                                         RightAxis;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ForwardAxis;                                       // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RightMultiplier;                                   // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ForwardMultiplier;                                 // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bTargetOffset;                                     // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSocketOffset;                                     // 0x0011(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_12[0x2];                                       // 0x0012(0x0002)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_UniversalCamera_EdgeScrollingTick;

// Function UniversalCameraPlugin.UniversalCamera.EnableFeatures
// 0x0004 (0x0004 - 0x0000)
struct UniversalCamera_EnableFeatures final
{
public:
	int32                                         FeaturesToEnable;                                  // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UniversalCamera_EnableFeatures;

// Function UniversalCameraPlugin.UniversalCamera.EndTravelTask
// 0x0001 (0x0001 - 0x0000)
struct UniversalCamera_EndTravelTask final
{
public:
	bool                                          Abort;                                             // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UniversalCamera_EndTravelTask;

// Function UniversalCameraPlugin.UniversalCamera.FollowTarget
// 0x0030 (0x0030 - 0x0000)
struct UniversalCamera_FollowTarget final
{
public:
	struct FTargetSettings_WithTemplates          TargetSettings;                                    // 0x0000(0x0028)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	struct FConstrainVector2                      FollowAxis;                                        // 0x0028(0x0003)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	struct FBoolRotation                          FollowRotations;                                   // 0x002B(0x0003)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          IgnoreRestrictions;                                // 0x002E(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ResetOffsetIfPrematurelyEnded;                     // 0x002F(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UniversalCamera_FollowTarget;

// Function UniversalCameraPlugin.UniversalCamera.GetActorFocusLocation
// 0x0020 (0x0020 - 0x0000)
struct UniversalCamera_GetActorFocusLocation final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Location;                                          // 0x0008(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         IdealZoom;                                         // 0x0014(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_UniversalCamera_GetActorFocusLocation;

// Function UniversalCameraPlugin.UniversalCamera.GetCameraComponent
// 0x0008 (0x0008 - 0x0000)
struct UniversalCamera_GetCameraComponent final
{
public:
	class UCameraComponent*                       ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UniversalCamera_GetCameraComponent;

// Function UniversalCameraPlugin.UniversalCamera.GetClampedLocation
// 0x0018 (0x0018 - 0x0000)
struct UniversalCamera_GetClampedLocation final
{
public:
	struct FVector                                Location;                                          // 0x0000(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                ReturnValue;                                       // 0x000C(0x000C)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UniversalCamera_GetClampedLocation;

// Function UniversalCameraPlugin.UniversalCamera.GetClampedOffset
// 0x0018 (0x0018 - 0x0000)
struct UniversalCamera_GetClampedOffset final
{
public:
	struct FVector                                Offset;                                            // 0x0000(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                ReturnValue;                                       // 0x000C(0x000C)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UniversalCamera_GetClampedOffset;

// Function UniversalCameraPlugin.UniversalCamera.GetClampedPitch
// 0x0008 (0x0008 - 0x0000)
struct UniversalCamera_GetClampedPitch final
{
public:
	float                                         Pitch;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UniversalCamera_GetClampedPitch;

// Function UniversalCameraPlugin.UniversalCamera.GetClampedRoll
// 0x0008 (0x0008 - 0x0000)
struct UniversalCamera_GetClampedRoll final
{
public:
	float                                         Roll;                                              // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UniversalCamera_GetClampedRoll;

// Function UniversalCameraPlugin.UniversalCamera.GetClampedYaw
// 0x0008 (0x0008 - 0x0000)
struct UniversalCamera_GetClampedYaw final
{
public:
	float                                         Yaw;                                               // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UniversalCamera_GetClampedYaw;

// Function UniversalCameraPlugin.UniversalCamera.GetClampedZoom
// 0x0008 (0x0008 - 0x0000)
struct UniversalCamera_GetClampedZoom final
{
public:
	float                                         Zoom;                                              // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UniversalCamera_GetClampedZoom;

// Function UniversalCameraPlugin.UniversalCamera.GetCorrectedDestinationFromOriginCollisions
// 0x0028 (0x0028 - 0x0000)
struct UniversalCamera_GetCorrectedDestinationFromOriginCollisions final
{
public:
	struct FVector                                Location;                                          // 0x0000(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Destination;                                       // 0x000C(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          DidHit;                                            // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Rei-SdkDumper ])
	struct FVector                                ReturnValue;                                       // 0x001C(0x000C)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UniversalCamera_GetCorrectedDestinationFromOriginCollisions;

// Function UniversalCameraPlugin.UniversalCamera.GetCorrectedDestinationFromRestrictions
// 0x0018 (0x0018 - 0x0000)
struct UniversalCamera_GetCorrectedDestinationFromRestrictions final
{
public:
	struct FVector                                Destination;                                       // 0x0000(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                ReturnValue;                                       // 0x000C(0x000C)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UniversalCamera_GetCorrectedDestinationFromRestrictions;

// Function UniversalCameraPlugin.UniversalCamera.GetMovementScaling
// 0x0004 (0x0004 - 0x0000)
struct UniversalCamera_GetMovementScaling final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UniversalCamera_GetMovementScaling;

// Function UniversalCameraPlugin.UniversalCamera.GetPositionSaveFormat
// 0x0040 (0x0040 - 0x0000)
struct UniversalCamera_GetPositionSaveFormat final
{
public:
	struct FUniversalCameraPositionSaveFormat     ReturnValue;                                       // 0x0000(0x0040)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UniversalCamera_GetPositionSaveFormat;

// Function UniversalCameraPlugin.UniversalCamera.GetSettingsSaveFormat
// 0x0010 (0x0010 - 0x0000)
struct UniversalCamera_GetSettingsSaveFormat final
{
public:
	TArray<uint8>                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UniversalCamera_GetSettingsSaveFormat;

// Function UniversalCameraPlugin.UniversalCamera.GetTerrainHeightAdaptationValue
// 0x0008 (0x0008 - 0x0000)
struct UniversalCamera_GetTerrainHeightAdaptationValue final
{
public:
	bool                                          IsValid;                                           // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Rei-SdkDumper ])
	float                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UniversalCamera_GetTerrainHeightAdaptationValue;

// Function UniversalCameraPlugin.UniversalCamera.GetZoomInScaling
// 0x0004 (0x0004 - 0x0000)
struct UniversalCamera_GetZoomInScaling final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UniversalCamera_GetZoomInScaling;

// Function UniversalCameraPlugin.UniversalCamera.IsFollowingAnyActor
// 0x0001 (0x0001 - 0x0000)
struct UniversalCamera_IsFollowingAnyActor final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UniversalCamera_IsFollowingAnyActor;

// Function UniversalCameraPlugin.UniversalCamera.Lag_GetTickDesiredHeight
// 0x0008 (0x0008 - 0x0000)
struct UniversalCamera_Lag_GetTickDesiredHeight final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UniversalCamera_Lag_GetTickDesiredHeight;

// Function UniversalCameraPlugin.UniversalCamera.Lag_GetTickDesiredLocation
// 0x0010 (0x0010 - 0x0000)
struct UniversalCamera_Lag_GetTickDesiredLocation final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                ReturnValue;                                       // 0x0004(0x000C)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UniversalCamera_Lag_GetTickDesiredLocation;

// Function UniversalCameraPlugin.UniversalCamera.Lag_GetTickDesiredRotation
// 0x0010 (0x0010 - 0x0000)
struct UniversalCamera_Lag_GetTickDesiredRotation final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               ReturnValue;                                       // 0x0004(0x000C)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UniversalCamera_Lag_GetTickDesiredRotation;

// Function UniversalCameraPlugin.UniversalCamera.Lag_GetTickDesiredSocketOffset
// 0x0010 (0x0010 - 0x0000)
struct UniversalCamera_Lag_GetTickDesiredSocketOffset final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                ReturnValue;                                       // 0x0004(0x000C)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UniversalCamera_Lag_GetTickDesiredSocketOffset;

// Function UniversalCameraPlugin.UniversalCamera.Lag_GetTickDesiredTargetOffset
// 0x0010 (0x0010 - 0x0000)
struct UniversalCamera_Lag_GetTickDesiredTargetOffset final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                ReturnValue;                                       // 0x0004(0x000C)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UniversalCamera_Lag_GetTickDesiredTargetOffset;

// Function UniversalCameraPlugin.UniversalCamera.Lag_GetTickDesiredZoom
// 0x0008 (0x0008 - 0x0000)
struct UniversalCamera_Lag_GetTickDesiredZoom final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UniversalCamera_Lag_GetTickDesiredZoom;

// Function UniversalCameraPlugin.UniversalCamera.LoadPositionSaveFormat
// 0x0040 (0x0040 - 0x0000)
struct UniversalCamera_LoadPositionSaveFormat final
{
public:
	struct FUniversalCameraPositionSaveFormat     PositionSaveFormat;                                // 0x0000(0x0040)(Parm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UniversalCamera_LoadPositionSaveFormat;

// Function UniversalCameraPlugin.UniversalCamera.LoadSettingsSaveFormat
// 0x0010 (0x0010 - 0x0000)
struct UniversalCamera_LoadSettingsSaveFormat final
{
public:
	TArray<uint8>                                 SettingsSaveFormat;                                // 0x0000(0x0010)(Parm, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UniversalCamera_LoadSettingsSaveFormat;

// Function UniversalCameraPlugin.UniversalCamera.Move
// 0x0014 (0x0014 - 0x0000)
struct UniversalCamera_Move final
{
public:
	float                                         ForwardAxis;                                       // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RightAxis;                                         // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         UpAxis;                                            // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Multiplier;                                        // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          NormalizeDirection;                                // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          MoveTargetOffset;                                  // 0x0011(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          MoveSocketOffset;                                  // 0x0012(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_13[0x1];                                       // 0x0013(0x0001)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_UniversalCamera_Move;

// Function UniversalCameraPlugin.UniversalCamera.MoveForward
// 0x000C (0x000C - 0x0000)
struct UniversalCamera_MoveForward final
{
public:
	float                                         AxisValue;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Multiplier;                                        // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          MoveTargetOffset;                                  // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          MoveSocketOffset;                                  // 0x0009(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A[0x2];                                        // 0x000A(0x0002)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_UniversalCamera_MoveForward;

// Function UniversalCameraPlugin.UniversalCamera.MoveRight
// 0x000C (0x000C - 0x0000)
struct UniversalCamera_MoveRight final
{
public:
	float                                         AxisValue;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Multiplier;                                        // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          MoveTargetOffset;                                  // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          MoveSocketOffset;                                  // 0x0009(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A[0x2];                                        // 0x000A(0x0002)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_UniversalCamera_MoveRight;

// Function UniversalCameraPlugin.UniversalCamera.MoveUp
// 0x000C (0x000C - 0x0000)
struct UniversalCamera_MoveUp final
{
public:
	float                                         AxisValue;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Multiplier;                                        // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          MoveTargetOffset;                                  // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          MoveSocketOffset;                                  // 0x0009(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A[0x2];                                        // 0x000A(0x0002)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_UniversalCamera_MoveUp;

// Function UniversalCameraPlugin.UniversalCamera.OnBeginScreenSliding
// 0x0008 (0x0008 - 0x0000)
struct UniversalCamera_OnBeginScreenSliding final
{
public:
	struct FVector2D                              OriginPosition;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UniversalCamera_OnBeginScreenSliding;

// Function UniversalCameraPlugin.UniversalCamera.OnStoppedFollowing
// 0x0001 (0x0001 - 0x0000)
struct UniversalCamera_OnStoppedFollowing final
{
public:
	EStopFollowingReason                          Reason;                                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UniversalCamera_OnStoppedFollowing;

// Function UniversalCameraPlugin.UniversalCamera.OnUpdateEdgeScrolling
// 0x000C (0x000C - 0x0000)
struct UniversalCamera_OnUpdateEdgeScrolling final
{
public:
	ESimplifiedMovementDirection                  SimplifiedDirection;                               // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Rei-SdkDumper ])
	struct FVector2D                              MovementDirection;                                 // 0x0004(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UniversalCamera_OnUpdateEdgeScrolling;

// Function UniversalCameraPlugin.UniversalCamera.OnUpdateMouseDrag
// 0x000C (0x000C - 0x0000)
struct UniversalCamera_OnUpdateMouseDrag final
{
public:
	struct FVector                                Direction;                                         // 0x0000(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UniversalCamera_OnUpdateMouseDrag;

// Function UniversalCameraPlugin.UniversalCamera.OnUpdateScreenSliding
// 0x0008 (0x0008 - 0x0000)
struct UniversalCamera_OnUpdateScreenSliding final
{
public:
	struct FVector2D                              Direction;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UniversalCamera_OnUpdateScreenSliding;

// Function UniversalCameraPlugin.UniversalCamera.QuickLoadPosition
// 0x0018 (0x0018 - 0x0000)
struct UniversalCamera_QuickLoadPosition final
{
public:
	class FString                                 SlotName;                                          // 0x0000(0x0010)(ConstParm, Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         UserIndex;                                         // 0x0010(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_UniversalCamera_QuickLoadPosition;

// Function UniversalCameraPlugin.UniversalCamera.QuickLoadSettings
// 0x0018 (0x0018 - 0x0000)
struct UniversalCamera_QuickLoadSettings final
{
public:
	class FString                                 SlotName;                                          // 0x0000(0x0010)(ConstParm, Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         UserIndex;                                         // 0x0010(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_UniversalCamera_QuickLoadSettings;

// Function UniversalCameraPlugin.UniversalCamera.QuickSavePosition
// 0x0058 (0x0058 - 0x0000)
struct UniversalCamera_QuickSavePosition final
{
public:
	struct FUniversalCameraPositionSaveFormat     PositionSaveFormat;                                // 0x0000(0x0040)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	class FString                                 SlotName;                                          // 0x0040(0x0010)(ConstParm, Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         UserIndex;                                         // 0x0050(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_UniversalCamera_QuickSavePosition;

// Function UniversalCameraPlugin.UniversalCamera.QuickSaveSettings
// 0x0028 (0x0028 - 0x0000)
struct UniversalCamera_QuickSaveSettings final
{
public:
	TArray<uint8>                                 SettingsSaveFormat;                                // 0x0000(0x0010)(Parm, ZeroConstructor, NativeAccessSpecifierPublic)
	class FString                                 SlotName;                                          // 0x0010(0x0010)(ConstParm, Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         UserIndex;                                         // 0x0020(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_UniversalCamera_QuickSaveSettings;

// Function UniversalCameraPlugin.UniversalCamera.Rotate
// 0x0014 (0x0014 - 0x0000)
struct UniversalCamera_Rotate final
{
public:
	float                                         YawAxis;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PitchAxis;                                         // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RollAxis;                                          // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Multiplier;                                        // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          RotateOffset;                                      // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_UniversalCamera_Rotate;

// Function UniversalCameraPlugin.UniversalCamera.RotatePitch
// 0x000C (0x000C - 0x0000)
struct UniversalCamera_RotatePitch final
{
public:
	float                                         AxisValue;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Multiplier;                                        // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          RotateOffset;                                      // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_UniversalCamera_RotatePitch;

// Function UniversalCameraPlugin.UniversalCamera.RotatePitchAroundPivot
// 0x0018 (0x0018 - 0x0000)
struct UniversalCamera_RotatePitchAroundPivot final
{
public:
	struct FVector                                Pivot;                                             // 0x0000(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AxisValue;                                         // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Multiplier;                                        // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          LockZAxis;                                         // 0x0014(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_UniversalCamera_RotatePitchAroundPivot;

// Function UniversalCameraPlugin.UniversalCamera.RotateRoll
// 0x000C (0x000C - 0x0000)
struct UniversalCamera_RotateRoll final
{
public:
	float                                         AxisValue;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Multiplier;                                        // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          RotateOffset;                                      // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_UniversalCamera_RotateRoll;

// Function UniversalCameraPlugin.UniversalCamera.RotateYaw
// 0x000C (0x000C - 0x0000)
struct UniversalCamera_RotateYaw final
{
public:
	float                                         AxisValue;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Multiplier;                                        // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          RotateOffset;                                      // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_UniversalCamera_RotateYaw;

// Function UniversalCameraPlugin.UniversalCamera.RotateYawAroundPivot
// 0x0014 (0x0014 - 0x0000)
struct UniversalCamera_RotateYawAroundPivot final
{
public:
	struct FVector                                Pivot;                                             // 0x0000(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AxisValue;                                         // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Multiplier;                                        // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UniversalCamera_RotateYawAroundPivot;

// Function UniversalCameraPlugin.UniversalCamera.SetConstrainDots
// 0x0010 (0x0010 - 0x0000)
struct UniversalCamera_SetConstrainDots final
{
public:
	TArray<struct FVector2D>                      Dots;                                              // 0x0000(0x0010)(Parm, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UniversalCamera_SetConstrainDots;

// Function UniversalCameraPlugin.UniversalCamera.SetDesiredCircleLimit
// 0x0004 (0x0004 - 0x0000)
struct UniversalCamera_SetDesiredCircleLimit final
{
public:
	float                                         RotationRadiusAngle;                               // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UniversalCamera_SetDesiredCircleLimit;

// Function UniversalCameraPlugin.UniversalCamera.SetDesiredFOV
// 0x0004 (0x0004 - 0x0000)
struct UniversalCamera_SetDesiredFOV final
{
public:
	float                                         NewFOV;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UniversalCamera_SetDesiredFOV;

// Function UniversalCameraPlugin.UniversalCamera.SetDesiredLocation
// 0x0010 (0x0010 - 0x0000)
struct UniversalCamera_SetDesiredLocation final
{
public:
	struct FVector                                NewLocation;                                       // 0x0000(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IgnoreLag;                                         // 0x000C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IgnoreRestrictions;                                // 0x000D(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
