#pragma once

/*
* SDK generated by Rei-SdkDumper
* Based on Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UniversalCameraPlugin

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// Enum UniversalCameraPlugin.ETargetMod
// NumValues: 0x0007
enum class ETargetMod : uint8
{
	TargetMod_None                           = 0,
	TargetMod_CustomValue                    = 1,
	TargetMod_Spline                         = 2,
	TargetMod_Actor                          = 3,
	TargetMod_Socket                         = 4,
	TargetMod_SceneComponent                 = 5,
	TargetMod_MAX                            = 6,
};

// Enum UniversalCameraPlugin.ERotationLimitMode
// NumValues: 0x0003
enum class ERotationLimitMode : uint8
{
	Circle                                   = 0,
	AxisClamp                                = 1,
	ERotationLimitMode_MAX                   = 2,
};

// Enum UniversalCameraPlugin.EEnabledFeatures
// NumValues: 0x0010
enum class EEnabledFeatures : uint16
{
	None                                     = 0,
	Movement                                 = 1,
	Rotation                                 = 2,
	Zoom                                     = 4,
	EdgeScrolling                            = 8,
	ScreenSliding                            = 16,
	OriginCollisions                         = 32,
	SpringArmCollisions                      = 64,
	TerrainHeightAdaptation                  = 128,
	LagMovement                              = 256,
	LagOffset                                = 512,
	LagRotation                              = 1024,
	LagZoom                                  = 2048,
	FollowTarget                             = 4096,
	PreciseMouseDrag                         = 8192,
	EEnabledFeatures_MAX                     = 8193,
};

// Enum UniversalCameraPlugin.EPreciseMouseDragMode
// NumValues: 0x0003
enum class EPreciseMouseDragMode : uint8
{
	Plane                                    = 0,
	TraceToGround                            = 1,
	EPreciseMouseDragMode_MAX                = 2,
};

// Enum UniversalCameraPlugin.EStopFollowingReason
// NumValues: 0x0004
enum class EStopFollowingReason : uint8
{
	StopFollowingReason_Manual               = 0,
	StopFollowingReason_InvalidTarget        = 1,
	StopFollowingReason_DisabledFeature      = 2,
	StopFollowingReason_MAX                  = 3,
};

// Enum UniversalCameraPlugin.ELocationConstrainType
// NumValues: 0x0004
enum class ELocationConstrainType : uint8
{
	NoConstrain                              = 0,
	Sphere                                   = 1,
	Raw                                      = 2,
	ELocationConstrainType_MAX               = 3,
};

// Enum UniversalCameraPlugin.EConstrainType
// NumValues: 0x0004
enum class EConstrainType : uint8
{
	NoConstrain                              = 0,
	MaxDistance                              = 1,
	CustomConstrain                          = 2,
	EConstrainType_MAX                       = 3,
};

// Enum UniversalCameraPlugin.EScreenSlidingType
// NumValues: 0x0008
enum class EScreenSlidingType : uint8
{
	ScreenSliding_None                       = 0,
	SlideCamera                              = 1,
	SlideTargetOffset                        = 2,
	SlideSocketOffset                        = 3,
	SlideYaw                                 = 4,
	SlidePitch                               = 5,
	SlideYawAndPitch                         = 6,
	EScreenSlidingType_MAX                   = 7,
};

// Enum UniversalCameraPlugin.ESimplifiedMovementDirection
// NumValues: 0x000A
enum class ESimplifiedMovementDirection : uint8
{
	MovementDirection_None                   = 0,
	Direction_RightBackward                  = 1,
	Direction_Right                          = 2,
	Direction_RightForward                   = 3,
	Direction_Forward                        = 4,
	Direction_LeftForward                    = 5,
	Direction_Left                           = 6,
	Direction_LeftBackward                   = 7,
	Direction_Backward                       = 8,
	ESimplifiedMovementDirection_MAX         = 9,
};

// Enum UniversalCameraPlugin.EEdgeScrollMode
// NumValues: 0x0004
enum class EEdgeScrollMode : uint8
{
	ScrollMovement                           = 0,
	ScrollTargetOffset                       = 1,
	ScrollSocketOffset                       = 2,
	EEdgeScrollMode_MAX                      = 3,
};

// ScriptStruct UniversalCameraPlugin.TargetSettings_WithTemplates
// 0x0028 (0x0028 - 0x0000)
struct alignas(0x08) FTargetSettings_WithTemplates final
{
public:
	uint8                                         Pad_0[0x28];                                       // 0x0000(0x0028)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_FTargetSettings_WithTemplates;

// ScriptStruct UniversalCameraPlugin.TravelSpeedSettings
// 0x000C (0x000C - 0x0000)
struct FTravelSpeedSettings final
{
public:
	bool                                          UseSpeed;                                          // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Rei-SdkDumper ])
	float                                         Speed;                                             // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Duration;                                          // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FTravelSpeedSettings;

// ScriptStruct UniversalCameraPlugin.TargetFloat
// 0x0008 (0x0008 - 0x0000)
struct FTargetFloat final
{
public:
	ETargetMod                                    TargetMod;                                         // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Rei-SdkDumper ])
	float                                         FloatValue;                                        // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FTargetFloat;

// ScriptStruct UniversalCameraPlugin.OffsetSettings
// 0x0010 (0x0010 - 0x0000)
struct FOffsetSettings final
{
public:
	int32                                         OffsetMod;                                         // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                OffsetValue;                                       // 0x0004(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FOffsetSettings;

// ScriptStruct UniversalCameraPlugin.TargetVector
// 0x0020 (0x0020 - 0x0000)
struct FTargetVector final
{
public:
	ETargetMod                                    TargetMod;                                         // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Rei-SdkDumper ])
	class USplineComponent*                       SplineComponent;                                   // 0x0008(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                VectorValue;                                       // 0x0010(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_FTargetVector;

// ScriptStruct UniversalCameraPlugin.TargetSettings
// 0x0020 (0x0020 - 0x0000)
struct FTargetSettings final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USceneComponent*                        SceneComponent;                                    // 0x0008(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMeshComponent*                         Mesh;                                              // 0x0010(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   Socket;                                            // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FTargetSettings;

// ScriptStruct UniversalCameraPlugin.PlaceholderCameraInfos
// 0x0018 (0x0018 - 0x0000)
struct FPlaceholderCameraInfos final
{
public:
	struct FVector                                Location;                                          // 0x0000(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Yaw;                                               // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Pitch;                                             // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Zoom;                                              // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FPlaceholderCameraInfos;

// ScriptStruct UniversalCameraPlugin.UniversalCameraPositionSaveFormat
// 0x0040 (0x0040 - 0x0000)
struct FUniversalCameraPositionSaveFormat final
{
public:
	struct FVector                                DesiredLocation;                                   // 0x0000(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                DesiredSocketOffset;                               // 0x000C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                DesiredTargetOffset;                               // 0x0018(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               DesiredRotation;                                   // 0x0024(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FRotator                               DesiredRotationOffset;                             // 0x0030(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	float                                         DesiredZoom;                                       // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FUniversalCameraPositionSaveFormat;

// ScriptStruct UniversalCameraPlugin.BoolRotation
// 0x0003 (0x0003 - 0x0000)
struct FBoolRotation final
{
public:
	bool                                          Yaw;                                               // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Pitch;                                             // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Roll;                                              // 0x0002(0x0001)(Edit, BlueprintVisible, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FBoolRotation;

// ScriptStruct UniversalCameraPlugin.ConstrainVector2
// 0x0003 (0x0003 - 0x0000)
struct FConstrainVector2 final
{
public:
	bool                                          X;                                                 // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Y;                                                 // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Z;                                                 // 0x0002(0x0001)(Edit, BlueprintVisible, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FConstrainVector2;

// ScriptStruct UniversalCameraPlugin.ConstrainVector
// 0x0003 (0x0003 - 0x0000)
struct FConstrainVector final
{
public:
	bool                                          X;                                                 // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Y;                                                 // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Z;                                                 // 0x0002(0x0001)(Edit, BlueprintVisible, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FConstrainVector;

// ScriptStruct UniversalCameraPlugin.UniversalCameraInfo
// 0x004C (0x004C - 0x0000)
struct FUniversalCameraInfo final
{
public:
	float                                         Zoom;                                              // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bConstrainZoomMinimum;                             // 0x0004(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Rei-SdkDumper ])
	float                                         MinimumZoom;                                       // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bConstrainZoomMaximum;                             // 0x000C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Rei-SdkDumper ])
	float                                         MaximumZoom;                                       // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ERotationLimitMode                            RotationLimitMode;                                 // 0x0014(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Rei-SdkDumper ])
	float                                         MaxRotationRadiusAngle;                            // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ConstrainPitch;                                    // 0x001C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Rei-SdkDumper ])
	float                                         MinimumPitch;                                      // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaximumPitch;                                      // 0x0024(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReversePitchRestriction;                           // 0x0028(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ConstrainRoll;                                     // 0x0029(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2A[0x2];                                       // 0x002A(0x0002)(Fixing Size After Last Property [ Rei-SdkDumper ])
	float                                         MinimumRoll;                                       // 0x002C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaximumRoll;                                       // 0x0030(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReverseRollRestriction;                            // 0x0034(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ConstrainYaw;                                      // 0x0035(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_36[0x2];                                       // 0x0036(0x0002)(Fixing Size After Last Property [ Rei-SdkDumper ])
	float                                         MinimumYaw;                                        // 0x0038(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaximumYaw;                                        // 0x003C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReverseYawRestriction;                             // 0x0040(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Rei-SdkDumper ])
	float                                         MovementSpeed;                                     // 0x0044(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RotatorSpeed;                                      // 0x0048(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FUniversalCameraInfo;

}

