#pragma once

/*
* SDK generated by Rei-SdkDumper
* Based on Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UnLua

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "InputCore_structs.hpp"


namespace SDK::Params
{

// Function UnLua.UnLuaFunctionLibrary.GetFileLastModifiedTimestamp
// 0x0018 (0x0018 - 0x0000)
struct UnLuaFunctionLibrary_GetFileLastModifiedTimestamp final
{
public:
	class FString                                 Path;                                              // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                         ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UnLuaFunctionLibrary_GetFileLastModifiedTimestamp;

// Function UnLua.UnLuaFunctionLibrary.GetLuaGCType
// 0x0004 (0x0004 - 0x0000)
struct UnLuaFunctionLibrary_GetLuaGCType final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UnLuaFunctionLibrary_GetLuaGCType;

// Function UnLua.UnLuaFunctionLibrary.GetScriptRootPath
// 0x0010 (0x0010 - 0x0000)
struct UnLuaFunctionLibrary_GetScriptRootPath final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UnLuaFunctionLibrary_GetScriptRootPath;

// Function UnLua.UnLuaFunctionLibrary.OpenPreGarbageCollect
// 0x0001 (0x0001 - 0x0000)
struct UnLuaFunctionLibrary_OpenPreGarbageCollect final
{
public:
	bool                                          bOpen;                                             // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UnLuaFunctionLibrary_OpenPreGarbageCollect;

// Function UnLua.UnLuaFunctionLibrary.SetLuaGCType
// 0x0004 (0x0004 - 0x0000)
struct UnLuaFunctionLibrary_SetLuaGCType final
{
public:
	int32                                         InType;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UnLuaFunctionLibrary_SetLuaGCType;

// Function UnLua.UnLuaInterface.GetModuleName
// 0x0010 (0x0010 - 0x0000)
struct UnLuaInterface_GetModuleName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UnLuaInterface_GetModuleName;

// Function UnLua.UnLuaLatentAction.GetTickableWhenPaused
// 0x0001 (0x0001 - 0x0000)
struct UnLuaLatentAction_GetTickableWhenPaused final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UnLuaLatentAction_GetTickableWhenPaused;

// Function UnLua.UnLuaLatentAction.OnLegacyCallback
// 0x0004 (0x0004 - 0x0000)
struct UnLuaLatentAction_OnLegacyCallback final
{
public:
	int32                                         InLinkage;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UnLuaLatentAction_OnLegacyCallback;

// Function UnLua.UnLuaLatentAction.SetTickableWhenPaused
// 0x0001 (0x0001 - 0x0000)
struct UnLuaLatentAction_SetTickableWhenPaused final
{
public:
	bool                                          bTickableWhenPaused;                               // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UnLuaLatentAction_SetTickableWhenPaused;

// Function UnLua.UnLuaLatentAction.OnCompleted
// 0x0004 (0x0004 - 0x0000)
struct UnLuaLatentAction_OnCompleted final
{
public:
	int32                                         InLinkage;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UnLuaLatentAction_OnCompleted;

// Function UnLua.UnLuaManager.EnhancedInputActionAxis1D
// 0x000C (0x000C - 0x0000)
struct UnLuaManager_EnhancedInputActionAxis1D final
{
public:
	float                                         ActionValue;                                       // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ElapsedSeconds;                                    // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TriggeredSeconds;                                  // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UnLuaManager_EnhancedInputActionAxis1D;

// Function UnLua.UnLuaManager.EnhancedInputActionAxis2D
// 0x0010 (0x0010 - 0x0000)
struct UnLuaManager_EnhancedInputActionAxis2D final
{
public:
	struct FVector2D                              ActionValue;                                       // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ElapsedSeconds;                                    // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TriggeredSeconds;                                  // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UnLuaManager_EnhancedInputActionAxis2D;

// Function UnLua.UnLuaManager.EnhancedInputActionAxis3D
// 0x0014 (0x0014 - 0x0000)
struct UnLuaManager_EnhancedInputActionAxis3D final
{
public:
	struct FVector                                ActionValue;                                       // 0x0000(0x000C)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ElapsedSeconds;                                    // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TriggeredSeconds;                                  // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UnLuaManager_EnhancedInputActionAxis3D;

// Function UnLua.UnLuaManager.EnhancedInputActionDigital
// 0x000C (0x000C - 0x0000)
struct UnLuaManager_EnhancedInputActionDigital final
{
public:
	bool                                          ActionValue;                                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Rei-SdkDumper ])
	float                                         ElapsedSeconds;                                    // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TriggeredSeconds;                                  // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UnLuaManager_EnhancedInputActionDigital;

// Function UnLua.UnLuaManager.GetOrAddBindingObject
// 0x0018 (0x0018 - 0x0000)
struct UnLuaManager_GetOrAddBindingObject final
{
public:
	class UClass*                                 Class_0;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UClass*                                 BindingClass;                                      // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UDynamicBlueprintBinding*               ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UnLuaManager_GetOrAddBindingObject;

// Function UnLua.UnLuaManager.InputAction
// 0x0018 (0x0018 - 0x0000)
struct UnLuaManager_InputAction final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(Parm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UnLuaManager_InputAction;

// Function UnLua.UnLuaManager.InputAxis
// 0x0004 (0x0004 - 0x0000)
struct UnLuaManager_InputAxis final
{
public:
	float                                         AxisValue;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UnLuaManager_InputAxis;

// Function UnLua.UnLuaManager.InputGesture
// 0x0004 (0x0004 - 0x0000)
struct UnLuaManager_InputGesture final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UnLuaManager_InputGesture;

// Function UnLua.UnLuaManager.InputTouch
// 0x0010 (0x0010 - 0x0000)
struct UnLuaManager_InputTouch final
{
public:
	ETouchIndex                                   FingerIndex;                                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Rei-SdkDumper ])
	struct FVector                                Location;                                          // 0x0004(0x000C)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UnLuaManager_InputTouch;

// Function UnLua.UnLuaManager.InputVectorAxis
// 0x000C (0x000C - 0x0000)
struct UnLuaManager_InputVectorAxis final
{
public:
	struct FVector                                AxisValue;                                         // 0x0000(0x000C)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UnLuaManager_InputVectorAxis;

// Function UnLua.UnLuaManager.OnLatentActionCompleted
// 0x0004 (0x0004 - 0x0000)
struct UnLuaManager_OnLatentActionCompleted final
{
public:
	int32                                         LinkID;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UnLuaManager_OnLatentActionCompleted;

// Function UnLua.UnLuaManager.Override
// 0x0018 (0x0018 - 0x0000)
struct UnLuaManager_Override final
{
public:
	class UClass*                                 Class_0;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   FunctionName;                                      // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   LuaFunctionName;                                   // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UnLuaManager_Override;

// Function UnLua.UnLuaSettings.EnablePrintLogCallArrayGet
// 0x0001 (0x0001 - 0x0000)
struct UnLuaSettings_EnablePrintLogCallArrayGet final
{
public:
	bool                                          bInEnable;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UnLuaSettings_EnablePrintLogCallArrayGet;

// Function UnLua.UnLuaSettings.EnablePrintLogCallUFuntion
// 0x0001 (0x0001 - 0x0000)
struct UnLuaSettings_EnablePrintLogCallUFuntion final
{
public:
	bool                                          bInEnable;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UnLuaSettings_EnablePrintLogCallUFuntion;

// Function UnLua.UnLuaSettings.EnablePrintLogDelegateRegRemove
// 0x0001 (0x0001 - 0x0000)
struct UnLuaSettings_EnablePrintLogDelegateRegRemove final
{
public:
	bool                                          bInEnable;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UnLuaSettings_EnablePrintLogDelegateRegRemove;

// Function UnLua.UnLuaSettings.IsLuaGCByAloneFrame
// 0x0001 (0x0001 - 0x0000)
struct UnLuaSettings_IsLuaGCByAloneFrame final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UnLuaSettings_IsLuaGCByAloneFrame;

// Function UnLua.UnLuaSettings.IsPrintLogCallArrayGet
// 0x0001 (0x0001 - 0x0000)
struct UnLuaSettings_IsPrintLogCallArrayGet final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UnLuaSettings_IsPrintLogCallArrayGet;

// Function UnLua.UnLuaSettings.IsPrintLogCallUFuntion
// 0x0001 (0x0001 - 0x0000)
struct UnLuaSettings_IsPrintLogCallUFuntion final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UnLuaSettings_IsPrintLogCallUFuntion;

// Function UnLua.UnLuaSettings.IsPrintLogDelegateRegRemove
// 0x0001 (0x0001 - 0x0000)
struct UnLuaSettings_IsPrintLogDelegateRegRemove final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UnLuaSettings_IsPrintLogDelegateRegRemove;

// Function UnLua.UnLuaSettings.SetLuaGCByAloneFrame
// 0x0001 (0x0001 - 0x0000)
struct UnLuaSettings_SetLuaGCByAloneFrame final
{
public:
	bool                                          bInEnable;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UnLuaSettings_SetLuaGCByAloneFrame;

}

