#pragma once

/*
* SDK generated by Rei-SdkDumper
* Based on Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UnLua

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "Engine_classes.hpp"
#include "InputCore_structs.hpp"


namespace SDK
{

// Class UnLua.LuaFunction
// 0x0018 (0x00F8 - 0x00E0)
class ULuaFunction final : public UFunction
{
public:
	uint8                                         Pad_E0[0x18];                                      // 0x00E0(0x0018)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("LuaFunction")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"LuaFunction")
	}
	static class ULuaFunction* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULuaFunction>();
	}
};
DUMPER7_ASSERTS_ULuaFunction;

// Class UnLua.LuaDelegateHandler
// 0x0020 (0x0048 - 0x0028)
class ULuaDelegateHandler final : public UObject
{
public:
	uint8                                         Pad_28[0x20];                                      // 0x0028(0x0020)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])

public:
	void Dummy();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("LuaDelegateHandler")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"LuaDelegateHandler")
	}
	static class ULuaDelegateHandler* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULuaDelegateHandler>();
	}
};
DUMPER7_ASSERTS_ULuaDelegateHandler;

// Class UnLua.LuaModuleLocator
// 0x0000 (0x0028 - 0x0028)
class ULuaModuleLocator : public UObject
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("LuaModuleLocator")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"LuaModuleLocator")
	}
	static class ULuaModuleLocator* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULuaModuleLocator>();
	}
};
DUMPER7_ASSERTS_ULuaModuleLocator;

// Class UnLua.LuaEnvLocator
// 0x0010 (0x0038 - 0x0028)
class ULuaEnvLocator : public UObject
{
public:
	uint8                                         Pad_28[0x10];                                      // 0x0028(0x0010)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("LuaEnvLocator")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"LuaEnvLocator")
	}
	static class ULuaEnvLocator* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULuaEnvLocator>();
	}
};
DUMPER7_ASSERTS_ULuaEnvLocator;

// Class UnLua.LuaModuleLocator_ByPackage
// 0x0050 (0x0078 - 0x0028)
class ULuaModuleLocator_ByPackage final : public ULuaModuleLocator
{
public:
	uint8                                         Pad_28[0x50];                                      // 0x0028(0x0050)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("LuaModuleLocator_ByPackage")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"LuaModuleLocator_ByPackage")
	}
	static class ULuaModuleLocator_ByPackage* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULuaModuleLocator_ByPackage>();
	}
};
DUMPER7_ASSERTS_ULuaModuleLocator_ByPackage;

// Class UnLua.LuaEnvLocator_ByGameInstance
// 0x0050 (0x0088 - 0x0038)
class ULuaEnvLocator_ByGameInstance final : public ULuaEnvLocator
{
public:
	uint8                                         Pad_38[0x50];                                      // 0x0038(0x0050)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("LuaEnvLocator_ByGameInstance")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"LuaEnvLocator_ByGameInstance")
	}
	static class ULuaEnvLocator_ByGameInstance* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULuaEnvLocator_ByGameInstance>();
	}
};
DUMPER7_ASSERTS_ULuaEnvLocator_ByGameInstance;

// Class UnLua.UnLuaFunctionLibrary
// 0x0000 (0x0028 - 0x0028)
class UUnLuaFunctionLibrary final : public UBlueprintFunctionLibrary
{
public:
	static int64 GetFileLastModifiedTimestamp(const class FString& Path);
	static int32 GetLuaGCType();
	static class FString GetScriptRootPath();
	static void HotReload();
	static void OpenPreGarbageCollect(bool bOpen);
	static void SetLuaGCType(int32 InType);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("UnLuaFunctionLibrary")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"UnLuaFunctionLibrary")
	}
	static class UUnLuaFunctionLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUnLuaFunctionLibrary>();
	}
};
DUMPER7_ASSERTS_UUnLuaFunctionLibrary;

// Class UnLua.UnLuaInterface
// 0x0000 (0x0000 - 0x0000)
class IUnLuaInterface final
{
public:
	class FString GetModuleName() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("UnLuaInterface")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"UnLuaInterface")
	}
	static class IUnLuaInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IUnLuaInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IUnLuaInterface;

// Class UnLua.UnLuaLatentAction
// 0x0028 (0x0050 - 0x0028)
class UUnLuaLatentAction final : public UObject
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Rei-SdkDumper ])
	TDelegate<void(int32 InLinkage)>              Callback;                                          // 0x0030(0x0010)(ZeroConstructor, InstancedReference, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_40[0x8];                                       // 0x0040(0x0008)(Fixing Size After Last Property [ Rei-SdkDumper ])
	uint8                                         bTickEvenWhenPaused : 1;                           // 0x0048(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate))
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])

public:
	bool GetTickableWhenPaused();
	void OnLegacyCallback(int32 InLinkage);
	void SetTickableWhenPaused(bool bTickableWhenPaused);

	void OnCompleted(int32 InLinkage) const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("UnLuaLatentAction")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"UnLuaLatentAction")
	}
	static class UUnLuaLatentAction* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUnLuaLatentAction>();
	}
};
DUMPER7_ASSERTS_UUnLuaLatentAction;

// Class UnLua.UnLuaManager
// 0x0138 (0x0160 - 0x0028)
class UUnLuaManager final : public UObject
{
public:
	uint8                                         Pad_28[0x138];                                     // 0x0028(0x0138)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])

public:
	void EnhancedInputActionAxis1D(float ActionValue, float ElapsedSeconds, float TriggeredSeconds);
	void EnhancedInputActionAxis2D(const struct FVector2D& ActionValue, float ElapsedSeconds, float TriggeredSeconds);
	void EnhancedInputActionAxis3D(const struct FVector& ActionValue, float ElapsedSeconds, float TriggeredSeconds);
	void EnhancedInputActionDigital(bool ActionValue, float ElapsedSeconds, float TriggeredSeconds);
	class UDynamicBlueprintBinding* GetOrAddBindingObject(class UClass* Class_0, class UClass* BindingClass);
	void InputAction(const struct FKey& Key);
	void InputAxis(float AxisValue);
	void InputGesture(float Value);
	void InputTouch(ETouchIndex FingerIndex, const struct FVector& Location);
	void InputVectorAxis(const struct FVector& AxisValue);
	void OnLatentActionCompleted(int32 LinkID);
	void Override(class UClass* Class_0, class FName FunctionName, class FName LuaFunctionName);
	void TriggerAnimNotify();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("UnLuaManager")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"UnLuaManager")
	}
	static class UUnLuaManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUnLuaManager>();
	}
};
DUMPER7_ASSERTS_UUnLuaManager;

// Class UnLua.UnLuaSettings
// 0x0040 (0x0068 - 0x0028)
class UUnLuaSettings final : public UObject
{
public:
	class FString                                 StartupModuleName;                                 // 0x0028(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         DeadLoopCheck;                                     // 0x0038(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          DanglingCheck;                                     // 0x003C(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bPrintLuaStackOnSystemError;                       // 0x003D(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3E[0x2];                                       // 0x003E(0x0002)(Fixing Size After Last Property [ Rei-SdkDumper ])
	TSubclassOf<class ULuaEnvLocator>             EnvLocatorClass;                                   // 0x0040(0x0008)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class ULuaModuleLocator>          ModuleLocatorClass;                                // 0x0048(0x0008)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FSoftClassPath>                 PreBindClasses;                                    // 0x0050(0x0010)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPublic)
	bool                                          bLuaEncrypto;                                      // 0x0060(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])

public:
	static void EnablePrintLogCallArrayGet(bool bInEnable);
	static void EnablePrintLogCallUFuntion(bool bInEnable);
	static void EnablePrintLogDelegateRegRemove(bool bInEnable);
	static bool IsLuaGCByAloneFrame();
	static bool IsPrintLogCallArrayGet();
	static bool IsPrintLogCallUFuntion();
	static bool IsPrintLogDelegateRegRemove();
	static void SetLuaGCByAloneFrame(bool bInEnable);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("UnLuaSettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"UnLuaSettings")
	}
	static class UUnLuaSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUnLuaSettings>();
	}
};
DUMPER7_ASSERTS_UUnLuaSettings;

}

