#pragma once

/*
* SDK generated by Rei-SdkDumper
* Based on Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: uw_main_time

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// LuaFunction uw_main_time.uw_main_time_C.Tick
// 0x003C (0x003C - 0x0000)
struct uw_main_time_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_uw_main_time_C_Tick;

// Function uw_main_time.uw_main_time_C.Tick__Overridden
// 0x003C (0x003C - 0x0000)
struct uw_main_time_C_Tick__Overridden final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_uw_main_time_C_Tick__Overridden;

// Function uw_main_time.uw_main_time_C.ExecuteUbergraph_uw_main_time
// 0x0040 (0x0040 - 0x0000)
struct uw_main_time_C_ExecuteUbergraph_uw_main_time final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0004(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_uw_main_time_C_ExecuteUbergraph_uw_main_time;

// Function uw_main_time.uw_main_time_C.GetModuleName
// 0x0010 (0x0010 - 0x0000)
struct uw_main_time_C_GetModuleName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_uw_main_time_C_GetModuleName;

}

