#pragma once

/*
* SDK generated by Rei-SdkDumper
* Based on Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: uw_widgets_money_item

#include "Basic.hpp"


namespace SDK::Params
{

// LuaFunction uw_widgets_money_item.uw_widgets_money_item_C.OnListItemObjectSet
// 0x0008 (0x0008 - 0x0000)
struct uw_widgets_money_item_C_OnListItemObjectSet final
{
public:
	class UObject*                                ListItemObject;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_uw_widgets_money_item_C_OnListItemObjectSet;

// Function uw_widgets_money_item.uw_widgets_money_item_C.BP_OnItemExpansionChanged
// 0x0001 (0x0001 - 0x0000)
struct uw_widgets_money_item_C_BP_OnItemExpansionChanged final
{
public:
	bool                                          bIsExpanded;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_uw_widgets_money_item_C_BP_OnItemExpansionChanged;

// Function uw_widgets_money_item.uw_widgets_money_item_C.BP_OnItemSelectionChanged
// 0x0001 (0x0001 - 0x0000)
struct uw_widgets_money_item_C_BP_OnItemSelectionChanged final
{
public:
	bool                                          bIsSelected;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_uw_widgets_money_item_C_BP_OnItemSelectionChanged;

// Function uw_widgets_money_item.uw_widgets_money_item_C.OnListItemObjectSet__Overridden
// 0x0008 (0x0008 - 0x0000)
struct uw_widgets_money_item_C_OnListItemObjectSet__Overridden final
{
public:
	class UObject*                                ListItemObject;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_uw_widgets_money_item_C_OnListItemObjectSet__Overridden;

// Function uw_widgets_money_item.uw_widgets_money_item_C.ExecuteUbergraph_uw_widgets_money_item
// 0x0018 (0x0018 - 0x0000)
struct uw_widgets_money_item_C_ExecuteUbergraph_uw_widgets_money_item final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Rei-SdkDumper ])
	class UObject*                                K2Node_Event_ListItemObject;                       // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsExpanded;                          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bIsSelected;                          // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_uw_widgets_money_item_C_ExecuteUbergraph_uw_widgets_money_item;

// Function uw_widgets_money_item.uw_widgets_money_item_C.GetModuleName
// 0x0010 (0x0010 - 0x0000)
struct uw_widgets_money_item_C_GetModuleName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_uw_widgets_money_item_C_GetModuleName;

}

