#pragma once

/*
* SDK generated by Rei-SdkDumper
* Based on Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: View_Main_bp

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass View_Main_bp.View_Main_bp_C
// 0x01B0 (0x03D8 - 0x0228)
class AView_Main_bp_C final : public AViewManager
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0228(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0230(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class FName                                   Row_Name;                                          // 0x0238(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Body_Actor;                                        // 0x0240(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Head_Actor;                                        // 0x0248(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           Env_Tag_Array;                                     // 0x0250(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class USkeletalMeshComponent*                 BodySkm;                                           // 0x0260(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 HeadSkm;                                           // 0x0268(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Role_Name;                                         // 0x0270(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Actor_Name;                                        // 0x0278(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           Special;                                           // 0x0280(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         SportLightCount;                                   // 0x0290(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   OtherLightName;                                    // 0x0294(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CurrentSportLightCount;                            // 0x029C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FString>                         SportLightTagArray;                                // 0x02A0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FName                                   Temp_LevelName;                                    // 0x02B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 GlobalName;                                        // 0x02B8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	TArray<class USkeletalMeshComponent*>         BodySkmArray;                                      // 0x02C8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	TArray<class USkeletalMeshComponent*>         HeadSkmArray;                                      // 0x02D8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	bool                                          SkinPartModify;                                    // 0x02E8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          SkinPartModifyAllAges;                             // 0x02E9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2EA[0x6];                                      // 0x02EA(0x0006)(Fixing Size After Last Property [ Rei-SdkDumper ])
	TArray<int32>                                 Character_Skin_Part_Array;                         // 0x02F0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          TestTrue;                                          // 0x0300(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bIsSpine;                                          // 0x0301(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_302[0x2];                                      // 0x0302(0x0002)(Fixing Size After Last Property [ Rei-SdkDumper ])
	class FName                                   role_spine;                                        // 0x0304(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   role_spine_point;                                  // 0x030C(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   role_spine_inner;                                  // 0x0314(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   role_spine_point_detail;                           // 0x031C(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_324[0x4];                                      // 0x0324(0x0004)(Fixing Size After Last Property [ Rei-SdkDumper ])
	TArray<class AActor*>                         BP_SkinPart;                                       // 0x0328(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	TArray<class USkeletalMeshComponent*>         SKM_SkinPart_Body;                                 // 0x0338(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	TArray<class UStaticMeshComponent*>           SM_SkinPart_Body;                                  // 0x0348(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	TArray<class USkeletalMeshComponent*>         SKM_SkinPart_Head;                                 // 0x0358(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	TArray<class UStaticMeshComponent*>           SM_SkinPart_Head;                                  // 0x0368(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	class FName                                   Temp_CharacterName;                                // 0x0378(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   party1;                                            // 0x0380(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   party2;                                            // 0x0388(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsPartyName;                                      // 0x0390(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_391[0x3];                                      // 0x0391(0x0003)(Fixing Size After Last Property [ Rei-SdkDumper ])
	class FName                                   Formation;                                         // 0x0394(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsMulCharacter;                                   // 0x039C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39D[0x3];                                      // 0x039D(0x0003)(Fixing Size After Last Property [ Rei-SdkDumper ])
	int32                                         RenderComGlobalState;                              // 0x03A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   housephoto;                                        // 0x03A4(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3AC[0x4];                                      // 0x03AC(0x0004)(Fixing Size After Last Property [ Rei-SdkDumper ])
	class FString                                 ReplaceFaceName;                                   // 0x03B0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	bool                                          Is_Role_Appreciate;                                // 0x03C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3C1[0x3];                                      // 0x03C1(0x0003)(Fixing Size After Last Property [ Rei-SdkDumper ])
	float                                         LineWidget;                                        // 0x03C4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   RMOLFormation;                                     // 0x03C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   RMOLFormation_0;                                   // 0x03D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Get_View_House_Beach_Data_Table(const struct FView_HouseBeach_DataTable& HouseBeachData, const class FString& RoleName, struct FViewGirlMain* 人物DataAsset, struct FViewGirlMain* 人物DataAsset_和谐);
	void Get_View_House_Photo_Data_Table(const struct FView_HousePhoto_DataTable& HousePhotoData, const class FString& RoleName, struct FViewGirlMain* 人物DataAsset, struct FViewGirlMain* 人物DataAsset_和谐);
	void Get_View_Manifestation_Data_Table(const struct FView_Manifestation_DataTable& Main_Data, const class FString& RoleName, struct FViewGirlMain* 人物DataAsset, struct FViewGirlMain* 人物DataAsset_和谐);
	void Mul_Character_Role();
	void Party_Role_Use_Body_Character_Com(class UCharacterRenderComponent** CharacterRenderCom);
	void BIs_Party_Role();
	void Set_Replace_Skin_Part_Mesh_Actor();
	void B_Is_Spine_Role();
	void Set_Head_Sec_All_Age_MID(class UViewCharacterSecondaryData* Target);
	void Set_Head_All_Age_MID(class UViewCharacterData* Target);
	void Set_Head_Sec_MID(const struct FViewGirlMain& ViewGirlMain);
	void Set_Head_MID(const struct FViewGirlMain& ViewGirlMain);
	void Set_Body_Sec_MID_All_Ages(class UViewCharacterSecondaryData* SecAllAges);
	void Set_Body_MID_All_Ages(class UViewCharacterData* AllAges);
	void SetBodySecMID(const struct FViewGirlMain& ViewGirlMain);
	void SetBodyMID(const struct FViewGirlMain& ViewGirlMain);
	void Set_Skin_Part_Body_Sec_MID(const struct FSkinPartMaterial& SkinPartMaterialStruct, class AActor* Actor, class UMeshComponent* MC);
	void End_Character_State();
	void SkinPartSetSecMat();
	void Set_Skin_Part_Body_MID(const struct FSkinPartMaterial& SkinPartMaterialStruct, class AActor* Actor, class UMeshComponent* MC);
	void Set_Env_Param(TSoftObjectPtr<class UViewEnvironmentData> 环境配置信息, TSoftObjectPtr<class UViewEnvironmentData> 环境特效配置信息);
	void EditorClearOutLine(int32 CVar);
	void GetViewCharacterDataTable_Formation(const struct FView_Character_DataTable& Main_Data, const class FString& RoleName, TSoftObjectPtr<class UViewLightData>* 灯光DataAsset, struct FViewGirlMain* 人物DataAsset, TSoftObjectPtr<class UViewEnvironmentData>* 环境特效DataAsset, TSoftObjectPtr<class UViewOtherLightData>* OtherLightDataAsset);
	void Set_Spot_Light_Param(const TMap<class FName, struct FView_DirectionalLight>& TargetMap, const TArray<class FName>& ActorTags, class AActor* Target, TSubclassOf<class USpotLightComponent> SpotLigtComponent);
	void Set_Point_Light_Param(const TMap<class FName, struct FView_DirectionalLight>& TargetMap, class AActor* Target, TSubclassOf<class UPointLightComponent> PointLightComponent, TArray<class FName>& ActorTags);
	void GetBossDataTable(const struct FView_Boss_DataTable& View_Boss_DataTable, class FName InName, TSoftObjectPtr<class UViewLightData>* 灯光DataAsset, TSoftObjectPtr<class UViewEnvironmentData>* 环境特效DataAsset, TSoftObjectPtr<class UViewOtherLightData>* OtherLightDataAsset);
	void GetWeasponDataTable(const struct FView_Weapon_DataTable& View_Weapon_DataTable, class FName InName, TSoftObjectPtr<class UViewLightData>* 灯光DataAsset, TSoftObjectPtr<class UViewEnvironmentData>* 环境特效DataAsset, TSoftObjectPtr<class UViewOtherLightData>* OtherLightDataAsset);
	void Set_Light_Param(TSoftObjectPtr<class UViewLightData> DirectionalLight, TSoftObjectPtr<class UViewLightData> DirectionalLightAllAges, TSoftObjectPtr<class UViewOtherLightData> OtherLight);
	void GetViewCharacterDataTable(const struct FView_Character_DataTable& Main_Data, const class FString& RoleName, TSoftObjectPtr<class UViewLightData>* 灯光DataAsset, TSoftObjectPtr<class UViewLightData>* 灯光DataAsset_和谐, TSoftObjectPtr<class UViewOtherLightData>* OtherLightDataAsset, struct FViewGirlMain* 人物DataAsset, TSoftObjectPtr<class UViewEnvironmentData>* 环境特效DataAsset, struct FViewGirlMain* 人物DataAsset_和谐);
	void ViewMain();
	void Main(class FName RowName, class AActor* BodyActor, class AActor* HeadActor, class FName RoleName, class FName ActorName, bool bSkinPartModify, bool bSkinPartModifyAllAges, TArray<int32>& CharacterSkinPartArray, TArray<class AActor*>& SkinPartActors);
	void SetNiagaraParam(TSoftObjectPtr<class UViewEnvironmentData> 环境特效配置信息);
	void SetStaticMeshParam(TSoftObjectPtr<class UViewEnvironmentData> 环境配置信息);
	void Set_Head_Mat_Param(const struct FViewGirlMain& HeadStruct, const struct FViewGirlMain& HeadStructAllAges);
	void GetHeadSkm(class AActor* HeadActor);
	void Set_Texture_MID(const TMap<class FName, TSoftObjectPtr<class UTexture2D>>& Texture2d_Map, int32 GlobalState, class UCharacterRenderComponent* RenderCon, class UMeshComponent* MC, int32 MaterialIndex);
	void Set_Linear_Color_MID(const TMap<class FName, struct FLinearColor>& LinearColor_Map, int32 GlobalState, class UCharacterRenderComponent* RenderCon, class UMeshComponent* MC, int32 MaterialIndex);
	void SetFloatMID(const TMap<class FName, float>& Float_Map, int32 GlobalState, class UCharacterRenderComponent* RenderCon, class UMeshComponent* MC, int32 MaterialIndex);
	void GetBodySkm(class AActor* BodyActor);
	void Set_Body_Mat_Param(const struct FViewGirlMain& BodyStruct, const struct FViewGirlMain& BodyStructAllAges);
	void OnDataChanged();
	void RestOutLine(int32 Input);
	void SetLineWidget(float LineWidget_0);
	void ExecuteUbergraph_View_Main_bp(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("View_Main_bp_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"View_Main_bp_C")
	}
	static class AView_Main_bp_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AView_Main_bp_C>();
	}
};
DUMPER7_ASSERTS_AView_Main_bp_C;

}

