#pragma once

/*
* SDK generated by Rei-SdkDumper
* Based on Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Weather

#include "Basic.hpp"

#include "Weather_structs.hpp"


namespace SDK::Params
{

// Function Weather.RainSource.BeginQualityChange
// 0x0001 (0x0001 - 0x0000)
struct RainSource_BeginQualityChange final
{
public:
	EWeatherQuality                               InQuality;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RainSource_BeginQualityChange;

// Function Weather.RainSource.BlendFog
// 0x0004 (0x0004 - 0x0000)
struct RainSource_BlendFog final
{
public:
	float                                         _Alpha;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RainSource_BlendFog;

// Function Weather.RainSource.BlendLight
// 0x0004 (0x0004 - 0x0000)
struct RainSource_BlendLight final
{
public:
	float                                         _Alpha;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RainSource_BlendLight;

// Function Weather.RainSource.BlendMat
// 0x0004 (0x0004 - 0x0000)
struct RainSource_BlendMat final
{
public:
	float                                         _Alpha;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RainSource_BlendMat;

// Function Weather.RainSource.BlendScenePost
// 0x0004 (0x0004 - 0x0000)
struct RainSource_BlendScenePost final
{
public:
	float                                         _Alpha;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RainSource_BlendScenePost;

// Function Weather.RainSource.BlendSky
// 0x0004 (0x0004 - 0x0000)
struct RainSource_BlendSky final
{
public:
	float                                         _Alpha;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RainSource_BlendSky;

// Function Weather.RainSource.BlendSky_BP
// 0x0004 (0x0004 - 0x0000)
struct RainSource_BlendSky_BP final
{
public:
	float                                         _Alpha;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RainSource_BlendSky_BP;

// Function Weather.RainSource.BlendSound
// 0x0004 (0x0004 - 0x0000)
struct RainSource_BlendSound final
{
public:
	float                                         _Alpha;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RainSource_BlendSound;

// Function Weather.RainSource.DisableRain
// 0x0002 (0x0002 - 0x0000)
struct RainSource_DisableRain final
{
public:
	bool                                          bForce;                                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bFast;                                             // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RainSource_DisableRain;

// Function Weather.RainSource.EnableRain
// 0x0002 (0x0002 - 0x0000)
struct RainSource_EnableRain final
{
public:
	bool                                          bForce;                                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bFast;                                             // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RainSource_EnableRain;

// Function Weather.RainSource.EndQualityChange
// 0x0001 (0x0001 - 0x0000)
struct RainSource_EndQualityChange final
{
public:
	EWeatherQuality                               InQuality;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RainSource_EndQualityChange;

// Function Weather.RainSource.IsRainning
// 0x0001 (0x0001 - 0x0000)
struct RainSource_IsRainning final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RainSource_IsRainning;

// Function Weather.RainSource.SetLightingSoundScaler
// 0x0004 (0x0004 - 0x0000)
struct RainSource_SetLightingSoundScaler final
{
public:
	float                                         Scaler;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RainSource_SetLightingSoundScaler;

// Function Weather.RainSource.SetLightingSoundVolume
// 0x0004 (0x0004 - 0x0000)
struct RainSource_SetLightingSoundVolume final
{
public:
	float                                         Volume;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RainSource_SetLightingSoundVolume;

// Function Weather.RainSource.SetQuality
// 0x0001 (0x0001 - 0x0000)
struct RainSource_SetQuality final
{
public:
	EWeatherQuality                               InQuality;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RainSource_SetQuality;

// Function Weather.RainSource.SetQualityFast
// 0x0001 (0x0001 - 0x0000)
struct RainSource_SetQualityFast final
{
public:
	EWeatherQuality                               InQuality;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RainSource_SetQualityFast;

// Function Weather.RainSource.SetRainMainSoundScaler
// 0x0004 (0x0004 - 0x0000)
struct RainSource_SetRainMainSoundScaler final
{
public:
	float                                         Scaler;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RainSource_SetRainMainSoundScaler;

// Function Weather.RainSource.SetRainMainSoundVolume
// 0x0004 (0x0004 - 0x0000)
struct RainSource_SetRainMainSoundVolume final
{
public:
	float                                         Volume;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RainSource_SetRainMainSoundVolume;

// Function Weather.RainSource.UpdateCapture
// 0x0001 (0x0001 - 0x0000)
struct RainSource_UpdateCapture final
{
public:
	bool                                          bForce;                                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RainSource_UpdateCapture;

// Function Weather.SandstormSource.BeginQualityChange
// 0x0001 (0x0001 - 0x0000)
struct SandstormSource_BeginQualityChange final
{
public:
	EWeatherQuality                               InQuality;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SandstormSource_BeginQualityChange;

// Function Weather.SandstormSource.EndQualityChange
// 0x0001 (0x0001 - 0x0000)
struct SandstormSource_EndQualityChange final
{
public:
	EWeatherQuality                               InQuality;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SandstormSource_EndQualityChange;

// Function Weather.SandstormSource.GetQuality
// 0x0001 (0x0001 - 0x0000)
struct SandstormSource_GetQuality final
{
public:
	EWeatherQuality                               ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SandstormSource_GetQuality;

// Function Weather.SandstormSource.SetQuality
// 0x0001 (0x0001 - 0x0000)
struct SandstormSource_SetQuality final
{
public:
	EWeatherQuality                               InQuality;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SandstormSource_SetQuality;

}

