#pragma once

/*
* SDK generated by Rei-SdkDumper
* Based on Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Weather

#include "Basic.hpp"

#include "Weather_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// Class Weather.RainConfig
// 0x0188 (0x01B8 - 0x0030)
class URainConfig final : public UPrimaryDataAsset
{
public:
	struct FRainParameter                         Parameter;                                         // 0x0030(0x00D8)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	struct FSkyParameter                          SkyParameter;                                      // 0x0108(0x009C)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_1A4[0x4];                                      // 0x01A4(0x0004)(Fixing Size After Last Property [ Rei-SdkDumper ])
	class UCurveFloat*                            BlendInCurve;                                      // 0x01A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCurveVector*                           LightingCurve;                                     // 0x01B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("RainConfig")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"RainConfig")
	}
	static class URainConfig* GetDefaultObj()
	{
		return GetDefaultObjImpl<URainConfig>();
	}
};
DUMPER7_ASSERTS_URainConfig;

// Class Weather.WeatherActorBase
// 0x0020 (0x0248 - 0x0228)
class AWeatherActorBase : public AActor
{
public:
	bool                                          bDynamicWeather;                                   // 0x0228(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_229[0x3];                                      // 0x0229(0x0003)(Fixing Size After Last Property [ Rei-SdkDumper ])
	float                                         TickInterval;                                      // 0x022C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USceneComponent*                        rootComp;                                          // 0x0230(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UBillboardComponent*                    ICONComp;                                          // 0x0238(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	EWeatherQuality                               CurrentQuality;                                    // 0x0240(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_241[0x7];                                      // 0x0241(0x0007)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("WeatherActorBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WeatherActorBase")
	}
	static class AWeatherActorBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<AWeatherActorBase>();
	}
};
DUMPER7_ASSERTS_AWeatherActorBase;

// Class Weather.RainSource
// 0x0180 (0x03C8 - 0x0248)
class ARainSource final : public AWeatherActorBase
{
public:
	TMap<EWeatherQuality, class URainConfig*>     RainConfiges;                                      // 0x0248(0x0050)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	class ULightComponent*                        DirectionLightComponent;                           // 0x0298(0x0008)(Edit, ExportObject, ZeroConstructor, DisableEditOnTemplate, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UExponentialHeightFogComponent*         RawHeightFog;                                      // 0x02A0(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnTemplate, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPostProcessComponent*                  PostProcess;                                       // 0x02A8(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnInstance, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UStaticMeshComponent*                   RainMesh;                                          // 0x02B0(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnInstance, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UNiagaraComponent*                      RainParticle;                                      // 0x02B8(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnInstance, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UNiagaraComponent*                      LightingParticle;                                  // 0x02C0(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnInstance, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USceneCaptureComponent2D*               ToTopCapture;                                      // 0x02C8(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnInstance, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class APostProcessVolume*                     SceneMainPost;                                     // 0x02D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RainFallParticleOffset;                            // 0x02D8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                CaptureBoxExtent;                                  // 0x02DC(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterialParameterCollection*           RainMatData;                                       // 0x02E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CaptureMaxMoveDistance;                            // 0x02F0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2F4[0x4];                                      // 0x02F4(0x0004)(Fixing Size After Last Property [ Rei-SdkDumper ])
	TArray<class AActor*>                         ShowOnlyActors;                                    // 0x02F8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, EditConst, NativeAccessSpecifierPublic)
	TArray<EObjectTypeQuery>                      ShowOnlyActorsType;                                // 0x0308(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	struct FRotator                               RawCaptureRotate;                                  // 0x0318(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FRotator                               InversCaptureRotate;                               // 0x0324(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bUpdateLightingLight;                              // 0x0330(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_331[0x7];                                      // 0x0331(0x0007)(Fixing Size After Last Property [ Rei-SdkDumper ])
	class URainConfig*                            LastWeather;                                       // 0x0338(0x0008)(Edit, ZeroConstructor, DisableEditOnTemplate, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class URainConfig*                            StartBlendWeather;                                 // 0x0340(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class URainConfig*                            EndBlendWeather;                                   // 0x0348(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RainSoundVolumeScaler;                             // 0x0350(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LightingSoundVolumeScaler;                         // 0x0354(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CurRainSoundVolume;                                // 0x0358(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CurLightingSoundVolume;                            // 0x035C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDisableRainAll;                                   // 0x0360(0x0001)(Edit, ZeroConstructor, DisableEditOnTemplate, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsInitOnly;                                       // 0x0361(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsBlendingThunder;                                // 0x0362(0x0001)(Edit, ZeroConstructor, DisableEditOnTemplate, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsBlendingRain;                                   // 0x0363(0x0001)(Edit, ZeroConstructor, DisableEditOnTemplate, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_364[0x20];                                     // 0x0364(0x0020)(Fixing Size After Last Property [ Rei-SdkDumper ])
	float                                         CurThunderTimer;                                   // 0x0384(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_388[0x2C];                                     // 0x0388(0x002C)(Fixing Size After Last Property [ Rei-SdkDumper ])
	bool                                          InversGravity;                                     // 0x03B4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseCapture;                                       // 0x03B5(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3B6[0x2];                                      // 0x03B6(0x0002)(Fixing Size After Last Property [ Rei-SdkDumper ])
	class UExponentialHeightFogComponent*         ExponentialHeightFog;                              // 0x03B8(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnInstance, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         tempRainSoundVolume;                               // 0x03C0(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         tempLightingSoundVolume;                           // 0x03C4(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void BegineFastSwitch();
	void BeginInit();
	void BeginQualityChange(EWeatherQuality InQuality);
	void BindRain();
	void BlendFog(float _Alpha);
	void BlendLight(float _Alpha);
	void BlendMat(float _Alpha);
	void BlendRain();
	void BlendRainOffEvent();
	void BlendRainOnEvent();
	void BlendScenePost(float _Alpha);
	void BlendSky(float _Alpha);
	void BlendSky_BP(float _Alpha);
	void BlendSound(float _Alpha);
	void CheckAndSetEnvironment();
	void CheckAndSetSky();
	void DisableRain(bool bForce, bool bFast);
	void EnableRain(bool bForce, bool bFast);
	void EndFastSwitch();
	void EndQualityChange(EWeatherQuality InQuality);
	bool IsRainning();
	void PlayLightingSound();
	void PlayRainMainSound();
	void SetLightingSoundScaler(float Scaler);
	void SetLightingSoundVolume(float Volume);
	void SetQuality(EWeatherQuality InQuality);
	void SetQualityFast(EWeatherQuality InQuality);
	void SetRainMainSoundScaler(float Scaler);
	void SetRainMainSoundVolume(float Volume);
	void StopLightingEvent();
	void StopLightingSound();
	void StopRainMainSound();
	void UpdateCapture(bool bForce);
	void UpdateRain();
	void UpdateThunder();
	void UpdateThunderEvent();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("RainSource")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"RainSource")
	}
	static class ARainSource* GetDefaultObj()
	{
		return GetDefaultObjImpl<ARainSource>();
	}
};
DUMPER7_ASSERTS_ARainSource;

// Class Weather.SandstormConfig
// 0x0080 (0x00B0 - 0x0030)
class USandstormConfig final : public UPrimaryDataAsset
{
public:
	struct FSandstormParameter                    Parameter;                                         // 0x0030(0x0074)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_A4[0x4];                                       // 0x00A4(0x0004)(Fixing Size After Last Property [ Rei-SdkDumper ])
	class UCurveFloat*                            BlendInCurve;                                      // 0x00A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SandstormConfig")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SandstormConfig")
	}
	static class USandstormConfig* GetDefaultObj()
	{
		return GetDefaultObjImpl<USandstormConfig>();
	}
};
DUMPER7_ASSERTS_USandstormConfig;

// Class Weather.SandstormSource
// 0x01A0 (0x03E8 - 0x0248)
class ASandstormSource final : public AWeatherActorBase
{
public:
	TMap<EWeatherQuality, class USandstormConfig*> SandstormConfiges;                                // 0x0248(0x0050)(Edit, NativeAccessSpecifierPublic)
	class UNiagaraSystem*                         SandstromEffect;                                   // 0x0298(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableVolumetricFog;                              // 0x02A0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2A1[0x7];                                      // 0x02A1(0x0007)(Fixing Size After Last Property [ Rei-SdkDumper ])
	class UStaticMesh*                            FogVolumeMesh;                                     // 0x02A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                VolumeScale;                                       // 0x02B0(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2BC[0x4];                                      // 0x02BC(0x0004)(Fixing Size After Last Property [ Rei-SdkDumper ])
	class UMaterialInterface*                     FogVolumeMaterial;                                 // 0x02C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterialInterface*                     ExpFogMaterial;                                    // 0x02C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPostProcessComponent*                  PostProcess;                                       // 0x02D0(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnInstance, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UChildActorComponent*                   UsedWindActor;                                     // 0x02D8(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnInstance, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2E0[0x8];                                      // 0x02E0(0x0008)(Fixing Size After Last Property [ Rei-SdkDumper ])
	class UExponentialHeightFogComponent*         ExponentialHeightFog;                              // 0x02E8(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnInstance, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UNiagaraComponent*                      SandstromEffectComponent;                          // 0x02F0(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnInstance, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UStaticMeshComponent*                   FogVolume;                                         // 0x02F8(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnInstance, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class AWindSource*                            WindActor;                                         // 0x0300(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSoftObjectPtr<class UMaterialParameterCollection> SandstormParameterCollection;                 // 0x0308(0x0028)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class USandstormConfig*                       newConfig;                                         // 0x0330(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class USandstormConfig*                       oldConfig;                                         // 0x0338(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class USandstormConfig*                       CurrentConfig;                                     // 0x0340(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_348[0xA0];                                     // 0x0348(0x00A0)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])

public:
	void BeginQualityChange(EWeatherQuality InQuality);
	void BlendParameterEvent();
	void EndQualityChange(EWeatherQuality InQuality);
	EWeatherQuality GetQuality();
	void SetQuality(EWeatherQuality InQuality);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SandstormSource")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SandstormSource")
	}
	static class ASandstormSource* GetDefaultObj()
	{
		return GetDefaultObjImpl<ASandstormSource>();
	}
};
DUMPER7_ASSERTS_ASandstormSource;

// Class Weather.WeatherConfigBase
// 0x0000 (0x0030 - 0x0030)
class UWeatherConfigBase final : public UPrimaryDataAsset
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("WeatherConfigBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WeatherConfigBase")
	}
	static class UWeatherConfigBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWeatherConfigBase>();
	}
};
DUMPER7_ASSERTS_UWeatherConfigBase;

// Class Weather.WindConfig
// 0x0018 (0x0048 - 0x0030)
class UWindConfig final : public UPrimaryDataAsset
{
public:
	struct FWindParameter                         Config;                                            // 0x0030(0x0018)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("WindConfig")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WindConfig")
	}
	static class UWindConfig* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWindConfig>();
	}
};
DUMPER7_ASSERTS_UWindConfig;

// Class Weather.WindSource
// 0x00D8 (0x0320 - 0x0248)
class AWindSource final : public AWeatherActorBase
{
public:
	TSoftObjectPtr<class UMaterialParameterCollection> WindParameter;                                // 0x0248(0x0028)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_270[0x18];                                     // 0x0270(0x0018)(Fixing Size After Last Property [ Rei-SdkDumper ])
	class UArrowComponent*                        Arrow;                                             // 0x0288(0x0008)(Edit, ExportObject, ZeroConstructor, DisableEditOnInstance, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TMap<EWeatherQuality, class UWindConfig*>     WindConfig;                                        // 0x0290(0x0050)(Edit, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2E0[0x40];                                     // 0x02E0(0x0040)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("WindSource")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WindSource")
	}
	static class AWindSource* GetDefaultObj()
	{
		return GetDefaultObjImpl<AWindSource>();
	}
};
DUMPER7_ASSERTS_AWindSource;

}

