#pragma once

/*
* SDK generated by Rei-SdkDumper
* Based on Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WM_InputManager_Plugin

#include "Basic.hpp"

#include "InputCore_structs.hpp"


namespace SDK
{

// Enum WM_InputManager_Plugin.EWM_InputManagerMode
// NumValues: 0x0004
enum class EWM_InputManagerMode : uint8
{
	Off                                      = 0,
	Config                                   = 1,
	Assign                                   = 2,
	EWM_InputManagerMode_MAX                 = 3,
};

// Enum WM_InputManager_Plugin.EWM_KeyTriggerState
// NumValues: 0x0004
enum class EWM_KeyTriggerState : uint8
{
	NoTrigger                                = 0,
	WasJustPressed                           = 1,
	WasJustReleased                          = 2,
	EWM_KeyTriggerState_MAX                  = 3,
};

// Enum WM_InputManager_Plugin.EWM_GamepadKeyType
// NumValues: 0x0005
enum class EWM_GamepadKeyType : uint8
{
	NoGamepadKey                             = 0,
	Axis                                     = 1,
	Button                                   = 2,
	DPAD                                     = 3,
	EWM_GamepadKeyType_MAX                   = 4,
};

// Enum WM_InputManager_Plugin.EWM_InputManagerStatus
// NumValues: 0x0004
enum class EWM_InputManagerStatus : uint8
{
	WM_NoStatus                              = 0,
	WaitingForButtonPress                    = 1,
	WaitingForAxisResponse                   = 2,
	EWM_MAX                                  = 3,
};

// Enum WM_InputManager_Plugin.EWM_DeviceType
// NumValues: 0x0005
enum class EWM_DeviceType : uint8
{
	No_Device                                = 0,
	JoystickOrGamepad                        = 1,
	Keyboard                                 = 2,
	Mouse                                    = 3,
	EWM_DeviceType_MAX                       = 4,
};

// Enum WM_InputManager_Plugin.EWM_AxisCodeTable
// NumValues: 0x0014
enum class EWM_AxisCodeTable : uint8
{
	NoFlags                                  = 0,
	X_Axis                                   = 48,
	Y_Axis                                   = 49,
	Z_Axis                                   = 50,
	X_Rot                                    = 51,
	Y_Rot                                    = 52,
	Z_Rot                                    = 53,
	Slider                                   = 54,
	Dial                                     = 55,
	Wheel                                    = 56,
	Hat                                      = 57,
	Vx                                       = 64,
	Vy                                       = 65,
	Vz                                       = 66,
	Vrx                                      = 68,
	Vry                                      = 69,
	Vrz                                      = 70,
	Rudder                                   = 186,
	Throttle                                 = 187,
	EWM_MAX                                  = 188,
};

// Enum WM_InputManager_Plugin.ERawControllerType
// NumValues: 0x0005
enum class ERawControllerType : uint8
{
	JoystickORGamepad                        = 0,
	Keyboard                                 = 1,
	Mouse                                    = 2,
	Other                                    = 3,
	ERawControllerType_MAX                   = 4,
};

// ScriptStruct WM_InputManager_Plugin.WM_HID_AxisData
// 0x0098 (0x0098 - 0x0000)
struct FWM_HID_AxisData final
{
public:
	class UWM_Settings*                           WM_Settings;                                       // 0x0000(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8[0x1C];                                       // 0x0008(0x001C)(Fixing Size After Last Property [ Rei-SdkDumper ])
	int32                                         LogicalMin;                                        // 0x0024(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         LogicalMax;                                        // 0x0028(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LogicalCenter;                                     // 0x002C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LogicalRange;                                      // 0x0030(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RawValue;                                          // 0x0034(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         NormalizedRawValue;                                // 0x0038(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CenteredValue;                                     // 0x003C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AxisValue;                                         // 0x0040(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EWM_AxisCodeTable                             axisEnum;                                          // 0x0044(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_45[0x1B];                                      // 0x0045(0x001B)(Fixing Size After Last Property [ Rei-SdkDumper ])
	class FString                                 AxisBindingCode;                                   // 0x0060(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_70[0x10];                                      // 0x0070(0x0010)(Fixing Size After Last Property [ Rei-SdkDumper ])
	int32                                         Instance;                                          // 0x0080(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_84[0x14];                                      // 0x0084(0x0014)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_FWM_HID_AxisData;

// ScriptStruct WM_InputManager_Plugin._PCS_Device
// 0x0010 (0x0010 - 0x0000)
struct F_PCS_Device final
{
public:
	TArray<class UWM_Device*>                     Devices;                                           // 0x0000(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_F_PCS_Device;

// ScriptStruct WM_InputManager_Plugin.DPADCollection
// 0x0070 (0x0070 - 0x0000)
struct FDPADCollection final
{
public:
	struct FKey                                   Up;                                                // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FKey                                   Down;                                              // 0x0018(0x0018)(BlueprintVisible, BlueprintReadOnly, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FKey                                   Left;                                              // 0x0030(0x0018)(BlueprintVisible, BlueprintReadOnly, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FKey                                   Right;                                             // 0x0048(0x0018)(BlueprintVisible, BlueprintReadOnly, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 BINDING;                                           // 0x0060(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FDPADCollection;

// ScriptStruct WM_InputManager_Plugin.WM_HID_ButtonData
// 0x0028 (0x0028 - 0x0000)
struct FWM_HID_ButtonData final
{
public:
	uint8                                         Pad_0[0x1];                                        // 0x0000(0x0001)(Fixing Size After Last Property [ Rei-SdkDumper ])
	bool                                          bIsPressed;                                        // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Rei-SdkDumper ])
	int32                                         ButtonNumber;                                      // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EWM_KeyTriggerState                           KeyTriggerState;                                   // 0x0008(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Rei-SdkDumper ])
	class FString                                 ButtonBindingCode;                                 // 0x0010(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_20[0x8];                                       // 0x0020(0x0008)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_FWM_HID_ButtonData;

// ScriptStruct WM_InputManager_Plugin.DefaultDeviceMappings
// 0x00A0 (0x00A0 - 0x0000)
struct FDefaultDeviceMappings final
{
public:
	TMap<class FString, class FString>            DefaultAxisMappings;                               // 0x0000(0x0050)(Edit, NativeAccessSpecifierPublic)
	TMap<class FString, int32>                    DefaultButtonMappings;                             // 0x0050(0x0050)(Edit, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FDefaultDeviceMappings;

// ScriptStruct WM_InputManager_Plugin.HidKeysByClass
// 0x01E0 (0x01E0 - 0x0000)
struct FHidKeysByClass final
{
public:
	TMap<struct FKey, EWM_GamepadKeyType>         KeysByType;                                        // 0x0000(0x0050)(NativeAccessSpecifierPublic)
	TMap<struct FKey, class FString>              Axes;                                              // 0x0050(0x0050)(NativeAccessSpecifierPublic)
	TMap<struct FKey, class FString>              Buttons;                                           // 0x00A0(0x0050)(NativeAccessSpecifierPublic)
	TMap<class FString, struct FDPADCollection>   DPADs;                                             // 0x00F0(0x0050)(NativeAccessSpecifierPublic)
	uint8                                         Pad_140[0xA0];                                     // 0x0140(0x00A0)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_FHidKeysByClass;

// ScriptStruct WM_InputManager_Plugin.WM_BasicDeviceInfo
// 0x0068 (0x0068 - 0x0000)
struct FWM_BasicDeviceInfo final
{
public:
	class FString                                 DeviceName;                                        // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 DN_A;                                              // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 DN_B;                                              // 0x0020(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 DN_C;                                              // 0x0030(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 DN_D;                                              // 0x0040(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 DeviceTypeString;                                  // 0x0050(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_60[0x8];                                       // 0x0060(0x0008)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_FWM_BasicDeviceInfo;

// ScriptStruct WM_InputManager_Plugin.WM_HID_DPADData
// 0x0148 (0x0148 - 0x0000)
struct alignas(0x08) FWM_HID_DPADData final
{
public:
	uint8                                         Pad_0[0x148];                                      // 0x0000(0x0148)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_FWM_HID_DPADData;

// ScriptStruct WM_InputManager_Plugin.WM_HID_DeviceInfo
// 0x00D0 (0x00D0 - 0x0000)
struct FWM_HID_DeviceInfo final
{
public:
	class FString                                 ProductString;                                     // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ManufacturerString;                                // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 SerialNumberString;                                // 0x0020(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         VID;                                               // 0x0030(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         PID;                                               // 0x0034(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Version;                                           // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Rei-SdkDumper ])
	class FString                                 VID_HEX;                                           // 0x0040(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 PID_HEX;                                           // 0x0050(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Version_HEX;                                       // 0x0060(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 VPID_HEX;                                          // 0x0070(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 VID_PID_;                                          // 0x0080(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ParserVersion;                                     // 0x0090(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_94[0x3C];                                      // 0x0094(0x003C)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_FWM_HID_DeviceInfo;

// ScriptStruct WM_InputManager_Plugin.WM_HID_XInputWrap
// 0x0050 (0x0050 - 0x0000)
struct alignas(0x08) FWM_HID_XInputWrap final
{
public:
	uint8                                         Pad_0[0x50];                                       // 0x0000(0x0050)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_FWM_HID_XInputWrap;

// ScriptStruct WM_InputManager_Plugin.WM_Keyboard_DeviceInfo
// 0x0018 (0x0018 - 0x0000)
struct alignas(0x04) FWM_Keyboard_DeviceInfo final
{
public:
	uint8                                         Pad_0[0x18];                                       // 0x0000(0x0018)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_FWM_Keyboard_DeviceInfo;

// ScriptStruct WM_InputManager_Plugin.WM_HID_AxisConfiguration
// 0x0010 (0x0010 - 0x0000)
struct FWM_HID_AxisConfiguration final
{
public:
	uint8                                         Pad_0[0x4];                                        // 0x0000(0x0004)(Fixing Size After Last Property [ Rei-SdkDumper ])
	bool                                          bInverted;                                         // 0x0004(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsPedal;                                          // 0x0005(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Rei-SdkDumper ])
	float                                         Sensitivity;                                       // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DeadZone;                                          // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FWM_HID_AxisConfiguration;

// ScriptStruct WM_InputManager_Plugin.HID_Joystick_CONFIG
// 0x01B8 (0x01B8 - 0x0000)
struct FHID_Joystick_CONFIG final
{
public:
	uint8                                         Pad_0[0x10];                                       // 0x0000(0x0010)(Fixing Size After Last Property [ Rei-SdkDumper ])
	TMap<struct FKey, EWM_GamepadKeyType>         KEY_TYPES;                                         // 0x0010(0x0050)(Edit, NativeAccessSpecifierPublic)
	uint8                                         Pad_60[0x50];                                      // 0x0060(0x0050)(Fixing Size After Last Property [ Rei-SdkDumper ])
	TMap<struct FKey, class FString>              AXIS_BINDINGS;                                     // 0x00B0(0x0050)(Edit, NativeAccessSpecifierPublic)
	TMap<struct FKey, class FString>              BUTTONS_BINDINGS;                                  // 0x0100(0x0050)(Edit, NativeAccessSpecifierPublic)
	TMap<class FString, class FString>            DPADS_BINDINGS;                                    // 0x0150(0x0050)(Edit, NativeAccessSpecifierPublic)
	TArray<struct FWM_HID_AxisConfiguration>      AxisConfigurations;                                // 0x01A0(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          RAWDataRecieved;                                   // 0x01B0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1B1[0x7];                                      // 0x01B1(0x0007)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_FHID_Joystick_CONFIG;

// ScriptStruct WM_InputManager_Plugin.Developer_HIDJoystick_Preset
// 0x00C0 (0x00C0 - 0x0000)
struct FDeveloper_HIDJoystick_Preset final
{
public:
	class FString                                 VendorID;                                          // 0x0000(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ProductID;                                         // 0x0010(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<class FString, class FString>            AxisPreset;                                        // 0x0020(0x0050)(Edit, NativeAccessSpecifierPublic)
	TMap<int32, int32>                            ButtonsPreset;                                     // 0x0070(0x0050)(Edit, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FDeveloper_HIDJoystick_Preset;

// ScriptStruct WM_InputManager_Plugin.Driver_AxisDefaults
// 0x0018 (0x0018 - 0x0000)
struct FDriver_AxisDefaults final
{
public:
	class FString                                 defaultMapping;                                    // 0x0000(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Instance;                                          // 0x0010(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          inverted;                                          // 0x0014(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          pedal;                                             // 0x0015(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_16[0x2];                                       // 0x0016(0x0002)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_FDriver_AxisDefaults;

// ScriptStruct WM_InputManager_Plugin.Developer_HIDDeviceDriver
// 0x00C0 (0x00C0 - 0x0000)
struct FDeveloper_HIDDeviceDriver final
{
public:
	TArray<struct FDriver_AxisDefaults>           AxisDefaults;                                      // 0x0000(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	class FString                                 DeviceName;                                        // 0x0010(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<struct FKey, class FString>              AxisDefaultsString;                                // 0x0020(0x0050)(Edit, NativeAccessSpecifierPublic)
	TMap<struct FKey, int32>                      ButtonsDefaults;                                   // 0x0070(0x0050)(Edit, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FDeveloper_HIDDeviceDriver;

// ScriptStruct WM_InputManager_Plugin.Driver_ButtonDefaults
// 0x0004 (0x0004 - 0x0000)
struct FDriver_ButtonDefaults final
{
public:
	int32                                         defaultIndex;                                      // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FDriver_ButtonDefaults;

}

