#pragma once

/*
* SDK generated by Rei-SdkDumper
* Based on Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WM_InputManager_Plugin

#include "Basic.hpp"

#include "Engine_classes.hpp"
#include "CoreUObject_classes.hpp"
#include "WM_InputManager_Plugin_structs.hpp"
#include "InputCore_structs.hpp"
#include "DeveloperSettings_classes.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// Class WM_InputManager_Plugin.WM_InputManagerBase
// 0x03E0 (0x0408 - 0x0028)
class UWM_InputManagerBase : public UObject
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Rei-SdkDumper ])
	class FString                                 Version;                                           // 0x0030(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_40[0x20];                                      // 0x0040(0x0020)(Fixing Size After Last Property [ Rei-SdkDumper ])
	bool                                          bEnableErrorLogs;                                  // 0x0060(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableSucessLogs;                                 // 0x0061(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnable_LOG_DEBUG_HIDP_PARSING;                    // 0x0062(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCollectRuntimeLogs;                               // 0x0063(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Rei-SdkDumper ])
	TArray<class FString>                         Runtime_PluginErrors;                              // 0x0068(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class FString>                         Runtime_PluginSucess;                              // 0x0078(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          bDevicesRegistered;                                // 0x0088(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_89[0x3];                                       // 0x0089(0x0003)(Fixing Size After Last Property [ Rei-SdkDumper ])
	int32                                         NumMessageAttempts;                                // 0x008C(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         NumFoundJoysticks_Debug;                           // 0x0090(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         NumPoolingDevices;                                 // 0x0094(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         NumWindows;                                        // 0x0098(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9C[0x4];                                       // 0x009C(0x0004)(Fixing Size After Last Property [ Rei-SdkDumper ])
	TMulticastInlineDelegate<void(const class FString& Where, const class FString& What)> DEBUG;     // 0x00A0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_B0[0x8];                                       // 0x00B0(0x0008)(Fixing Size After Last Property [ Rei-SdkDumper ])
	class UWM_Settings*                           WM_SettingsRW;                                     // 0x00B8(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EWM_InputManagerMode                          ManagerModeEnum;                                   // 0x00C0(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          hasSViewport;                                      // 0x00C1(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C2[0x6];                                       // 0x00C2(0x0006)(Fixing Size After Last Property [ Rei-SdkDumper ])
	TMulticastInlineDelegate<void(int32 ControllerId)> OnDeviceConnected;                            // 0x00C8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(int32 ControllerId)> OnDeviceDisconnected;                         // 0x00D8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const struct FKey& OnJoystickButtonTrigger)> OnJoystickButtonTrigger; // 0x00E8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(int32 OnNumDevicesChanged)> OnNumDevicesChanged;                   // 0x00F8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class UWM_Device* Device)> OnDeviceSelected;                       // 0x0108(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, BlueprintCallable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const struct FKey& WM_Key, class UWM_Device* Device)> OnButtonKeyPressed; // 0x0118(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const struct FKey& WM_Key, class UWM_Device* Device)> OnButtonKeyReleased; // 0x0128(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const class FString& ManagerMode)> OnSwitchManagerMode;            // 0x0138(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(EWM_InputManagerMode ManagerMode)> OnSwitchManagerModeEnum;        // 0x0148(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(int32 NumberOfPlayers)> OnSetNumberOfPlayers;                      // 0x0158(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              On_WM_InputManagerBegin;                           // 0x0168(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              On_WM_InputManagerEnd;                             // 0x0178(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const struct FKey& Key, bool Start)> OnListenForKeyInput;          // 0x0188(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class FString                                 ManagerMode;                                       // 0x0198(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         NumberOfPlayers;                                   // 0x01A8(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1AC[0x4];                                      // 0x01AC(0x0004)(Fixing Size After Last Property [ Rei-SdkDumper ])
	class UWM_Device*                             SelectedDevice;                                    // 0x01B0(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UInputSettings*                         InputSettings;                                     // 0x01B8(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayerInput*                           PlayerInput_Ref;                                   // 0x01C0(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UWM_Device*>                     All_DevicesList;                                   // 0x01C8(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	TMap<int32, class UWM_Device_HID*>            HID_DeviceList;                                    // 0x01D8(0x0050)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	TMap<int32, class UWM_HID_Joystick*>          Joystick_DeviceList;                               // 0x0228(0x0050)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	TMap<int32, class UWM_Device_Keyboard*>       Keyboard_DevicesList;                              // 0x0278(0x0050)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	TMap<int32, class UWM_Device*>                Mouse_DeviceList;                                  // 0x02C8(0x0050)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	TMap<int32, class UWM_HID_Joystick*>          Joystick_UniqueDeviceTypeList;                     // 0x0318(0x0050)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	TMap<int32, class UWM_Device_HID*>            XInputDevices;                                     // 0x0368(0x0050)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	TMap<int32, struct F_PCS_Device>              PC_Devices;                                        // 0x03B8(0x0050)(Transient, NativeAccessSpecifierPublic)

public:
	void GetActionInputs(TArray<class FName>* ButtonInputs);
	void GetActionsListStringForKey(const struct FKey& Key, class FString* ActionsListString);
	void GetAllInputBindingsForKey(const struct FKey& Key, TArray<class FName>* ActionsForKey);
	void GetAllKeysForAction(class FName ActionName, TArray<struct FKey>* Bindings);
	void GetAllKeysForAxis(class FName ActionName, TArray<struct FKey>* Bindings);
	void GetAxisInputs(TArray<class FName>* InputAxisActions);
	void InitializeAPI();
	void OnDeviceButtonKeyEvent(const struct FKey& WM_Key, class UWM_Device* Device, EWM_KeyTriggerState* TriggerState);
	void SetNumberOfPlayers(int32 NumPlayers);
	void SwitchManagerMode(const class FString& Mode);
	void SwitchManagerModeEnum(EWM_InputManagerMode Mode);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("WM_InputManagerBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WM_InputManagerBase")
	}
	static class UWM_InputManagerBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWM_InputManagerBase>();
	}
};
DUMPER7_ASSERTS_UWM_InputManagerBase;

// Class WM_InputManager_Plugin.WM_ControllerFunctionLib
// 0x0000 (0x0028 - 0x0028)
class UWM_ControllerFunctionLib final : public UBlueprintFunctionLibrary
{
public:
	static class UWM_InputManager* Get_WM_InputManager();
	static class FName GetKeyName(const struct FKey& InKey);
	static void PrintDevicesInfo();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("WM_ControllerFunctionLib")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WM_ControllerFunctionLib")
	}
	static class UWM_ControllerFunctionLib* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWM_ControllerFunctionLib>();
	}
};
DUMPER7_ASSERTS_UWM_ControllerFunctionLib;

// Class WM_InputManager_Plugin.WM_Device
// 0x00F8 (0x0120 - 0x0028)
class UWM_Device : public UObject
{
public:
	class UWM_InputManager*                       InputManager;                                      // 0x0028(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UWM_Settings*                           WM_SettingsRW;                                     // 0x0030(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FWM_BasicDeviceInfo                    BasicDeviceInfo;                                   // 0x0038(0x0068)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnRawDataInitialized;                              // 0x00A0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	bool                                          Enabled;                                           // 0x00B0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          RawDataWasInitialized;                             // 0x00B1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B2[0x6];                                       // 0x00B2(0x0006)(Fixing Size After Last Property [ Rei-SdkDumper ])
	class FString                                 SAVESTRING;                                        // 0x00B8(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EWM_DeviceType                                DeviceType;                                        // 0x00C8(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C9[0x3];                                       // 0x00C9(0x0003)(Fixing Size After Last Property [ Rei-SdkDumper ])
	int32                                         DeviceSlot;                                        // 0x00CC(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         UniqueDeviceSlot;                                  // 0x00D0(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ControllerAssigment;                               // 0x00D4(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          DeviceActivityDetected;                            // 0x00D8(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsSelected;                                        // 0x00D9(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_DA[0x2E];                                      // 0x00DA(0x002E)(Fixing Size After Last Property [ Rei-SdkDumper ])
	class FString                                 UniqueHandleString;                                // 0x0108(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         packetNum;                                         // 0x0118(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11C[0x4];                                      // 0x011C(0x0004)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])

public:
	void AssignDeviceToPlayerIndex(int32 Index_0);
	void ClearDeviceInput();
	bool isValidPlayerIndex();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("WM_Device")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WM_Device")
	}
	static class UWM_Device* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWM_Device>();
	}
};
DUMPER7_ASSERTS_UWM_Device;

// Class WM_InputManager_Plugin.WM_Device_HID
// 0x08F0 (0x0A10 - 0x0120)
class UWM_Device_HID : public UWM_Device
{
public:
	struct FWM_HID_DeviceInfo                     DeviceInfo;                                        // 0x0120(0x00D0)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	bool                                          is_XInput;                                         // 0x01F0(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          is_XInputInitialized;                              // 0x01F1(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          is_XInputSlotGuess;                                // 0x01F2(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1F3[0x1];                                      // 0x01F3(0x0001)(Fixing Size After Last Property [ Rei-SdkDumper ])
	int32                                         X_I_D;                                             // 0x01F4(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          is_Steam;                                          // 0x01F8(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1F9[0x5D7];                                    // 0x01F9(0x05D7)(Fixing Size After Last Property [ Rei-SdkDumper ])
	int32                                         FirstPressedRawKey;                                // 0x07D0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_7D4[0x23C];                                    // 0x07D4(0x023C)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])

public:
	TArray<int32> GetRaw_Available_Axes();
	TArray<int32> GetRaw_Available_Buttons();
	TArray<int32> GetRaw_Available_DPADs();
	void GetRaw_ButtonValue(int32 Index_0, bool* ButtonValue, EWM_KeyTriggerState* KeyTriggerState);

	void GetAxisKeyValue(const struct FKey& Key, float* AxisValue, bool* isValid_WM_Key) const;
	void GetButtonKeyValue(const struct FKey& Key, bool* ButtonValue, bool* isValid_WM_Key) const;
	struct FWM_HID_AxisData GetRaw_AxisData(int32 Index_0) const;
	float GetRaw_AxisValue(int32 Index_0) const;
	void GetRaw_DPADData(int32 Index_0, bool* Up, bool* Down, bool* Left, bool* Right, EWM_AxisCodeTable* axisEnum, class FString* AxisBindingCode, class FString* axisHEX, int32* Instance, float* Value) const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("WM_Device_HID")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WM_Device_HID")
	}
	static class UWM_Device_HID* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWM_Device_HID>();
	}
};
DUMPER7_ASSERTS_UWM_Device_HID;

// Class WM_InputManager_Plugin.WM_Device_Keyboard
// 0x0000 (0x0120 - 0x0120)
class UWM_Device_Keyboard final : public UWM_Device
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("WM_Device_Keyboard")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WM_Device_Keyboard")
	}
	static class UWM_Device_Keyboard* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWM_Device_Keyboard>();
	}
};
DUMPER7_ASSERTS_UWM_Device_Keyboard;

// Class WM_InputManager_Plugin.WM_Device_Mouse
// 0x0000 (0x0120 - 0x0120)
class UWM_Device_Mouse final : public UWM_Device
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("WM_Device_Mouse")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WM_Device_Mouse")
	}
	static class UWM_Device_Mouse* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWM_Device_Mouse>();
	}
};
DUMPER7_ASSERTS_UWM_Device_Mouse;

// Class WM_InputManager_Plugin.WM_HID_Joystick
// 0x0068 (0x0A78 - 0x0A10)
class UWM_HID_Joystick final : public UWM_Device_HID
{
public:
	uint8                                         Pad_A10[0x18];                                     // 0x0A10(0x0018)(Fixing Size After Last Property [ Rei-SdkDumper ])
	int32                                         ConfigMode;                                        // 0x0A28(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A2C[0x4];                                      // 0x0A2C(0x0004)(Fixing Size After Last Property [ Rei-SdkDumper ])
	TMulticastInlineDelegate<void(int32 Mode)>    OnModeSwitched;                                    // 0x0A30(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(int32 Mode)>    OnConfigChanged;                                   // 0x0A40(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	bool                                          bIsListeningForInput;                              // 0x0A50(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A51[0x7];                                      // 0x0A51(0x0007)(Fixing Size After Last Property [ Rei-SdkDumper ])
	struct FKey                                   ListeningKey;                                      // 0x0A58(0x0018)(BlueprintVisible, BlueprintReadOnly, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UWM_HID_Joystick_SAV*                   savedata;                                          // 0x0A70(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void AutodetectAxisConfig(int32 Axis);
	void Bind_InputKey(const struct FKey& Key, const class FString& TargetBinding);
	void GetAxisConfig(int32 AxisNumber, struct FWM_HID_AxisConfiguration* Config);
	void GetBinding(const struct FKey& Key, class FString* BINDING);
	void GetBindingOptions(const struct FKey& Key, TArray<class FString>* Options);
	void GetConfigurationMode(int32* ConfigurationMode);
	void ListenForKeyInput(const struct FKey& Key, bool* sucess);
	void PressButton(int32 Button);
	void RebindKeyInput(const struct FKey& Key, bool* sucess);
	void ResetAxisConfig(int32 Axis);
	void ResetConfigurationMode();
	void SaveConfig();
	void SetAxisConfig(int32 AxisNumber, const struct FWM_HID_AxisConfiguration& Config);
	void SetConfigurationMode(int32 ConfigurationMode);
	void UpdateAxisValue(int32 Axis);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("WM_HID_Joystick")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WM_HID_Joystick")
	}
	static class UWM_HID_Joystick* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWM_HID_Joystick>();
	}
};
DUMPER7_ASSERTS_UWM_HID_Joystick;

// Class WM_InputManager_Plugin.WM_HID_Joystick_SAV
// 0x0078 (0x00A0 - 0x0028)
class UWM_HID_Joystick_SAV final : public USaveGame
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Rei-SdkDumper ])
	bool                                          wasInitialized;                                    // 0x0030(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Rei-SdkDumper ])
	class FString                                 saveSlot;                                          // 0x0038(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         CurrentMode;                                       // 0x0048(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Rei-SdkDumper ])
	TMap<int32, struct FHID_Joystick_CONFIG>      HID_JoystickConfig;                                // 0x0050(0x0050)(NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("WM_HID_Joystick_SAV")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WM_HID_Joystick_SAV")
	}
	static class UWM_HID_Joystick_SAV* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWM_HID_Joystick_SAV>();
	}
};
DUMPER7_ASSERTS_UWM_HID_Joystick_SAV;

// Class WM_InputManager_Plugin.WM_InputManager
// 0x0328 (0x0730 - 0x0408)
class UWM_InputManager final : public UWM_InputManagerBase
{
public:
	uint8                                         Pad_408[0x18];                                     // 0x0408(0x0018)(Fixing Size After Last Property [ Rei-SdkDumper ])
	TMap<TSubclassOf<class UClass>, struct FHidKeysByClass> HidInputKeys_ByClass;                    // 0x0420(0x0050)(Transient, NativeAccessSpecifierPublic)
	uint8                                         Pad_470[0x50];                                     // 0x0470(0x0050)(Fixing Size After Last Property [ Rei-SdkDumper ])
	TMap<class FString, struct FDefaultDeviceMappings> DefaultMappings;                              // 0x04C0(0x0050)(Transient, NativeAccessSpecifierPublic)
	TMap<struct FKey, EWM_GamepadKeyType>         HIDJoystick_KeysByType;                            // 0x0510(0x0050)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	TMap<struct FKey, class FString>              HIDJoystick_Axes;                                  // 0x0560(0x0050)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	TMap<struct FKey, class FString>              HIDJoystick_Buttons;                               // 0x05B0(0x0050)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	TMap<class FString, struct FDPADCollection>   HIDJoystick_DPADs;                                 // 0x0600(0x0050)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	TMap<class FString, class FString>            HIDJoystick_DPADDefaults;                          // 0x0650(0x0050)(Transient, NativeAccessSpecifierPublic)
	TMap<struct FKey, class FString>              HIDJoystick_DPADButtons;                           // 0x06A0(0x0050)(Transient, NativeAccessSpecifierPublic)
	bool                                          EnableHIDInternalButtonEvents;                     // 0x06F0(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EWM_InputManagerStatus                        status;                                            // 0x06F1(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_6F2[0x2];                                      // 0x06F2(0x0002)(Fixing Size After Last Property [ Rei-SdkDumper ])
	int32                                         numGamepads;                                       // 0x06F4(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         numKeyboards;                                      // 0x06F8(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         numMouses;                                         // 0x06FC(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         AutoAssignDevicesByDeviceSlot;                     // 0x0700(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_704[0x14];                                     // 0x0704(0x0014)(Fixing Size After Last Property [ Rei-SdkDumper ])
	bool                                          ShowOnlyUsedInputs;                                // 0x0718(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_719[0x7];                                      // 0x0719(0x0007)(Fixing Size After Last Property [ Rei-SdkDumper ])
	class FString                                 CurrentProfileName;                                // 0x0720(0x0010)(ZeroConstructor, Transient, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	void BeginUMG();
	EWM_GamepadKeyType Get_HidJoystickKeyType(const struct FKey& Key);
	class UWM_HID_Joystick* GetActiveHID();
	class FString GetCurrentProfileName();
	class UWM_Device* GetSelectedDevice();
	class UWM_HID_Joystick* GetSelectedGamepad();
	void LoadProfile(const class FString& ProfileName);
	void SelectDevice(class UWM_Device* deviceToSelect);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("WM_InputManager")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WM_InputManager")
	}
	static class UWM_InputManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWM_InputManager>();
	}
};
DUMPER7_ASSERTS_UWM_InputManager;

// Class WM_InputManager_Plugin.WM_Settings
// 0x0090 (0x00C8 - 0x0038)
class UWM_Settings final : public UDeveloperSettings
{
public:
	uint8                                         Pad_38[0x20];                                      // 0x0038(0x0020)(Fixing Size After Last Property [ Rei-SdkDumper ])
	int32                                         DefaultPlayerIndex_DeviceAssigment;                // 0x0058(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DefaultSensitivity;                                // 0x005C(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DefaultDeadzone;                                   // 0x0060(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bENABLE_AUTO_BUTTON_RELEASE;                       // 0x0064(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          logConnectDisconnect;                              // 0x0065(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          InitAPI_Manually;                                  // 0x0066(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          SupportMe;                                         // 0x0067(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FString>                         AllowVendorIds;                                    // 0x0068(0x0010)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPublic)
	uint8                                         Pad_78[0x50];                                      // 0x0078(0x0050)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("WM_Settings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WM_Settings")
	}
	static class UWM_Settings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWM_Settings>();
	}
};
DUMPER7_ASSERTS_UWM_Settings;

// Class WM_InputManager_Plugin.WM_UmgBase
// 0x0000 (0x0280 - 0x0280)
class UWM_UmgBase final : public UUserWidget
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("WM_UmgBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WM_UmgBase")
	}
	static class UWM_UmgBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWM_UmgBase>();
	}
};
DUMPER7_ASSERTS_UWM_UmgBase;

}

