#pragma once

/*
* SDK generated by Rei-SdkDumper
* Based on Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WM_InputManager_Plugin

#include "Basic.hpp"

#include "InputCore_structs.hpp"
#include "WM_InputManager_Plugin_structs.hpp"


namespace SDK::Params
{

// Function WM_InputManager_Plugin.WM_InputManagerBase.GetActionInputs
// 0x0010 (0x0010 - 0x0000)
struct WM_InputManagerBase_GetActionInputs final
{
public:
	TArray<class FName>                           ButtonInputs;                                      // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_WM_InputManagerBase_GetActionInputs;

// Function WM_InputManager_Plugin.WM_InputManagerBase.GetActionsListStringForKey
// 0x0028 (0x0028 - 0x0000)
struct WM_InputManagerBase_GetActionsListStringForKey final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(Parm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ActionsListString;                                 // 0x0018(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_WM_InputManagerBase_GetActionsListStringForKey;

// Function WM_InputManager_Plugin.WM_InputManagerBase.GetAllInputBindingsForKey
// 0x0028 (0x0028 - 0x0000)
struct WM_InputManagerBase_GetAllInputBindingsForKey final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(Parm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FName>                           ActionsForKey;                                     // 0x0018(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_WM_InputManagerBase_GetAllInputBindingsForKey;

// Function WM_InputManager_Plugin.WM_InputManagerBase.GetAllKeysForAction
// 0x0018 (0x0018 - 0x0000)
struct WM_InputManagerBase_GetAllKeysForAction final
{
public:
	class FName                                   ActionName;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FKey>                           Bindings;                                          // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_WM_InputManagerBase_GetAllKeysForAction;

// Function WM_InputManager_Plugin.WM_InputManagerBase.GetAllKeysForAxis
// 0x0018 (0x0018 - 0x0000)
struct WM_InputManagerBase_GetAllKeysForAxis final
{
public:
	class FName                                   ActionName;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FKey>                           Bindings;                                          // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_WM_InputManagerBase_GetAllKeysForAxis;

// Function WM_InputManager_Plugin.WM_InputManagerBase.GetAxisInputs
// 0x0010 (0x0010 - 0x0000)
struct WM_InputManagerBase_GetAxisInputs final
{
public:
	TArray<class FName>                           InputAxisActions;                                  // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_WM_InputManagerBase_GetAxisInputs;

// Function WM_InputManager_Plugin.WM_InputManagerBase.OnDeviceButtonKeyEvent
// 0x0028 (0x0028 - 0x0000)
struct WM_InputManagerBase_OnDeviceButtonKeyEvent final
{
public:
	struct FKey                                   WM_Key;                                            // 0x0000(0x0018)(Parm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UWM_Device*                             Device;                                            // 0x0018(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EWM_KeyTriggerState                           TriggerState;                                      // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_WM_InputManagerBase_OnDeviceButtonKeyEvent;

// Function WM_InputManager_Plugin.WM_InputManagerBase.SetNumberOfPlayers
// 0x0004 (0x0004 - 0x0000)
struct WM_InputManagerBase_SetNumberOfPlayers final
{
public:
	int32                                         NumPlayers;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_WM_InputManagerBase_SetNumberOfPlayers;

// Function WM_InputManager_Plugin.WM_InputManagerBase.SwitchManagerMode
// 0x0010 (0x0010 - 0x0000)
struct WM_InputManagerBase_SwitchManagerMode final
{
public:
	class FString                                 Mode;                                              // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_WM_InputManagerBase_SwitchManagerMode;

// Function WM_InputManager_Plugin.WM_InputManagerBase.SwitchManagerModeEnum
// 0x0001 (0x0001 - 0x0000)
struct WM_InputManagerBase_SwitchManagerModeEnum final
{
public:
	EWM_InputManagerMode                          Mode;                                              // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_WM_InputManagerBase_SwitchManagerModeEnum;

// Function WM_InputManager_Plugin.WM_ControllerFunctionLib.Get_WM_InputManager
// 0x0008 (0x0008 - 0x0000)
struct WM_ControllerFunctionLib_Get_WM_InputManager final
{
public:
	class UWM_InputManager*                       ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_WM_ControllerFunctionLib_Get_WM_InputManager;

// Function WM_InputManager_Plugin.WM_ControllerFunctionLib.GetKeyName
// 0x0020 (0x0020 - 0x0000)
struct WM_ControllerFunctionLib_GetKeyName final
{
public:
	struct FKey                                   InKey;                                             // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   ReturnValue;                                       // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_WM_ControllerFunctionLib_GetKeyName;

// Function WM_InputManager_Plugin.WM_Device.AssignDeviceToPlayerIndex
// 0x0004 (0x0004 - 0x0000)
struct WM_Device_AssignDeviceToPlayerIndex final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_WM_Device_AssignDeviceToPlayerIndex;

// Function WM_InputManager_Plugin.WM_Device.isValidPlayerIndex
// 0x0001 (0x0001 - 0x0000)
struct WM_Device_isValidPlayerIndex final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_WM_Device_isValidPlayerIndex;

// Function WM_InputManager_Plugin.WM_Device_HID.GetRaw_Available_Axes
// 0x0010 (0x0010 - 0x0000)
struct WM_Device_HID_GetRaw_Available_Axes final
{
public:
	TArray<int32>                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_WM_Device_HID_GetRaw_Available_Axes;

// Function WM_InputManager_Plugin.WM_Device_HID.GetRaw_Available_Buttons
// 0x0010 (0x0010 - 0x0000)
struct WM_Device_HID_GetRaw_Available_Buttons final
{
public:
	TArray<int32>                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_WM_Device_HID_GetRaw_Available_Buttons;

// Function WM_InputManager_Plugin.WM_Device_HID.GetRaw_Available_DPADs
// 0x0010 (0x0010 - 0x0000)
struct WM_Device_HID_GetRaw_Available_DPADs final
{
public:
	TArray<int32>                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_WM_Device_HID_GetRaw_Available_DPADs;

// Function WM_InputManager_Plugin.WM_Device_HID.GetRaw_ButtonValue
// 0x0008 (0x0008 - 0x0000)
struct WM_Device_HID_GetRaw_ButtonValue final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ButtonValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EWM_KeyTriggerState                           KeyTriggerState;                                   // 0x0005(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_WM_Device_HID_GetRaw_ButtonValue;

// Function WM_InputManager_Plugin.WM_Device_HID.GetAxisKeyValue
// 0x0020 (0x0020 - 0x0000)
struct WM_Device_HID_GetAxisKeyValue final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(Parm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AxisValue;                                         // 0x0018(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          isValid_WM_Key;                                    // 0x001C(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_WM_Device_HID_GetAxisKeyValue;

// Function WM_InputManager_Plugin.WM_Device_HID.GetButtonKeyValue
// 0x0020 (0x0020 - 0x0000)
struct WM_Device_HID_GetButtonKeyValue final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(Parm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ButtonValue;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          isValid_WM_Key;                                    // 0x0019(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_WM_Device_HID_GetButtonKeyValue;

// Function WM_InputManager_Plugin.WM_Device_HID.GetRaw_AxisData
// 0x00A0 (0x00A0 - 0x0000)
struct WM_Device_HID_GetRaw_AxisData final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Rei-SdkDumper ])
	struct FWM_HID_AxisData                       ReturnValue;                                       // 0x0008(0x0098)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_WM_Device_HID_GetRaw_AxisData;

// Function WM_InputManager_Plugin.WM_Device_HID.GetRaw_AxisValue
// 0x0008 (0x0008 - 0x0000)
struct WM_Device_HID_GetRaw_AxisValue final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_WM_Device_HID_GetRaw_AxisValue;

// Function WM_InputManager_Plugin.WM_Device_HID.GetRaw_DPADData
// 0x0038 (0x0038 - 0x0000)
struct WM_Device_HID_GetRaw_DPADData final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Up;                                                // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Down;                                              // 0x0005(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Left;                                              // 0x0006(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Right;                                             // 0x0007(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EWM_AxisCodeTable                             axisEnum;                                          // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Rei-SdkDumper ])
	class FString                                 AxisBindingCode;                                   // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 axisHEX;                                           // 0x0020(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Instance;                                          // 0x0030(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Value;                                             // 0x0034(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_WM_Device_HID_GetRaw_DPADData;

// Function WM_InputManager_Plugin.WM_HID_Joystick.AutodetectAxisConfig
// 0x0004 (0x0004 - 0x0000)
struct WM_HID_Joystick_AutodetectAxisConfig final
{
public:
	int32                                         Axis;                                              // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_WM_HID_Joystick_AutodetectAxisConfig;

// Function WM_InputManager_Plugin.WM_HID_Joystick.Bind_InputKey
// 0x0028 (0x0028 - 0x0000)
struct WM_HID_Joystick_Bind_InputKey final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(Parm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 TargetBinding;                                     // 0x0018(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_WM_HID_Joystick_Bind_InputKey;

// Function WM_InputManager_Plugin.WM_HID_Joystick.GetAxisConfig
// 0x0014 (0x0014 - 0x0000)
struct WM_HID_Joystick_GetAxisConfig final
{
public:
	int32                                         AxisNumber;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FWM_HID_AxisConfiguration              Config;                                            // 0x0004(0x0010)(Parm, OutParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_WM_HID_Joystick_GetAxisConfig;

// Function WM_InputManager_Plugin.WM_HID_Joystick.GetBinding
// 0x0028 (0x0028 - 0x0000)
struct WM_HID_Joystick_GetBinding final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(Parm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 BINDING;                                           // 0x0018(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_WM_HID_Joystick_GetBinding;

// Function WM_InputManager_Plugin.WM_HID_Joystick.GetBindingOptions
// 0x0028 (0x0028 - 0x0000)
struct WM_HID_Joystick_GetBindingOptions final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(Parm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FString>                         Options;                                           // 0x0018(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_WM_HID_Joystick_GetBindingOptions;

// Function WM_InputManager_Plugin.WM_HID_Joystick.GetConfigurationMode
// 0x0004 (0x0004 - 0x0000)
struct WM_HID_Joystick_GetConfigurationMode final
{
public:
	int32                                         ConfigurationMode;                                 // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_WM_HID_Joystick_GetConfigurationMode;

// Function WM_InputManager_Plugin.WM_HID_Joystick.ListenForKeyInput
// 0x0020 (0x0020 - 0x0000)
struct WM_HID_Joystick_ListenForKeyInput final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(Parm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          sucess;                                            // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_WM_HID_Joystick_ListenForKeyInput;

// Function WM_InputManager_Plugin.WM_HID_Joystick.PressButton
// 0x0004 (0x0004 - 0x0000)
struct WM_HID_Joystick_PressButton final
{
public:
	int32                                         Button;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_WM_HID_Joystick_PressButton;

// Function WM_InputManager_Plugin.WM_HID_Joystick.RebindKeyInput
// 0x0020 (0x0020 - 0x0000)
struct WM_HID_Joystick_RebindKeyInput final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(Parm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          sucess;                                            // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_WM_HID_Joystick_RebindKeyInput;

// Function WM_InputManager_Plugin.WM_HID_Joystick.ResetAxisConfig
// 0x0004 (0x0004 - 0x0000)
struct WM_HID_Joystick_ResetAxisConfig final
{
public:
	int32                                         Axis;                                              // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_WM_HID_Joystick_ResetAxisConfig;

// Function WM_InputManager_Plugin.WM_HID_Joystick.SetAxisConfig
// 0x0014 (0x0014 - 0x0000)
struct WM_HID_Joystick_SetAxisConfig final
{
public:
	int32                                         AxisNumber;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FWM_HID_AxisConfiguration              Config;                                            // 0x0004(0x0010)(Parm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_WM_HID_Joystick_SetAxisConfig;

// Function WM_InputManager_Plugin.WM_HID_Joystick.SetConfigurationMode
// 0x0004 (0x0004 - 0x0000)
struct WM_HID_Joystick_SetConfigurationMode final
{
public:
	int32                                         ConfigurationMode;                                 // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_WM_HID_Joystick_SetConfigurationMode;

// Function WM_InputManager_Plugin.WM_HID_Joystick.UpdateAxisValue
// 0x0004 (0x0004 - 0x0000)
struct WM_HID_Joystick_UpdateAxisValue final
{
public:
	int32                                         Axis;                                              // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_WM_HID_Joystick_UpdateAxisValue;

// Function WM_InputManager_Plugin.WM_InputManager.Get_HidJoystickKeyType
// 0x0020 (0x0020 - 0x0000)
struct WM_InputManager_Get_HidJoystickKeyType final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(Parm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EWM_GamepadKeyType                            ReturnValue;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_WM_InputManager_Get_HidJoystickKeyType;

// Function WM_InputManager_Plugin.WM_InputManager.GetActiveHID
// 0x0008 (0x0008 - 0x0000)
struct WM_InputManager_GetActiveHID final
{
public:
	class UWM_HID_Joystick*                       ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_WM_InputManager_GetActiveHID;

// Function WM_InputManager_Plugin.WM_InputManager.GetCurrentProfileName
// 0x0010 (0x0010 - 0x0000)
struct WM_InputManager_GetCurrentProfileName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_WM_InputManager_GetCurrentProfileName;

// Function WM_InputManager_Plugin.WM_InputManager.GetSelectedDevice
// 0x0008 (0x0008 - 0x0000)
struct WM_InputManager_GetSelectedDevice final
{
public:
	class UWM_Device*                             ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_WM_InputManager_GetSelectedDevice;

// Function WM_InputManager_Plugin.WM_InputManager.GetSelectedGamepad
// 0x0008 (0x0008 - 0x0000)
struct WM_InputManager_GetSelectedGamepad final
{
public:
	class UWM_HID_Joystick*                       ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_WM_InputManager_GetSelectedGamepad;

// Function WM_InputManager_Plugin.WM_InputManager.LoadProfile
// 0x0010 (0x0010 - 0x0000)
struct WM_InputManager_LoadProfile final
{
public:
	class FString                                 ProfileName;                                       // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_WM_InputManager_LoadProfile;

// Function WM_InputManager_Plugin.WM_InputManager.SelectDevice
// 0x0008 (0x0008 - 0x0000)
struct WM_InputManager_SelectDevice final
{
public:
	class UWM_Device*                             deviceToSelect;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_WM_InputManager_SelectDevice;

}

