#pragma once

/*
* SDK generated by Rei-SdkDumper
* Based on Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Wwise

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "Wwise_structs.hpp"
#include "CoreUObject_classes.hpp"


namespace SDK
{

// Class Wwise.WwiseAmbientSound
// 0x0020 (0x0248 - 0x0228)
class AWwiseAmbientSound final : public AActor
{
public:
	uint8                                         Pad_228[0x20];                                     // 0x0228(0x0020)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])

public:
	bool IsPlaying();
	bool IsPlayingT();
	void StartPlay();
	void StopPlay();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("WwiseAmbientSound")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WwiseAmbientSound")
	}
	static class AWwiseAmbientSound* GetDefaultObj()
	{
		return GetDefaultObjImpl<AWwiseAmbientSound>();
	}
};
DUMPER7_ASSERTS_AWwiseAmbientSound;

// Class Wwise.WwiseComponent
// 0x0260 (0x0460 - 0x0200)
class UWwiseComponent final : public USceneComponent
{
public:
	uint8                                         bUseSpatialAudio : 1;                              // 0x01F8(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bUseReverbVolumes : 1;                             // 0x01F8(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bUseDefaultListeners : 1;                          // 0x01F8(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_1F9[0x3];                                      // 0x01F9(0x0003)(Fixing Size After Last Property [ Rei-SdkDumper ])
	float                                         AttenuationScalingFactor;                          // 0x01FC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bEnableSpotReflectors : 1;                         // 0x0200(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_201[0x7];                                      // 0x0201(0x0007)(Fixing Size After Last Property [ Rei-SdkDumper ])
	class FString                                 ReflectionAuxBus;                                  // 0x0208(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 EventName;                                         // 0x0218(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReflectionOrder;                                   // 0x0228(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReflectionBusSendGain;                             // 0x022C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReflectionMaxPathLength;                           // 0x0230(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReverbAuxBusGain;                                  // 0x0234(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         DiffractionMaxEdges;                               // 0x0238(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         DiffractionMaxPaths;                               // 0x023C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DiffractionMaxPathLength;                          // 0x0240(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ECollisionChannel                             CollisionChannel;                                  // 0x0244(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_245[0x3];                                      // 0x0245(0x0003)(Fixing Size After Last Property [ Rei-SdkDumper ])
	float                                         CollisionCheckInterval;                            // 0x0248(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bAutoDestroy : 1;                                  // 0x024C(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bIsDefaultListener : 1;                            // 0x024C(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_24D[0x3];                                      // 0x024D(0x0003)(Fixing Size After Last Property [ Rei-SdkDumper ])
	TSet<class UWwiseComponent*>                  Listeners;                                         // 0x0250(0x0050)(ExportObject, Transient, ContainsInstancedReference, NativeAccessSpecifierPublic)
	TSet<class UWwiseComponent*>                  Emitters;                                          // 0x02A0(0x0050)(ExportObject, Transient, ContainsInstancedReference, NativeAccessSpecifierPublic)
	uint8                                         Pad_2F0[0x170];                                    // 0x02F0(0x0170)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])

public:
	static void SetbDefaultUseSpatialAudio(bool bInDefaultUseSpatialAudio);

	bool IsPlayingSomething();
	void PauseWithTransition(int32 InTransitionMS);
	void PostEvent(const class FString& InEventName);
	int32 PostEventWithCallback(const class FString& InEventName, const TDelegate<void(class UWwiseComponent* WwiseComponent)>& OnEndPlay, bool bEnablePlayInfo);
	void PostTrigger(const class FString& InTriggerName);
	void RestoreDefaultVolume(const class FString& InRTPCName, float InDurationSec);
	void ResumeWithTransition(int32 InTransitionMS);
	void SetAttenuationScalingFactor(float InValue);
	void SetRTPCValue(const class FString& InRTPCName, float InValue, int32 InInterpMS, ERTPCValueCurveType InCurveType);
	void SetSwitch(const class FString& InSwitchGroup, const class FString& InSwitchState);
	void SetUseSpatialAudio(const bool bNewEnable);
	void SetVolume(float InVolumeValue, float InDurationSec, const class FString& InRTPCName, bool bInBasedDefaultVolume);
	void SetVolumeMultipleBasedDefault(const class FString& InRTPCName, float InMultiple, float InDurationSec);
	void Stop(bool bInvokeCallbacks);
	void StopWithTransition(int32 InTransitionMS, bool bInvokeCallbacks);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("WwiseComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WwiseComponent")
	}
	static class UWwiseComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWwiseComponent>();
	}
};
DUMPER7_ASSERTS_UWwiseComponent;

// Class Wwise.WwiseLateReverbComponent
// 0x0080 (0x0280 - 0x0200)
class UWwiseLateReverbComponent final : public USceneComponent
{
public:
	uint8                                         bEnabled : 1;                                      // 0x01F8(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_1F9[0x7];                                      // 0x01F9(0x0007)(Fixing Size After Last Property [ Rei-SdkDumper ])
	class FString                                 AuxBusName;                                        // 0x0200(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SendLevel;                                         // 0x0210(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FadeRate;                                          // 0x0214(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Priority;                                          // 0x0218(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21C[0x4];                                      // 0x021C(0x0004)(Fixing Size After Last Property [ Rei-SdkDumper ])
	class FString                                 EnterSwitchGroup;                                  // 0x0220(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 EnterSwitch;                                       // 0x0230(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 LeaveSwitchGroup;                                  // 0x0240(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 LeaveSwitch;                                       // 0x0250(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bHasSwitch : 1;                                    // 0x0260(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_261[0x7];                                      // 0x0261(0x0007)(Fixing Size After Last Property [ Rei-SdkDumper ])
	class UWwiseLateReverbComponent*              NextLowerPriorityLateReverb;                       // 0x0268(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AVolume*                                Volume;                                            // 0x0270(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_278[0x8];                                      // 0x0278(0x0008)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("WwiseLateReverbComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WwiseLateReverbComponent")
	}
	static class UWwiseLateReverbComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWwiseLateReverbComponent>();
	}
};
DUMPER7_ASSERTS_UWwiseLateReverbComponent;

// Class Wwise.WwiseLibrary
// 0x0000 (0x0028 - 0x0028)
class UWwiseLibrary final : public UBlueprintFunctionLibrary
{
public:
	static void AddDefaultListener(class UWwiseComponent* InWwiseComponent);
	static void AddSequenceWwiseComponent(class UWwiseComponent* InComponent);
	static void AsyncLoadBankByBank(const TArray<int32>& InBankIds);
	static void AsyncLoadBankByEvent(const TArray<class FString>& InEventNames);
	static void AsyncUnloadBanksByEvent(const TArray<class FString>& InEventNames);
	static void ClearAllModifiedBankLanguage(bool bInUnloadBank);
	static void ClearModifiedBankLanguage(const class FString& InBankName, bool bInUnloadBank);
	static void ClearSequcneWwiseComponents(bool bInStop);
	static int32 GetBankByEvent(const class FString& InEventName);
	static class FString GetBankNameByEvent(const class FString& InEventName);
	static float GetEventDuration(const class FString& InEventName);
	static class FString GetLanguage();
	static const class FString GetModifiedBankLanguage(const class FString& InBankName);
	static const class FString GetModifiedBankLanguageByID(int32 InBankID);
	static TArray<class FString> GetRecordEventNames();
	static float GetVolumeScale(const class FString& InBusName);
	static EWwiseActorType GetWwiseActorType(class UObject* InWorldContext);
	static EWwiseQuality GetWwiseQuality();
	static void Init();
	static bool IsDisable();
	static bool IsExceededMaxNumOfPlayEvent(const class FString& InEventName);
	static bool IsExistVoiceEvent(const class FString& InVoiceEventName);
	static bool IsLoopedEvent(const class FString& InEventName);
	static bool IsLowAmmunitionEffect(EWwiseQuality InWwiseQuality);
	static bool IsSupportAsyncLoadBank();
	static bool IsWwiseQuality(EWwiseQuality InWwiseQuality);
	static void LoadBanksByBank(const TArray<int32>& InBankIds);
	static void LoadBanksByEvent(const TArray<class FString>& InEventNames);
	static void LoadPlayEventNumLimitConfig();
	static void PauseAllWwiseEvents(int32 InTransitionDuration);
	static void PauseOnEvent(const class FString& InEventName, int32 InTransitionDuration);
	static void PauseOnPlayingID(int32 InPlayingID, int32 InTransitionDuration);
	static void PauseSequcneWwiseComponents(int32 InTransitionDuration);
	static class UWwiseComponent* PostEvent2D(class UObject* InWorldContext, const class FString& InEventName);
	static class UWwiseComponent* PostEvent2DInSequence(class UObject* InWorldContext, const class FString& InEventName);
	static class UWwiseComponent* PostEvent2DWithCallback(class UObject* InWorldContext, const class FString& InEventName, const TDelegate<void(class UWwiseComponent* WwiseComponent)>& OnEndPlay);
	static void PostEvent2DWithoutWorld(const class FString& InEventName);
	static class UWwiseComponent* PostEventAtLocation(class UObject* InWorldContext, const class FString& InEventName, const struct FVector& InLocation, const struct FRotator& InRotation, int32 SwitchState);
	static class UWwiseComponent* PostEventAtLocationInSequence(class UObject* InWorldContext, const class FString& InEventName, const struct FVector& InLocation, const struct FRotator& InRotation, int32 SwitchState);
	static class UWwiseComponent* PostEventAtLocationSwitch(class UObject* InWorldContext, const class FString& InEventName, const struct FVector& InLocation, const struct FRotator& InRotation, const TMap<class FString, class FString>& Switch, int32 SwitchState);
	static class UWwiseComponent* PostEventAtLocationWithCallback(class UObject* InWorldContext, const class FString& InEventName, const struct FVector& InLocation, const struct FRotator& InRotation, const TDelegate<void(class UWwiseComponent* WwiseComponent)>& OnEndPlay, int32 SwitchState);
	static class UWwiseComponent* PostEventAtLocationWithCallbackSwitch(class UObject* InWorldContext, const class FString& InEventName, const struct FVector& InLocation, const struct FRotator& InRotation, const TDelegate<void(class UWwiseComponent* WwiseComponent)>& OnEndPlay, const TMap<class FString, class FString>& Switch, int32 SwitchState);
	static class UWwiseComponent* PostEventAttachedActor(const class FString& InEventName, class AActor* InActor);
	static class UWwiseComponent* PostEventAttachedActorInSequence(const class FString& InEventName, class AActor* InActor);
	static class UWwiseComponent* PostEventAttachedActorSwitch(const class FString& InEventName, class AActor* InActor, const TMap<class FString, class FString>& Switch);
	static class UWwiseComponent* PostEventAttachedComponent(const class FString& InEventName, class USceneComponent* InAttachedComponent, const class FName& InSocketName, bool bAutoDestroy, int32 SwitchState);
	static class UWwiseComponent* PostEventAttachedComponentSwitch(const class FString& InEventName, class USceneComponent* InAttachedComponent, const TMap<class FString, class FString>& Switch, const class FName& InSocketName, bool bAutoDestroy, int32 SwitchState);
	static class UWwiseComponent* PostEventAttachedWithCallback(const class FString& InEventName, class USceneComponent* InAttachedComponent, const TDelegate<void(class UWwiseComponent* WwiseComponent)>& OnEndPlay, const class FName& InSocketName, bool bAutoDestroy, int32 SwitchState);
	static class UWwiseComponent* PostEventAttachedWithCallbackSwitch(const class FString& InEventName, class USceneComponent* InAttachedComponent, const TDelegate<void(class UWwiseComponent* WwiseComponent)>& OnEndPlay, const TMap<class FString, class FString>& Switch, const class FName& InSocketName, bool bAutoDestroy, int32 SwitchState);
	static int32 PostEventMulitplePosition(const class FString& InEventName, int64 InObjectID, const TArray<struct FTransform>& InTransforms, bool InNeedRegister);
	static void RecordEventName(const class FString& InName);
	static bool RegisterGameObj(int64 InObjectID, const class FString& InObjName);
	static void RemoveSequcneWwiseComponent(class UWwiseComponent* InComponent, bool bInStop);
	static void ResumeAllWwiseEvents(int32 InTransitionDuration);
	static void ResumeOnEvent(const class FString& InEventName, int32 InTransitionDuration);
	static void ResumeOnPlayingID(int32 InPlayingID, int32 InTransitionDuration);
	static void ResumeSequcneWwiseComponents(int32 InTransitionDuration);
	static bool SeekOnEvent(const class FString& InEventName, class UWwiseComponent* InComponent, float InPosition);
	static bool SeekOnEventFromObjectID(const class FString& InEventName, int64 InGameObjectID, float InPosition, bool bInSeekToNearestMarker);
	static void SeSupportAsyncLoadBank(bool bInSupportAsyncLoadBank);
	static void SetBackgroundSuspend(bool bInDontSuspendWhenBackground, bool bInRenderAudioWhenBackground);
	static void SetDeactivedSuspend(bool bInDontSuspendWhenDeactived, bool bInRenderAudioWhenDeactived);
	static void SetDisable(bool InValue);
	static void SetIgnorePreviewWorldClean(bool bInIgnorePreiveWorldClean);
	static void SetiOSFixInBackground(bool bIniOSFixBackgroud);
	static void SetiOSFixInterruption(bool bIniOSFixInterruption);
	static bool SetLanguage(const class FString& InLang);
	static void SetLowAmmunitionEffect(bool bInEffect);
	static bool SetModifiedBankLanguage(const class FString& InBankName, const class FString& InLanguage, bool bInUnloadBank);
	static void SetPluginEnable(uint8 bEnable);
	static void SetRecordEventNames(bool InEnable, int32 InCount);
	static void SetRTPCValue(const class FString& InRTPCName, float InValue, int32 InInterpMS, ERTPCValueCurveType InCurveType);
	static void SetState(const class FString& InStateGroup, const class FString& InStateName);
	static void SetStateGroup(const class FString& InStateGroup);
	static void SetSwitch(const class FString& InSwitchGroup, const class FString& InSwitchName, class UWwiseComponent* InComponent);
	static void SetSwitchFromActor(const class FString& InSwitchGroup, const class FString& InSwitchName, const class AActor* InActor);
	static void SetSwitchGroup(const class FString& InSwitchGroup, class UWwiseComponent* InComponent);
	static void SetSwitchState(class UObject* InWorldContext, class UWwiseComponent* InWwiseComponent, int32 SwitchState);
	static void SetSwitchStateByActorType(EWwiseActorType ActorType, class UWwiseComponent* InWwiseComponent, int32 SwitchState, const class FString& ActorName);
	static void SetVolumeScale(const class FString& InBusName, float InScale, float InFadeTime);
	static void SetVolumeScaleByObjectID(const class FString& InBusName, float InScale, float InFadeTime, int64 InGameObjectID);
	static void SetWwiseQuality(EWwiseQuality InWwiseQuality);
	static void StopAllAttachedActor(class AActor* InActor, int32 InTransitionMS);
	static void StopAllAttachedComponent(class USceneComponent* InAttachedComponent);
	static void StopPlayingID(int32 InPlayingID, float InDuration);
	static void UnloadBank(int32 InBankID);
	static bool UnloadBankAsync(int32 InBankID);
	static void UnloadBankByEvents(const TArray<class FString>& InEventNames);
	static void WwiseSuspend(bool bRenderAnyway);
	static void WwiseWakeupFromSuspend();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("WwiseLibrary")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WwiseLibrary")
	}
	static class UWwiseLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWwiseLibrary>();
	}
};
DUMPER7_ASSERTS_UWwiseLibrary;

// Class Wwise.WwiseMulitplePositionComponent
// 0x0020 (0x0220 - 0x0200)
class UWwiseMulitplePositionComponent final : public USceneComponent
{
public:
	class FString                                 SoundEvent;                                        // 0x01F8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bAutoPlay : 1;                                     // 0x0208(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bEnabled : 1;                                      // 0x0208(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_209[0x17];                                     // 0x0209(0x0017)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])

public:
	bool IsPlaying();
	void StartPlay();
	void StopPlay();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("WwiseMulitplePositionComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WwiseMulitplePositionComponent")
	}
	static class UWwiseMulitplePositionComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWwiseMulitplePositionComponent>();
	}
};
DUMPER7_ASSERTS_UWwiseMulitplePositionComponent;

// Class Wwise.WwisePortalVolume
// 0x0090 (0x02F0 - 0x0260)
class AWwisePortalVolume final : public AVolume
{
public:
	ECollisionChannel                             CollisionChannel;                                  // 0x0260(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_261[0x3];                                      // 0x0261(0x0003)(Fixing Size After Last Property [ Rei-SdkDumper ])
	float                                         CollisionCheckInterval;                            // 0x0264(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_268[0x88];                                     // 0x0268(0x0088)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])

public:
	void ClosePortal();
	bool IsOpened();
	void OpenPortal();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("WwisePortalVolume")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WwisePortalVolume")
	}
	static class AWwisePortalVolume* GetDefaultObj()
	{
		return GetDefaultObjImpl<AWwisePortalVolume>();
	}
};
DUMPER7_ASSERTS_AWwisePortalVolume;

// Class Wwise.WwiseReverbVolume
// 0x0008 (0x0268 - 0x0260)
class AWwiseReverbVolume final : public AVolume
{
public:
	class UWwiseLateReverbComponent*              LateReverb;                                        // 0x0260(0x0008)(Edit, ExportObject, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("WwiseReverbVolume")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WwiseReverbVolume")
	}
	static class AWwiseReverbVolume* GetDefaultObj()
	{
		return GetDefaultObjImpl<AWwiseReverbVolume>();
	}
};
DUMPER7_ASSERTS_AWwiseReverbVolume;

// Class Wwise.WwiseRoomComponent
// 0x0060 (0x0260 - 0x0200)
class UWwiseRoomComponent final : public USceneComponent
{
public:
	uint8                                         bEnable : 1;                                       // 0x01F8(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_1F9[0x3];                                      // 0x01F9(0x0003)(Fixing Size After Last Property [ Rei-SdkDumper ])
	float                                         Priority;                                          // 0x01FC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         WallOcclusion;                                     // 0x0200(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_204[0x4];                                      // 0x0204(0x0004)(Fixing Size After Last Property [ Rei-SdkDumper ])
	class FString                                 EnterSwitchGroup;                                  // 0x0208(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 EnterSwitch;                                       // 0x0218(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 LeaveSwitchGroup;                                  // 0x0228(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 LeaveSwitch;                                       // 0x0238(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UWwiseRoomComponent*                    NextLowerPriorityRoom;                             // 0x0248(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AVolume*                                Volume;                                            // 0x0250(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bHasSwitch : 1;                                    // 0x0258(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_259[0x7];                                      // 0x0259(0x0007)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("WwiseRoomComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WwiseRoomComponent")
	}
	static class UWwiseRoomComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWwiseRoomComponent>();
	}
};
DUMPER7_ASSERTS_UWwiseRoomComponent;

// Class Wwise.WwiseSetting
// 0x0088 (0x00B0 - 0x0028)
class UWwiseSetting final : public UObject
{
public:
	class FString                                 BaseAudioPath;                                     // 0x0028(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint32                                        MaxPositioningPaths;                               // 0x0038(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint32                                        DefaultPoolSize;                                   // 0x003C(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MemoryCutoffThreshold;                             // 0x0040(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint32                                        CommandQueueSize;                                  // 0x0044(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint32                                        SamplesPerFrame;                                   // 0x0048(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EWwisePanningRule                             PanningRule;                                       // 0x004C(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EWwiseChannelType                             ChannelType;                                       // 0x0050(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint32                                        ChannelMask;                                       // 0x0054(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint32                                        ChannelCount;                                      // 0x0058(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxVolume;                                         // 0x005C(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint32                                        MaxMemoryPools;                                    // 0x0060(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         StreamingLookAheadRatio;                           // 0x0064(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint32                                        StreamManagerPoolSize;                             // 0x0068(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint32                                        LowerEnginePoolSize;                               // 0x006C(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LowerEngineMemoryCutoffThreshold;                  // 0x0070(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint16                                        MaxRefillsInVoice;                                 // 0x0074(0x0002)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_76[0x2];                                       // 0x0076(0x0002)(Fixing Size After Last Property [ Rei-SdkDumper ])
	uint32                                        SpatialAudioPoolSize;                              // 0x0078(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint32                                        MaxSoundPropagationDepth;                          // 0x007C(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint32                                        DiffractionFlags;                                  // 0x0080(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DiffractionShadowDegrees;                          // 0x0084(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DiffractionShadowAttenuationFactor;                // 0x0088(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MovementThreshold;                                 // 0x008C(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 HitEffectGroupName;                                // 0x0090(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 HitEffectEventName;                                // 0x00A0(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("WwiseSetting")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WwiseSetting")
	}
	static class UWwiseSetting* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWwiseSetting>();
	}
};
DUMPER7_ASSERTS_UWwiseSetting;

// Class Wwise.WwiseSpatialAudioVolume
// 0x0010 (0x0270 - 0x0260)
class AWwiseSpatialAudioVolume final : public AVolume
{
public:
	class UWwiseLateReverbComponent*              LateReverb;                                        // 0x0260(0x0008)(Edit, ExportObject, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UWwiseRoomComponent*                    Room;                                              // 0x0268(0x0008)(Edit, ExportObject, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("WwiseSpatialAudioVolume")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WwiseSpatialAudioVolume")
	}
	static class AWwiseSpatialAudioVolume* GetDefaultObj()
	{
		return GetDefaultObjImpl<AWwiseSpatialAudioVolume>();
	}
};
DUMPER7_ASSERTS_AWwiseSpatialAudioVolume;

}

