#pragma once

/*
* SDK generated by Rei-SdkDumper
* Based on Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: XGSDKJinshan

#include "Basic.hpp"

#include "XGSDKJinshan_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function XGSDKJinshan.XGSDKUserWidget.ActivationExchangeResult
// 0x0018 (0x0018 - 0x0000)
struct XGSDKUserWidget_ActivationExchangeResult final
{
public:
	int32                                         Code;                                              // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Rei-SdkDumper ])
	class FString                                 Msg;                                               // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_XGSDKUserWidget_ActivationExchangeResult;

// Function XGSDKJinshan.XGSDKUserWidget.AutoFetchXgOrderStatusResult
// 0x0010 (0x0010 - 0x0000)
struct XGSDKUserWidget_AutoFetchXgOrderStatusResult final
{
public:
	class FString                                 status;                                            // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_XGSDKUserWidget_AutoFetchXgOrderStatusResult;

// Function XGSDKJinshan.XGSDKUserWidget.BindPhone
// 0x0040 (0x0040 - 0x0000)
struct XGSDKUserWidget_BindPhone final
{
public:
	class FString                                 passportId;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Token;                                             // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 phone;                                             // 0x0020(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 captcha;                                           // 0x0030(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_XGSDKUserWidget_BindPhone;

// Function XGSDKJinshan.XGSDKUserWidget.BindPhoneResult
// 0x0018 (0x0018 - 0x0000)
struct XGSDKUserWidget_BindPhoneResult final
{
public:
	int32                                         Code;                                              // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Rei-SdkDumper ])
	class FString                                 Msg;                                               // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_XGSDKUserWidget_BindPhoneResult;

// Function XGSDKJinshan.XGSDKUserWidget.ChangePasswordResult
// 0x0018 (0x0018 - 0x0000)
struct XGSDKUserWidget_ChangePasswordResult final
{
public:
	int32                                         Code;                                              // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Rei-SdkDumper ])
	class FString                                 Msg;                                               // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_XGSDKUserWidget_ChangePasswordResult;

// Function XGSDKJinshan.XGSDKUserWidget.CreateOrderResult
// 0x0040 (0x0040 - 0x0000)
struct XGSDKUserWidget_CreateOrderResult final
{
public:
	int32                                         payType;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Rei-SdkDumper ])
	class FString                                 Account;                                           // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Price;                                             // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Rei-SdkDumper ])
	class FString                                 productName;                                       // 0x0020(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 OrderId;                                           // 0x0030(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_XGSDKUserWidget_CreateOrderResult;

// Function XGSDKJinshan.XGSDKUserWidget.CreateQrCode
// 0x0001 (0x0001 - 0x0000)
struct XGSDKUserWidget_CreateQrCode final
{
public:
	bool                                          sandBox;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_XGSDKUserWidget_CreateQrCode;

// Function XGSDKJinshan.XGSDKUserWidget.DeleteAccountResult
// 0x0010 (0x0010 - 0x0000)
struct XGSDKUserWidget_DeleteAccountResult final
{
public:
	class FString                                 passportId;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_XGSDKUserWidget_DeleteAccountResult;

// Function XGSDKJinshan.XGSDKUserWidget.FetchXgOrderStatus
// 0x0001 (0x0001 - 0x0000)
struct XGSDKUserWidget_FetchXgOrderStatus final
{
public:
	bool                                          bAuto;                                             // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_XGSDKUserWidget_FetchXgOrderStatus;

// Function XGSDKJinshan.XGSDKUserWidget.FetchXgOrderStatusResult
// 0x0010 (0x0010 - 0x0000)
struct XGSDKUserWidget_FetchXgOrderStatusResult final
{
public:
	class FString                                 status;                                            // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_XGSDKUserWidget_FetchXgOrderStatusResult;

// Function XGSDKJinshan.XGSDKUserWidget.ForgotPasswordResult
// 0x0048 (0x0048 - 0x0000)
struct XGSDKUserWidget_ForgotPasswordResult final
{
public:
	bool                                          isPhone;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Rei-SdkDumper ])
	class FString                                 phone;                                             // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 phoneDisplay;                                      // 0x0018(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 email;                                             // 0x0028(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 emailDisplay;                                      // 0x0038(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_XGSDKUserWidget_ForgotPasswordResult;

// Function XGSDKJinshan.XGSDKUserWidget.FormatTime
// 0x0018 (0x0018 - 0x0000)
struct XGSDKUserWidget_FormatTime final
{
public:
	int32                                         TimeValue;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Rei-SdkDumper ])
	class FString                                 ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_XGSDKUserWidget_FormatTime;

// Function XGSDKJinshan.XGSDKUserWidget.ImgCodeResult
// 0x0010 (0x0010 - 0x0000)
struct XGSDKUserWidget_ImgCodeResult final
{
public:
	bool                                          Show;                                              // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Rei-SdkDumper ])
	const class UTexture2D*                       Texture;                                           // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_XGSDKUserWidget_ImgCodeResult;

// Function XGSDKJinshan.XGSDKUserWidget.KeyDownResult
// 0x0004 (0x0004 - 0x0000)
struct XGSDKUserWidget_KeyDownResult final
{
public:
	int32                                         keyCode;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_XGSDKUserWidget_KeyDownResult;

// Function XGSDKJinshan.XGSDKUserWidget.Login
// 0x0030 (0x0030 - 0x0000)
struct XGSDKUserWidget_Login final
{
public:
	class FString                                 passportId;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 password;                                          // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 captcha;                                           // 0x0020(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_XGSDKUserWidget_Login;

// Function XGSDKJinshan.XGSDKUserWidget.LoginBySms
// 0x0030 (0x0030 - 0x0000)
struct XGSDKUserWidget_LoginBySms final
{
public:
	class FString                                 passportId;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 captcha;                                           // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 sendPhoneType;                                     // 0x0020(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_XGSDKUserWidget_LoginBySms;

// Function XGSDKJinshan.XGSDKUserWidget.LoginBySmsResult
// 0x0010 (0x0010 - 0x0000)
struct XGSDKUserWidget_LoginBySmsResult final
{
public:
	class FString                                 passportId;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_XGSDKUserWidget_LoginBySmsResult;

// Function XGSDKJinshan.XGSDKUserWidget.LoginCaptcha
// 0x0020 (0x0020 - 0x0000)
struct XGSDKUserWidget_LoginCaptcha final
{
public:
	class FString                                 passportId;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 sendPhoneType;                                     // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_XGSDKUserWidget_LoginCaptcha;

// Function XGSDKJinshan.XGSDKUserWidget.LoginPasswordFailResult
// 0x0018 (0x0018 - 0x0000)
struct XGSDKUserWidget_LoginPasswordFailResult final
{
public:
	int32                                         Code;                                              // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Rei-SdkDumper ])
	class FString                                 Msg;                                               // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_XGSDKUserWidget_LoginPasswordFailResult;

// Function XGSDKJinshan.XGSDKUserWidget.LoginPasswordSuccessResult
// 0x0010 (0x0010 - 0x0000)
struct XGSDKUserWidget_LoginPasswordSuccessResult final
{
public:
	class FString                                 passportId;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_XGSDKUserWidget_LoginPasswordSuccessResult;

// Function XGSDKJinshan.XGSDKUserWidget.OnAliPayClicked
// 0x0004 (0x0004 - 0x0000)
struct XGSDKUserWidget_OnAliPayClicked final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_XGSDKUserWidget_OnAliPayClicked;

// Function XGSDKJinshan.XGSDKUserWidget.OnInitPayViews
// 0x0018 (0x0018 - 0x0000)
struct XGSDKUserWidget_OnInitPayViews final
{
public:
	class FString                                 payType;                                           // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Index_0;                                           // 0x0010(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_XGSDKUserWidget_OnInitPayViews;

// Function XGSDKJinshan.XGSDKUserWidget.OnWxPayClicked
// 0x0004 (0x0004 - 0x0000)
struct XGSDKUserWidget_OnWxPayClicked final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_XGSDKUserWidget_OnWxPayClicked;

// Function XGSDKJinshan.XGSDKUserWidget.OnXgPayClicked
// 0x0004 (0x0004 - 0x0000)
struct XGSDKUserWidget_OnXgPayClicked final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_XGSDKUserWidget_OnXgPayClicked;

// Function XGSDKJinshan.XGSDKUserWidget.OpenBindPhoneWebWindow
// 0x0020 (0x0020 - 0x0000)
struct XGSDKUserWidget_OpenBindPhoneWebWindow final
{
public:
	class FString                                 passport_id;                                       // 0x0000(0x0010)(ConstParm, Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 redirectBindPhoneUrl;                              // 0x0010(0x0010)(ConstParm, Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_XGSDKUserWidget_OpenBindPhoneWebWindow;

// Function XGSDKJinshan.XGSDKUserWidget.OpenUpgradePasswordWebWindow
// 0x0010 (0x0010 - 0x0000)
struct XGSDKUserWidget_OpenUpgradePasswordWebWindow final
{
public:
	class FString                                 passport_id;                                       // 0x0000(0x0010)(ConstParm, Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_XGSDKUserWidget_OpenUpgradePasswordWebWindow;

// Function XGSDKJinshan.XGSDKUserWidget.Pay
// 0x0004 (0x0004 - 0x0000)
struct XGSDKUserWidget_Pay final
{
public:
	int32                                         payType;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_XGSDKUserWidget_Pay;

// Function XGSDKJinshan.XGSDKUserWidget.QrResult
// 0x0020 (0x0020 - 0x0000)
struct XGSDKUserWidget_QrResult final
{
public:
	TArray<struct FColor>                         Data;                                              // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	int32                                         with;                                              // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Rei-SdkDumper ])
	struct FDateTime                              Time;                                              // 0x0018(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_XGSDKUserWidget_QrResult;

// Function XGSDKJinshan.XGSDKUserWidget.QrStatusResult
// 0x0001 (0x0001 - 0x0000)
struct XGSDKUserWidget_QrStatusResult final
{
public:
	EXGSDKJinshanQrStatus                         status;                                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_XGSDKUserWidget_QrStatusResult;

// Function XGSDKJinshan.XGSDKUserWidget.QueryXgQrCodeResult
// 0x0004 (0x0004 - 0x0000)
struct XGSDKUserWidget_QueryXgQrCodeResult final
{
public:
	int32                                         status;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_XGSDKUserWidget_QueryXgQrCodeResult;

// Function XGSDKJinshan.XGSDKUserWidget.RefreshPlayerInfo
// 0x0010 (0x0010 - 0x0000)
struct XGSDKUserWidget_RefreshPlayerInfo final
{
public:
	class FString                                 Token;                                             // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_XGSDKUserWidget_RefreshPlayerInfo;

// Function XGSDKJinshan.XGSDKUserWidget.RegisterResult
// 0x0018 (0x0018 - 0x0000)
struct XGSDKUserWidget_RegisterResult final
{
public:
	int32                                         Code;                                              // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Rei-SdkDumper ])
	class FString                                 Msg;                                               // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_XGSDKUserWidget_RegisterResult;

// Function XGSDKJinshan.XGSDKUserWidget.RequestPayQrResult
// 0x0028 (0x0028 - 0x0000)
struct XGSDKUserWidget_RequestPayQrResult final
{
public:
	TArray<struct FColor>                         Data;                                              // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	int32                                         with;                                              // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Rei-SdkDumper ])
	class FString                                 OrderId;                                           // 0x0018(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_XGSDKUserWidget_RequestPayQrResult;

// Function XGSDKJinshan.XGSDKUserWidget.SendPassportResult
// 0x0018 (0x0018 - 0x0000)
struct XGSDKUserWidget_SendPassportResult final
{
public:
	int32                                         Code;                                              // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Rei-SdkDumper ])
	class FString                                 Msg;                                               // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_XGSDKUserWidget_SendPassportResult;

// Function XGSDKJinshan.XGSDKUserWidget.SendSmsCaptcha
// 0x0030 (0x0030 - 0x0000)
struct XGSDKUserWidget_SendSmsCaptcha final
{
public:
	class FString                                 passportId;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 phone;                                             // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 _type;                                             // 0x0020(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_XGSDKUserWidget_SendSmsCaptcha;

// Function XGSDKJinshan.XGSDKUserWidget.SendSmsCaptchaResult
// 0x0038 (0x0038 - 0x0000)
struct XGSDKUserWidget_SendSmsCaptchaResult final
{
public:
	int32                                         Code;                                              // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Rei-SdkDumper ])
	class FString                                 Msg;                                               // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 phone;                                             // 0x0018(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FXGSDKFuzzyMobile>              phoneList;                                         // 0x0028(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_XGSDKUserWidget_SendSmsCaptchaResult;

// Function XGSDKJinshan.XGSDKUserWidget.TestFunc
// 0x0004 (0x0004 - 0x0000)
struct XGSDKUserWidget_TestFunc final
{
public:
	int32                                         Args;                                              // 0x0000(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_XGSDKUserWidget_TestFunc;

// Function XGSDKJinshan.XGSDKUserWidget.UpdateCaptcha
// 0x0018 (0x0018 - 0x0000)
struct XGSDKUserWidget_UpdateCaptcha final
{
public:
	class FString                                 passportId;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Width;                                             // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Height;                                            // 0x0014(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_XGSDKUserWidget_UpdateCaptcha;

// Function XGSDKJinshan.XGSDKUserWidget.VerifyCardId
// 0x0030 (0x0030 - 0x0000)
struct XGSDKUserWidget_VerifyCardId final
{
public:
	class FString                                 passportId;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Name_0;                                            // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 CardID;                                            // 0x0020(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_XGSDKUserWidget_VerifyCardId;

// Function XGSDKJinshan.XGSDKUserWidget.VerifyCardIdResult
// 0x0018 (0x0018 - 0x0000)
struct XGSDKUserWidget_VerifyCardIdResult final
{
public:
	int32                                         Code;                                              // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Rei-SdkDumper ])
	class FString                                 Msg;                                               // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_XGSDKUserWidget_VerifyCardIdResult;

// Function XGSDKJinshan.XGSDKUserWidget.VerifySession
// 0x0010 (0x0010 - 0x0000)
struct XGSDKUserWidget_VerifySession final
{
public:
	class FString                                 authInfo;                                          // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_XGSDKUserWidget_VerifySession;

// Function XGSDKJinshan.XGSDKUserWidget.VerifySessionResult
// 0x0030 (0x0030 - 0x0000)
struct XGSDKUserWidget_VerifySessionResult final
{
public:
	class FString                                 Code;                                              // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Msg;                                               // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 uid;                                               // 0x0020(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_XGSDKUserWidget_VerifySessionResult;

// Function XGSDKJinshan.XGSDKWinHelper.CheckIsQRLogin
// 0x0001 (0x0001 - 0x0000)
struct XGSDKWinHelper_CheckIsQRLogin final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_XGSDKWinHelper_CheckIsQRLogin;

// Function XGSDKJinshan.XGSDKWinHelper.CheckPassword
// 0x0018 (0x0018 - 0x0000)
struct XGSDKWinHelper_CheckPassword final
{
public:
	class FString                                 pwd;                                               // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_XGSDKWinHelper_CheckPassword;

// Function XGSDKJinshan.XGSDKWinHelper.CheckPasswordHasSpace
// 0x0018 (0x0018 - 0x0000)
struct XGSDKWinHelper_CheckPasswordHasSpace final
{
public:
	class FString                                 pwd;                                               // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_XGSDKWinHelper_CheckPasswordHasSpace;

// Function XGSDKJinshan.XGSDKWinHelper.CreateTextureFromBGRA
// 0x0028 (0x0028 - 0x0000)
struct XGSDKWinHelper_CreateTextureFromBGRA final
{
public:
	TArray<struct FColor>                         Data;                                              // 0x0000(0x0010)(Parm, ZeroConstructor, NativeAccessSpecifierPublic)
	int32                                         Width;                                             // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Height;                                            // 0x0014(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         widthRatio;                                        // 0x0018(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         heightRatio;                                       // 0x0019(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Size After Last Property [ Rei-SdkDumper ])
	class UTexture2D*                             ReturnValue;                                       // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_XGSDKWinHelper_CreateTextureFromBGRA;

// Function XGSDKJinshan.XGSDKWinHelper.DecodeAuthInfo
// 0x0060 (0x0060 - 0x0000)
struct XGSDKWinHelper_DecodeAuthInfo final
{
public:
	class FString                                 Info;                                              // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<class FString, class FString>            ReturnValue;                                       // 0x0010(0x0050)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_XGSDKWinHelper_DecodeAuthInfo;

// Function XGSDKJinshan.XGSDKWinHelper.DelLoginUsers
// 0x0018 (0x0018 - 0x0000)
struct XGSDKWinHelper_DelLoginUsers final
{
public:
	class FString                                 PasswordId;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_XGSDKWinHelper_DelLoginUsers;

// Function XGSDKJinshan.XGSDKWinHelper.EnableAliQrCode
// 0x0001 (0x0001 - 0x0000)
struct XGSDKWinHelper_EnableAliQrCode final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_XGSDKWinHelper_EnableAliQrCode;

// Function XGSDKJinshan.XGSDKWinHelper.EnableMobileQrCode
// 0x0001 (0x0001 - 0x0000)
struct XGSDKWinHelper_EnableMobileQrCode final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_XGSDKWinHelper_EnableMobileQrCode;

// Function XGSDKJinshan.XGSDKWinHelper.EnableShowAccountPasswordEntry
// 0x0001 (0x0001 - 0x0000)
struct XGSDKWinHelper_EnableShowAccountPasswordEntry final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_XGSDKWinHelper_EnableShowAccountPasswordEntry;

// Function XGSDKJinshan.XGSDKWinHelper.EnableShowAutoLoginButton
// 0x0002 (0x0002 - 0x0000)
struct XGSDKWinHelper_EnableShowAutoLoginButton final
{
public:
	EXGSDKLoginShowUIType                         UIType;                                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_XGSDKWinHelper_EnableShowAutoLoginButton;

// Function XGSDKJinshan.XGSDKWinHelper.EnableShowMobileSmsLoginEntry
// 0x0001 (0x0001 - 0x0000)
struct XGSDKWinHelper_EnableShowMobileSmsLoginEntry final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_XGSDKWinHelper_EnableShowMobileSmsLoginEntry;

// Function XGSDKJinshan.XGSDKWinHelper.EnableShowQrCodeLoginEntry
// 0x0001 (0x0001 - 0x0000)
struct XGSDKWinHelper_EnableShowQrCodeLoginEntry final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_XGSDKWinHelper_EnableShowQrCodeLoginEntry;

// Function XGSDKJinshan.XGSDKWinHelper.EnableWxQrCode
// 0x0001 (0x0001 - 0x0000)
struct XGSDKWinHelper_EnableWxQrCode final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_XGSDKWinHelper_EnableWxQrCode;

// Function XGSDKJinshan.XGSDKWinHelper.GetAllowAutoLogin
// 0x0001 (0x0001 - 0x0000)
struct XGSDKWinHelper_GetAllowAutoLogin final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_XGSDKWinHelper_GetAllowAutoLogin;

// Function XGSDKJinshan.XGSDKWinHelper.GetAuthToken
// 0x0010 (0x0010 - 0x0000)
struct XGSDKWinHelper_GetAuthToken final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_XGSDKWinHelper_GetAuthToken;

// Function XGSDKJinshan.XGSDKWinHelper.GetBindPhone
// 0x0010 (0x0010 - 0x0000)
struct XGSDKWinHelper_GetBindPhone final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_XGSDKWinHelper_GetBindPhone;

// Function XGSDKJinshan.XGSDKWinHelper.GetCertification
// 0x0003 (0x0003 - 0x0000)
struct XGSDKWinHelper_GetCertification final
{
public:
	bool                                          needVerifyIdCard;                                  // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          forcedVerifyIdCard;                                // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EXGSDKCertification                           certification;                                     // 0x0002(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_XGSDKWinHelper_GetCertification;

// Function XGSDKJinshan.XGSDKWinHelper.GetFuzzyMobile
// 0x0010 (0x0010 - 0x0000)
struct XGSDKWinHelper_GetFuzzyMobile final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_XGSDKWinHelper_GetFuzzyMobile;

// Function XGSDKJinshan.XGSDKWinHelper.GetGameQRParam
// 0x0020 (0x0020 - 0x0000)
struct XGSDKWinHelper_GetGameQRParam final
{
public:
	class FString                                 appName;                                           // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 appUrl;                                            // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_XGSDKWinHelper_GetGameQRParam;

// Function XGSDKJinshan.XGSDKWinHelper.GetHelpImgPath
// 0x0010 (0x0010 - 0x0000)
struct XGSDKWinHelper_GetHelpImgPath final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_XGSDKWinHelper_GetHelpImgPath;

// Function XGSDKJinshan.XGSDKWinHelper.GetIdNumber
// 0x0010 (0x0010 - 0x0000)
struct XGSDKWinHelper_GetIdNumber final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_XGSDKWinHelper_GetIdNumber;

// Function XGSDKJinshan.XGSDKWinHelper.GetInitPayTpye
// 0x0004 (0x0004 - 0x0000)
struct XGSDKWinHelper_GetInitPayTpye final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_XGSDKWinHelper_GetInitPayTpye;

// Function XGSDKJinshan.XGSDKWinHelper.GetKSConfig
// 0x0088 (0x0088 - 0x0000)
struct XGSDKWinHelper_GetKSConfig final
{
public:
	struct FKSConfig                              ReturnValue;                                       // 0x0000(0x0088)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_XGSDKWinHelper_GetKSConfig;

// Function XGSDKJinshan.XGSDKWinHelper.GetLastLoginUser
// 0x0048 (0x0048 - 0x0000)
struct XGSDKWinHelper_GetLastLoginUser final
{
public:
	struct FXGSDKSaveUser                         User;                                              // 0x0000(0x0040)(Parm, OutParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0040(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_XGSDKWinHelper_GetLastLoginUser;

// Function XGSDKJinshan.XGSDKWinHelper.GetLoginUsers
// 0x0018 (0x0018 - 0x0000)
struct XGSDKWinHelper_GetLoginUsers final
{
public:
	TArray<struct FXGSDKSaveUser>                 users;                                             // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_XGSDKWinHelper_GetLoginUsers;

// Function XGSDKJinshan.XGSDKWinHelper.GetMaskPassportId
// 0x0010 (0x0010 - 0x0000)
struct XGSDKWinHelper_GetMaskPassportId final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_XGSDKWinHelper_GetMaskPassportId;

// Function XGSDKJinshan.XGSDKWinHelper.GetPassportId
// 0x0010 (0x0010 - 0x0000)
struct XGSDKWinHelper_GetPassportId final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_XGSDKWinHelper_GetPassportId;

// Function XGSDKJinshan.XGSDKWinHelper.GetPreventAddictionLeftSecond
// 0x0004 (0x0004 - 0x0000)
struct XGSDKWinHelper_GetPreventAddictionLeftSecond final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_XGSDKWinHelper_GetPreventAddictionLeftSecond;

// Function XGSDKJinshan.XGSDKWinHelper.GetUid
// 0x0010 (0x0010 - 0x0000)
struct XGSDKWinHelper_GetUid final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_XGSDKWinHelper_GetUid;

// Function XGSDKJinshan.XGSDKWinHelper.GetXgOderId
// 0x0010 (0x0010 - 0x0000)
struct XGSDKWinHelper_GetXgOderId final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_XGSDKWinHelper_GetXgOderId;

// Function XGSDKJinshan.XGSDKWinHelper.LoadTexture
// 0x0018 (0x0018 - 0x0000)
struct XGSDKWinHelper_LoadTexture final
{
public:
	class FString                                 fullPath;                                          // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTexture2D*                             ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_XGSDKWinHelper_LoadTexture;

// Function XGSDKJinshan.XGSDKWinHelper.LoadTextureFromBase64
// 0x0018 (0x0018 - 0x0000)
struct XGSDKWinHelper_LoadTextureFromBase64 final
{
public:
	class FString                                 fullPath;                                          // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTexture2D*                             ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_XGSDKWinHelper_LoadTextureFromBase64;

// Function XGSDKJinshan.XGSDKWinHelper.SaveLoginUser
// 0x0038 (0x0038 - 0x0000)
struct XGSDKWinHelper_SaveLoginUser final
{
public:
	class FString                                 PasswordId;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 uid;                                               // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Token;                                             // 0x0020(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          LoginByQrCode;                                     // 0x0030(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0031(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_32[0x6];                                       // 0x0032(0x0006)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_XGSDKWinHelper_SaveLoginUser;

// Function XGSDKJinshan.XGSDKWinHelper.SetAllowAutoLogin
// 0x0001 (0x0001 - 0x0000)
struct XGSDKWinHelper_SetAllowAutoLogin final
{
public:
	bool                                          allow;                                             // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_XGSDKWinHelper_SetAllowAutoLogin;

// Function XGSDKJinshan.XGSDKWinHelper.SetLastLoginUser
// 0x0018 (0x0018 - 0x0000)
struct XGSDKWinHelper_SetLastLoginUser final
{
public:
	class FString                                 User;                                              // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_XGSDKWinHelper_SetLastLoginUser;

// Function XGSDKJinshan.XGSDKWinHelper.ShowMsg
// 0x0020 (0x0020 - 0x0000)
struct XGSDKWinHelper_ShowMsg final
{
public:
	class UObject*                                Outer_0;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Msg;                                               // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ShowTime;                                          // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_XGSDKWinHelper_ShowMsg;

// Function XGSDKJinshan.XGSDKWinHelper.ShowMsgText
// 0x0028 (0x0028 - 0x0000)
struct XGSDKWinHelper_ShowMsgText final
{
public:
	class UObject*                                Outer_0;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                   Msg;                                               // 0x0008(0x0018)(Parm, NativeAccessSpecifierPublic)
	int32                                         ShowTime;                                          // 0x0020(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Struct Size After Last Property [ Rei-SdkDumper ])
};
DUMPER7_ASSERTS_XGSDKWinHelper_ShowMsgText;

// Function XGSDKJinshan.XGSDKWinHelper.ShowWeb
// 0x0018 (0x0018 - 0x0000)
struct XGSDKWinHelper_ShowWeb final
{
public:
	class UObject*                                Outer_0;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 URL;                                               // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_XGSDKWinHelper_ShowWeb;

// Function XGSDKJinshan.XGSDKWinHelper.UpdatePreventAddictionLeftSecond
// 0x0004 (0x0004 - 0x0000)
struct XGSDKWinHelper_UpdatePreventAddictionLeftSecond final
{
public:
	int32                                         leftSecond;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_XGSDKWinHelper_UpdatePreventAddictionLeftSecond;

// Function XGSDKJinshan.XGSDKWinHelper.GameTermAgree
// 0x0001 (0x0001 - 0x0000)
struct XGSDKWinHelper_GameTermAgree final
{
public:
	bool                                          isAgree;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_XGSDKWinHelper_GameTermAgree;

// Function XGSDKJinshan.XGSDKWinHelper.IsLanuchFromSSG
// 0x0001 (0x0001 - 0x0000)
struct XGSDKWinHelper_IsLanuchFromSSG final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_XGSDKWinHelper_IsLanuchFromSSG;

// Function XGSDKJinshan.XGSDKWinHelper.SwitchLoginUI
// 0x0001 (0x0001 - 0x0000)
struct XGSDKWinHelper_SwitchLoginUI final
{
public:
	EXGSDKLoginShowUIType                         loginUIType;                                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_XGSDKWinHelper_SwitchLoginUI;

}

