#pragma once

/*
* SDK generated by Rei-SdkDumper
* Based on Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: XGSDK

#include "Basic.hpp"

#include "XGSDK_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function XGSDK.XGSDKMgr.GetInstance
// 0x0030 (0x0030 - 0x0000)
struct XGSDKMgr_GetInstance final
{
public:
	class UGameInstance*                          gameInst;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UXGSDKMgr>               ReturnValue;                                       // 0x0008(0x0028)(Parm, OutParm, ReturnParm, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_XGSDKMgr_GetInstance;

// Function XGSDK.XGSDKMgr.GetListener
// 0x0028 (0x0028 - 0x0000)
struct XGSDKMgr_GetListener final
{
public:
	TSoftObjectPtr<class UXGSDKListener>          ReturnValue;                                       // 0x0000(0x0028)(Parm, OutParm, ReturnParm, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_XGSDKMgr_GetListener;

// Function XGSDK.XGSDKMgr.GetXgAppId
// 0x0010 (0x0010 - 0x0000)
struct XGSDKMgr_GetXgAppId final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_XGSDKMgr_GetXgAppId;

// Function XGSDK.XGSDKMgr.SubclassName
// 0x0010 (0x0010 - 0x0000)
struct XGSDKMgr_SubclassName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_XGSDKMgr_SubclassName;

// Function XGSDK.XGSDKMgr.ActivationExchange
// 0x0010 (0x0010 - 0x0000)
struct XGSDKMgr_ActivationExchange final
{
public:
	class FString                                 Code;                                              // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_XGSDKMgr_ActivationExchange;

// Function XGSDK.XGSDKMgr.AddTimelineEvent
// 0x0010 (0x0010 - 0x0000)
struct XGSDKMgr_AddTimelineEvent final
{
public:
	class FString                                 json_params;                                       // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_XGSDKMgr_AddTimelineEvent;

// Function XGSDK.XGSDKMgr.BindAccount
// 0x0050 (0x0050 - 0x0000)
struct XGSDKMgr_BindAccount final
{
public:
	TMap<class FString, class FString>            Data;                                              // 0x0000(0x0050)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_XGSDKMgr_BindAccount;

// Function XGSDK.XGSDKMgr.BindMobile
// 0x0070 (0x0070 - 0x0000)
struct XGSDKMgr_BindMobile final
{
public:
	class FString                                 Mobile;                                            // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 uid;                                               // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ServerID;                                          // 0x0020(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ZoneId;                                            // 0x0030(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 RoleId;                                            // 0x0040(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 RoleName;                                          // 0x0050(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 captcha;                                           // 0x0060(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_XGSDKMgr_BindMobile;

// Function XGSDK.XGSDKMgr.CallXGMethod
// 0x0040 (0x0040 - 0x0000)
struct XGSDKMgr_CallXGMethod final
{
public:
	class FString                                 methodName;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Params_0;                                          // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 customInfo;                                        // 0x0020(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0030(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_XGSDKMgr_CallXGMethod;

// Function XGSDK.XGSDKMgr.ExchangeGiftCode
// 0x0080 (0x0080 - 0x0000)
struct XGSDKMgr_ExchangeGiftCode final
{
public:
	class FString                                 uid;                                               // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 RoleId;                                            // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ZoneId;                                            // 0x0020(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ServerID;                                          // 0x0030(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 cdkey;                                             // 0x0040(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 userInfoUrl;                                       // 0x0050(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 dispatchUrl;                                       // 0x0060(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 customInfo;                                        // 0x0070(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_XGSDKMgr_ExchangeGiftCode;

// Function XGSDK.XGSDKMgr.Exit
// 0x0010 (0x0010 - 0x0000)
struct XGSDKMgr_Exit final
{
public:
	class FString                                 Param;                                             // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_XGSDKMgr_Exit;

// Function XGSDK.XGSDKMgr.GenQRCode
// 0x0028 (0x0028 - 0x0000)
struct XGSDKMgr_GenQRCode final
{
public:
	class FString                                 Content;                                           // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Width;                                             // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Rei-SdkDumper ])
	TArray<struct FColor>                         ReturnValue;                                       // 0x0018(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_XGSDKMgr_GenQRCode;

// Function XGSDK.XGSDKMgr.GetAdChannelId
// 0x0010 (0x0010 - 0x0000)
struct XGSDKMgr_GetAdChannelId final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_XGSDKMgr_GetAdChannelId;

// Function XGSDK.XGSDKMgr.GetBindInfoByMobile
// 0x0010 (0x0010 - 0x0000)
struct XGSDKMgr_GetBindInfoByMobile final
{
public:
	class FString                                 Mobile;                                            // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_XGSDKMgr_GetBindInfoByMobile;

// Function XGSDK.XGSDKMgr.GetBindInfoByUid
// 0x0010 (0x0010 - 0x0000)
struct XGSDKMgr_GetBindInfoByUid final
{
public:
	class FString                                 uid;                                               // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_XGSDKMgr_GetBindInfoByUid;

// Function XGSDK.XGSDKMgr.GetChannelAppId
// 0x0010 (0x0010 - 0x0000)
struct XGSDKMgr_GetChannelAppId final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_XGSDKMgr_GetChannelAppId;

// Function XGSDK.XGSDKMgr.GetChannelId
// 0x0010 (0x0010 - 0x0000)
struct XGSDKMgr_GetChannelId final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_XGSDKMgr_GetChannelId;

// Function XGSDK.XGSDKMgr.GetPayInfo
// 0x0140 (0x0140 - 0x0000)
struct XGSDKMgr_GetPayInfo final
{
public:
	struct FPayInfo                               ReturnValue;                                       // 0x0000(0x0140)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_XGSDKMgr_GetPayInfo;

// Function XGSDK.XGSDKMgr.GetPlanId
// 0x0010 (0x0010 - 0x0000)
struct XGSDKMgr_GetPlanId final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_XGSDKMgr_GetPlanId;

// Function XGSDK.XGSDKMgr.GetSystemLanguage
// 0x0010 (0x0010 - 0x0000)
struct XGSDKMgr_GetSystemLanguage final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_XGSDKMgr_GetSystemLanguage;

// Function XGSDK.XGSDKMgr.HasPackedChannel
// 0x0001 (0x0001 - 0x0000)
struct XGSDKMgr_HasPackedChannel final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_XGSDKMgr_HasPackedChannel;

// Function XGSDK.XGSDKMgr.Invite
// 0x0010 (0x0010 - 0x0000)
struct XGSDKMgr_Invite final
{
public:
	class FString                                 jsonInfo;                                          // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_XGSDKMgr_Invite;

// Function XGSDK.XGSDKMgr.Login
// 0x0010 (0x0010 - 0x0000)
struct XGSDKMgr_Login final
{
public:
	class FString                                 Param;                                             // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_XGSDKMgr_Login;

// Function XGSDK.XGSDKMgr.Logout
// 0x0010 (0x0010 - 0x0000)
struct XGSDKMgr_Logout final
{
public:
	class FString                                 Param;                                             // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_XGSDKMgr_Logout;

// Function XGSDK.XGSDKMgr.ManageBackgroundMode
// 0x0002 (0x0002 - 0x0000)
struct XGSDKMgr_ManageBackgroundMode final
{
public:
	bool                                          IsActive;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          isDuringReview;                                    // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_XGSDKMgr_ManageBackgroundMode;

// Function XGSDK.XGSDKMgr.OnAccountCreate
// 0x0070 (0x0070 - 0x0000)
struct XGSDKMgr_OnAccountCreate final
{
public:
	class FString                                 AccountId;                                         // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ServerID;                                          // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 serverName;                                        // 0x0020(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 serverVersion;                                     // 0x0030(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ZoneId;                                            // 0x0040(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 zoneName;                                          // 0x0050(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 customParams;                                      // 0x0060(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_XGSDKMgr_OnAccountCreate;

// Function XGSDK.XGSDKMgr.OnCreateRole
// 0x0120 (0x0120 - 0x0000)
struct XGSDKMgr_OnCreateRole final
{
public:
	struct FRoleInfo                              RoleInfo;                                          // 0x0000(0x0120)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_XGSDKMgr_OnCreateRole;

// Function XGSDK.XGSDKMgr.OnEnterGame
// 0x0120 (0x0120 - 0x0000)
struct XGSDKMgr_OnEnterGame final
{
public:
	struct FRoleInfo                              RoleInfo;                                          // 0x0000(0x0120)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_XGSDKMgr_OnEnterGame;

// Function XGSDK.XGSDKMgr.OnEvent
// 0x0158 (0x0158 - 0x0000)
struct XGSDKMgr_OnEvent final
{
public:
	struct FRoleInfo                              RoleInfo;                                          // 0x0000(0x0120)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FString                                 EventId;                                           // 0x0120(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 eventDesc;                                         // 0x0130(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         eventVal;                                          // 0x0140(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_144[0x4];                                      // 0x0144(0x0004)(Fixing Size After Last Property [ Rei-SdkDumper ])
	class FString                                 eventBodyJson;                                     // 0x0148(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_XGSDKMgr_OnEvent;

// Function XGSDK.XGSDKMgr.OnGameCreateOrder
// 0x0050 (0x0050 - 0x0000)
struct XGSDKMgr_OnGameCreateOrder final
{
public:
	class FString                                 ProductID;                                         // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 State;                                             // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 gameTradeNo;                                       // 0x0020(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 nOrderCreateCode;                                  // 0x0030(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 szOrderCreateMsg;                                  // 0x0040(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_XGSDKMgr_OnGameCreateOrder;

// Function XGSDK.XGSDKMgr.OnLogoutGame
// 0x0010 (0x0010 - 0x0000)
struct XGSDKMgr_OnLogoutGame final
{
public:
	class FString                                 Param;                                             // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_XGSDKMgr_OnLogoutGame;

// Function XGSDK.XGSDKMgr.OnMissionBegin
// 0x0158 (0x0158 - 0x0000)
struct XGSDKMgr_OnMissionBegin final
{
public:
	struct FRoleInfo                              RoleInfo;                                          // 0x0000(0x0120)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FString                                 missionId;                                         // 0x0120(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 missionName;                                       // 0x0130(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         doMissionTimes;                                    // 0x0140(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         roleCurrentPower;                                  // 0x0144(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Param;                                             // 0x0148(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_XGSDKMgr_OnMissionBegin;

// Function XGSDK.XGSDKMgr.OnNewUserMission
// 0x0120 (0x0120 - 0x0000)
struct XGSDKMgr_OnNewUserMission final
{
public:
	struct FRoleInfo                              RoleInfo;                                          // 0x0000(0x0120)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_XGSDKMgr_OnNewUserMission;

// Function XGSDK.XGSDKMgr.OnPayFinish
// 0x0140 (0x0140 - 0x0000)
struct XGSDKMgr_OnPayFinish final
{
public:
	struct FPayInfo                               PayInfo;                                           // 0x0000(0x0140)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_XGSDKMgr_OnPayFinish;

// Function XGSDK.XGSDKMgr.OnPrivateFunCodeUse
// 0x0160 (0x0160 - 0x0000)
struct XGSDKMgr_OnPrivateFunCodeUse final
{
public:
	struct FRoleInfo                              RoleInfo;                                          // 0x0000(0x0120)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FString                                 funCode;                                           // 0x0120(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 funCodeDesc;                                       // 0x0130(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 funCodeType;                                       // 0x0140(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 funCodeBatchId;                                    // 0x0150(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_XGSDKMgr_OnPrivateFunCodeUse;

// Function XGSDK.XGSDKMgr.OnPublicFunCodeUse
// 0x0160 (0x0160 - 0x0000)
struct XGSDKMgr_OnPublicFunCodeUse final
{
public:
	struct FRoleInfo                              RoleInfo;                                          // 0x0000(0x0120)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FString                                 funCode;                                           // 0x0120(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 funCodeDesc;                                       // 0x0130(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 funCodeType;                                       // 0x0140(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 funCodeBatchId;                                    // 0x0150(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_XGSDKMgr_OnPublicFunCodeUse;

// Function XGSDK.XGSDKMgr.OnRoleLevelup
// 0x0120 (0x0120 - 0x0000)
struct XGSDKMgr_OnRoleLevelup final
{
public:
	struct FRoleInfo                              RoleInfo;                                          // 0x0000(0x0120)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_XGSDKMgr_OnRoleLevelup;

// Function XGSDK.XGSDKMgr.OnSelectProduct
// 0x0010 (0x0010 - 0x0000)
struct XGSDKMgr_OnSelectProduct final
{
public:
	class FString                                 ProductID;                                         // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_XGSDKMgr_OnSelectProduct;

// Function XGSDK.XGSDKMgr.OpenUserCenter
// 0x0010 (0x0010 - 0x0000)
struct XGSDKMgr_OpenUserCenter final
{
public:
	class FString                                 Param;                                             // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_XGSDKMgr_OpenUserCenter;

// Function XGSDK.XGSDKMgr.OpenWebActivity
// 0x0050 (0x0050 - 0x0000)
struct XGSDKMgr_OpenWebActivity final
{
public:
	class FString                                 uid;                                               // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 activityType;                                      // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 RoleId;                                            // 0x0020(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ZoneId;                                            // 0x0030(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ServerID;                                          // 0x0040(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_XGSDKMgr_OpenWebActivity;

// Function XGSDK.XGSDKMgr.OpenXgQuestionnaire
// 0x0018 (0x0018 - 0x0000)
struct XGSDKMgr_OpenXgQuestionnaire final
{
public:
	int32                                         widthPercent;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         heightPercent;                                     // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 customParams;                                      // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_XGSDKMgr_OpenXgQuestionnaire;

// Function XGSDK.XGSDKMgr.OpenXgShare
// 0x0080 (0x0080 - 0x0000)
struct XGSDKMgr_OpenXgShare final
{
public:
	struct FShareInfo                             ShareInfo;                                         // 0x0000(0x0080)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_XGSDKMgr_OpenXgShare;

// Function XGSDK.XGSDKMgr.Pay
// 0x0140 (0x0140 - 0x0000)
struct XGSDKMgr_Pay final
{
public:
	struct FPayInfo                               PayInfo;                                           // 0x0000(0x0140)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_XGSDKMgr_Pay;

// Function XGSDK.XGSDKMgr.RefreshQuestionnaire
// 0x0150 (0x0150 - 0x0000)
struct XGSDKMgr_RefreshQuestionnaire final
{
public:
	struct FRoleInfo                              RoleInfo;                                          // 0x0000(0x0120)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FString                                 missionId;                                         // 0x0120(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 missionName;                                       // 0x0130(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 customParams;                                      // 0x0140(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_XGSDKMgr_RefreshQuestionnaire;

// Function XGSDK.XGSDKMgr.RefreshQuestionnaireByQuestInfo
// 0x0170 (0x0170 - 0x0000)
struct XGSDKMgr_RefreshQuestionnaireByQuestInfo final
{
public:
	struct FRoleInfo                              RoleInfo;                                          // 0x0000(0x0120)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FQuestInfo                             QuestInfo;                                         // 0x0120(0x0050)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_XGSDKMgr_RefreshQuestionnaireByQuestInfo;

// Function XGSDK.XGSDKMgr.RequestChallenge
// 0x0010 (0x0010 - 0x0000)
struct XGSDKMgr_RequestChallenge final
{
public:
	class FString                                 jsonInfo;                                          // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_XGSDKMgr_RequestChallenge;

// Function XGSDK.XGSDKMgr.ScanQRCode
// 0x0010 (0x0010 - 0x0000)
struct XGSDKMgr_ScanQRCode final
{
public:
	class FString                                 Info;                                              // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_XGSDKMgr_ScanQRCode;

// Function XGSDK.XGSDKMgr.SendCaptcha
// 0x0060 (0x0060 - 0x0000)
struct XGSDKMgr_SendCaptcha final
{
public:
	class FString                                 Mobile;                                            // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 uid;                                               // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ServerID;                                          // 0x0020(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ZoneId;                                            // 0x0030(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 RoleId;                                            // 0x0040(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 RoleName;                                          // 0x0050(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_XGSDKMgr_SendCaptcha;

// Function XGSDK.XGSDKMgr.SetFirebaseDefaultEventParameters
// 0x0050 (0x0050 - 0x0000)
struct XGSDKMgr_SetFirebaseDefaultEventParameters final
{
public:
	TMap<class FString, class FString>            defaultEventParameters;                            // 0x0000(0x0050)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_XGSDKMgr_SetFirebaseDefaultEventParameters;

// Function XGSDK.XGSDKMgr.ShareV2
// 0x0108 (0x0108 - 0x0000)
struct XGSDKMgr_ShareV2 final
{
public:
	struct FShareInfoV2                           ShareInfo;                                         // 0x0000(0x0108)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_XGSDKMgr_ShareV2;

// Function XGSDK.XGSDKMgr.SwitchAccount
// 0x0010 (0x0010 - 0x0000)
struct XGSDKMgr_SwitchAccount final
{
public:
	class FString                                 Param;                                             // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_XGSDKMgr_SwitchAccount;

// Function XGSDK.XGSDKMgr.SwitchLanguage
// 0x0010 (0x0010 - 0x0000)
struct XGSDKMgr_SwitchLanguage final
{
public:
	class FString                                 Language;                                          // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_XGSDKMgr_SwitchLanguage;

// Function XGSDK.XGSDKMgr.TrackAdjustAdRevenue
// 0x0110 (0x0110 - 0x0000)
struct XGSDKMgr_TrackAdjustAdRevenue final
{
public:
	struct FAdjustAdRevenue                       AdjustAdRevenue;                                   // 0x0000(0x0110)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_XGSDKMgr_TrackAdjustAdRevenue;

// Function XGSDK.XGSDKMgr.TrackAdjustEvent
// 0x00F0 (0x00F0 - 0x0000)
struct XGSDKMgr_TrackAdjustEvent final
{
public:
	struct FAdjustEvent                           AdjustEvent;                                       // 0x0000(0x00F0)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_XGSDKMgr_TrackAdjustEvent;

// Function XGSDK.XGSDKMgr.TrackEventSync
// 0x0030 (0x0030 - 0x0000)
struct XGSDKMgr_TrackEventSync final
{
public:
	class FString                                 EventId;                                           // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 eventDesc;                                         // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 eventBodyJson;                                     // 0x0020(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_XGSDKMgr_TrackEventSync;

// Function XGSDK.XGSDKMgr.TrackFirebaseEvent
// 0x0060 (0x0060 - 0x0000)
struct XGSDKMgr_TrackFirebaseEvent final
{
public:
	class FString                                 EventName;                                         // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<class FString, class FString>            eventBody;                                         // 0x0010(0x0050)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_XGSDKMgr_TrackFirebaseEvent;

// Function XGSDK.XGSDKMgr.UnbindAccount
// 0x0050 (0x0050 - 0x0000)
struct XGSDKMgr_UnbindAccount final
{
public:
	TMap<class FString, class FString>            Data;                                              // 0x0000(0x0050)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_XGSDKMgr_UnbindAccount;

// Function XGSDK.XGSDKMgr.UpdateBackgroundNotification
// 0x0050 (0x0050 - 0x0000)
struct XGSDKMgr_UpdateBackgroundNotification final
{
public:
	TMap<class FString, class FString>            Data;                                              // 0x0000(0x0050)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_XGSDKMgr_UpdateBackgroundNotification;

// Function XGSDK.XGSDKMgr.XgFeedBack
// 0x0030 (0x0030 - 0x0000)
struct XGSDKMgr_XgFeedBack final
{
public:
	class FString                                 appuserid;                                         // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 RoleId;                                            // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 RoleName;                                          // 0x0020(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_XGSDKMgr_XgFeedBack;

// Function XGSDK.XGSDKMgr.XgShare
// 0x0080 (0x0080 - 0x0000)
struct XGSDKMgr_XgShare final
{
public:
	struct FShareInfo                             ShareInfo;                                         // 0x0000(0x0080)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_XGSDKMgr_XgShare;

// Function XGSDK.XGSDKMgr.XgShareViaChannel
// 0x0080 (0x0080 - 0x0000)
struct XGSDKMgr_XgShareViaChannel final
{
public:
	struct FShareInfo                             ShareInfo;                                         // 0x0000(0x0080)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_XGSDKMgr_XgShareViaChannel;

// Function XGSDK.HyperLinkRichTextBlockDecorator.ClickFun
// 0x0050 (0x0050 - 0x0000)
struct HyperLinkRichTextBlockDecorator_ClickFun final
{
public:
	TMap<class FString, class FString>            MetaData;                                          // 0x0000(0x0050)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_HyperLinkRichTextBlockDecorator_ClickFun;

// Function XGSDK.XGSDKListener.DealWithCustomAction
// 0x0010 (0x0010 - 0x0000)
struct XGSDKListener_DealWithCustomAction final
{
public:
	class FString                                 Msg;                                               // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_XGSDKListener_DealWithCustomAction;

// Function XGSDK.XGSDKListener.DealWithCustomMessage
// 0x0010 (0x0010 - 0x0000)
struct XGSDKListener_DealWithCustomMessage final
{
public:
	class FString                                 msgCustom;                                         // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_XGSDKListener_DealWithCustomMessage;

// Function XGSDK.XGSDKListener.DealWithDeviceToken
// 0x0010 (0x0010 - 0x0000)
struct XGSDKListener_DealWithDeviceToken final
{
public:
	class FString                                 Token;                                             // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_XGSDKListener_DealWithDeviceToken;

// Function XGSDK.XGSDKListener.DealWithNotificationMessage
// 0x0010 (0x0010 - 0x0000)
struct XGSDKListener_DealWithNotificationMessage final
{
public:
	class FString                                 msgCustom;                                         // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_XGSDKListener_DealWithNotificationMessage;

// Function XGSDK.XGSDKListener.DoFinishQuestionnaire
// 0x0010 (0x0010 - 0x0000)
struct XGSDKListener_DoFinishQuestionnaire final
{
public:
	class FString                                 resultJsonString;                                  // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_XGSDKListener_DoFinishQuestionnaire;

// Function XGSDK.XGSDKListener.DoFreshQuestionnaire
// 0x0010 (0x0010 - 0x0000)
struct XGSDKListener_DoFreshQuestionnaire final
{
public:
	class FString                                 resultJsonString;                                  // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_XGSDKListener_DoFreshQuestionnaire;

// Function XGSDK.XGSDKListener.LaunchApp
// 0x0010 (0x0010 - 0x0000)
struct XGSDKListener_LaunchApp final
{
public:
	class FString                                 Msg;                                               // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_XGSDKListener_LaunchApp;

// Function XGSDK.XGSDKListener.OnBindAccountFail
// 0x0018 (0x0018 - 0x0000)
struct XGSDKListener_OnBindAccountFail final
{
public:
	int32                                         Code;                                              // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Rei-SdkDumper ])
	class FString                                 Msg;                                               // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_XGSDKListener_OnBindAccountFail;

// Function XGSDK.XGSDKListener.OnBindMobileFinish
// 0x0020 (0x0020 - 0x0000)
struct XGSDKListener_OnBindMobileFinish final
{
public:
	class FString                                 Code;                                              // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Msg;                                               // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_XGSDKListener_OnBindMobileFinish;

// Function XGSDK.XGSDKListener.OnEnterGameStoreSuccess
// 0x0010 (0x0010 - 0x0000)
struct XGSDKListener_OnEnterGameStoreSuccess final
{
public:
	class FString                                 Age;                                               // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_XGSDKListener_OnEnterGameStoreSuccess;

// Function XGSDK.XGSDKListener.OnExchangeGiftCodeFinish
// 0x0020 (0x0020 - 0x0000)
struct XGSDKListener_OnExchangeGiftCodeFinish final
{
public:
	class FString                                 Code;                                              // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Msg;                                               // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_XGSDKListener_OnExchangeGiftCodeFinish;

// Function XGSDK.XGSDKListener.OnGetAccountInfoFail
// 0x0018 (0x0018 - 0x0000)
struct XGSDKListener_OnGetAccountInfoFail final
{
public:
	int32                                         Code;                                              // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Rei-SdkDumper ])
	class FString                                 Msg;                                               // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_XGSDKListener_OnGetAccountInfoFail;

// Function XGSDK.XGSDKListener.OnGetAccountInfoSuccess
// 0x0010 (0x0010 - 0x0000)
struct XGSDKListener_OnGetAccountInfoSuccess final
{
public:
	class FString                                 resultJsonString;                                  // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_XGSDKListener_OnGetAccountInfoSuccess;

// Function XGSDK.XGSDKListener.OnGetBindInfo
// 0x0020 (0x0020 - 0x0000)
struct XGSDKListener_OnGetBindInfo final
{
public:
	class FString                                 Code;                                              // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Msg;                                               // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_XGSDKListener_OnGetBindInfo;

// Function XGSDK.XGSDKListener.OnGetBindInfoByMobile
// 0x0020 (0x0020 - 0x0000)
struct XGSDKListener_OnGetBindInfoByMobile final
{
public:
	class FString                                 Code;                                              // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Msg;                                               // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_XGSDKListener_OnGetBindInfoByMobile;

// Function XGSDK.XGSDKListener.OnGetBindInfoByUid
// 0x0020 (0x0020 - 0x0000)
struct XGSDKListener_OnGetBindInfoByUid final
{
public:
	class FString                                 Code;                                              // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Msg;                                               // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_XGSDKListener_OnGetBindInfoByUid;

// Function XGSDK.XGSDKListener.OnGetIPRegionFail
// 0x0018 (0x0018 - 0x0000)
struct XGSDKListener_OnGetIPRegionFail final
{
public:
	int32                                         Code;                                              // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Rei-SdkDumper ])
	class FString                                 Msg;                                               // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_XGSDKListener_OnGetIPRegionFail;

// Function XGSDK.XGSDKListener.OnGetIPRegionSuccess
// 0x0010 (0x0010 - 0x0000)
struct XGSDKListener_OnGetIPRegionSuccess final
{
public:
	class FString                                 resultJsonString;                                  // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_XGSDKListener_OnGetIPRegionSuccess;

// Function XGSDK.XGSDKListener.OnGetUidInfoFail
// 0x0018 (0x0018 - 0x0000)
struct XGSDKListener_OnGetUidInfoFail final
{
public:
	int32                                         Code;                                              // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Rei-SdkDumper ])
	class FString                                 Msg;                                               // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_XGSDKListener_OnGetUidInfoFail;

// Function XGSDK.XGSDKListener.OnGetUidInfoSuccess
// 0x0010 (0x0010 - 0x0000)
struct XGSDKListener_OnGetUidInfoSuccess final
{
public:
	class FString                                 json_content;                                      // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_XGSDKListener_OnGetUidInfoSuccess;

// Function XGSDK.XGSDKListener.OnHeadsetAvailable
// 0x0001 (0x0001 - 0x0000)
struct XGSDKListener_OnHeadsetAvailable final
{
public:
	bool                                          isAvailable;                                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_XGSDKListener_OnHeadsetAvailable;

// Function XGSDK.XGSDKListener.OnInitFail
// 0x0028 (0x0028 - 0x0000)
struct XGSDKListener_OnInitFail final
{
public:
	int32                                         Code;                                              // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Rei-SdkDumper ])
	class FString                                 Msg;                                               // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 channelCode;                                       // 0x0018(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_XGSDKListener_OnInitFail;

// Function XGSDK.XGSDKListener.OnInitSuccess
// 0x0028 (0x0028 - 0x0000)
struct XGSDKListener_OnInitSuccess final
{
public:
	int32                                         Code;                                              // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Rei-SdkDumper ])
	class FString                                 Msg;                                               // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 channelCode;                                       // 0x0018(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_XGSDKListener_OnInitSuccess;

// Function XGSDK.XGSDKListener.OnLoginCancel
// 0x0018 (0x0018 - 0x0000)
struct XGSDKListener_OnLoginCancel final
{
public:
	int32                                         Code;                                              // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Rei-SdkDumper ])
	class FString                                 Msg;                                               // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_XGSDKListener_OnLoginCancel;

// Function XGSDK.XGSDKListener.OnLoginFail
// 0x0028 (0x0028 - 0x0000)
struct XGSDKListener_OnLoginFail final
{
public:
	int32                                         Code;                                              // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Rei-SdkDumper ])
	class FString                                 Msg;                                               // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 channelCode;                                       // 0x0018(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_XGSDKListener_OnLoginFail;

// Function XGSDK.XGSDKListener.OnLoginSuccess
// 0x0018 (0x0018 - 0x0000)
struct XGSDKListener_OnLoginSuccess final
{
public:
	int32                                         Code;                                              // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Rei-SdkDumper ])
	class FString                                 authInfo;                                          // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_XGSDKListener_OnLoginSuccess;

// Function XGSDK.XGSDKListener.OnLogoutFail
// 0x0018 (0x0018 - 0x0000)
struct XGSDKListener_OnLogoutFail final
{
public:
	int32                                         Code;                                              // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Rei-SdkDumper ])
	class FString                                 Msg;                                               // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_XGSDKListener_OnLogoutFail;

// Function XGSDK.XGSDKListener.OnLogoutFinish
// 0x0018 (0x0018 - 0x0000)
struct XGSDKListener_OnLogoutFinish final
{
public:
	int32                                         Code;                                              // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Rei-SdkDumper ])
	class FString                                 Msg;                                               // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_XGSDKListener_OnLogoutFinish;

// Function XGSDK.XGSDKListener.OnPayCancel
// 0x0048 (0x0048 - 0x0000)
struct XGSDKListener_OnPayCancel final
{
public:
	int32                                         Code;                                              // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Rei-SdkDumper ])
	class FString                                 Msg;                                               // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 gameTradeNo;                                       // 0x0018(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 channelCode;                                       // 0x0028(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 channelMsg;                                        // 0x0038(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_XGSDKListener_OnPayCancel;

// Function XGSDK.XGSDKListener.OnPayFail
// 0x0048 (0x0048 - 0x0000)
struct XGSDKListener_OnPayFail final
{
public:
	int32                                         Code;                                              // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Rei-SdkDumper ])
	class FString                                 Msg;                                               // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 gameTradeNo;                                       // 0x0018(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 channelCode;                                       // 0x0028(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 channelMsg;                                        // 0x0038(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_XGSDKListener_OnPayFail;

// Function XGSDK.XGSDKListener.OnPayOthers
// 0x0048 (0x0048 - 0x0000)
struct XGSDKListener_OnPayOthers final
{
public:
	int32                                         Code;                                              // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Rei-SdkDumper ])
	class FString                                 Msg;                                               // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 gameTradeNo;                                       // 0x0018(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 channelCode;                                       // 0x0028(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 channelMsg;                                        // 0x0038(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_XGSDKListener_OnPayOthers;

// Function XGSDK.XGSDKListener.OnPayProgress
// 0x0048 (0x0048 - 0x0000)
struct XGSDKListener_OnPayProgress final
{
public:
	int32                                         Code;                                              // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Rei-SdkDumper ])
	class FString                                 Msg;                                               // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 gameTradeNo;                                       // 0x0018(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 channelCode;                                       // 0x0028(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 channelMsg;                                        // 0x0038(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_XGSDKListener_OnPayProgress;

// Function XGSDK.XGSDKListener.OnPaySuccess
// 0x0038 (0x0038 - 0x0000)
struct XGSDKListener_OnPaySuccess final
{
public:
	int32                                         Code;                                              // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Rei-SdkDumper ])
	class FString                                 Msg;                                               // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 gameTradeNo;                                       // 0x0018(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 xgTradeNo;                                         // 0x0028(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_XGSDKListener_OnPaySuccess;

// Function XGSDK.XGSDKListener.OnSendCaptchaFinish
// 0x0020 (0x0020 - 0x0000)
struct XGSDKListener_OnSendCaptchaFinish final
{
public:
	class FString                                 Code;                                              // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Msg;                                               // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_XGSDKListener_OnSendCaptchaFinish;

// Function XGSDK.XGSDKListener.OnShareFail
// 0x0010 (0x0010 - 0x0000)
struct XGSDKListener_OnShareFail final
{
public:
